--------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /volumes/ddisk/mi/researcher/reg_model.log
  log type:  text
 opened on:  21 Sep 2024, 14:01:42

. clear matrix;

. clear mata;

. *USING SIMPLER AND FINAL SPECIFICATION FOR DEGREE INTERACTIONS;
. *THE DATA IN CRI.CSV IS MODEL-LEVEL DATA;
. *THE DATA IN CRI_TEAM.CSV IS TEAM-LEVEL DATA;
. *TEAM LEVEL DATA CONTAINS MORE THAN ONE OBSERVATION PER TEAM FOR A FEW TEAMS, DUE TO
>  STOCK-FLOW DISTINCTION;
. *THIS PROGRAM USES THE MODEL LEVEL DATA;
. /*
> *DEFINITION OF KEY VARIABLES CONSTRUCTED BY BREZNAU-RINKE-WUTTKE (BRW) TEAM;
> - `belief_ipred` - Belief that Hypothesis is true       (that immigration reduces su
> pport), 
>         team average of predicted factor scores
> - `pro_immigrant` - Support laws to better integrate immigrants, team average, singl
> e question
> - `topic_ipred` - Knowledge and experience with the topic of immigration and welfare
>  state preferences, 
>         team average of predicted factor scores
> - `stats_ipred` - Knowledge and experience with quantiative statistical analysis, 
>         team average of predicted factor scores
> - `total_score` - Average score of each model from subjective voting amongst partici
> pants, 
>         each participant reviewed 3 to 4 models
> 
> SOURCE: 04_CRI_MAIN_ANALYSES.RMD
> Listing of variables used in construction of factor scores begins in line 262
> */
> 
> 
> 
> 
> 
> use /volumes/ddisk/mi/researcher/cri.dta, clear;

. generate teamid=u_teamid;

. destring teamid, force replace;
teamid already numeric; no replace

. unique teamid;
Number of unique values of teamid is  73
Number of records is  1309

. rename BELIEF_HYPOTHESIS belief_hypothesis;

. rename TOPIC_KNOWLEDGE topic_knowledge;

. rename STATISTICS_SKILL statistics_skill;

. rename MODEL_SCORE model_score;

. rename AME ame;

. rename DV dv;

. rename Jobs jobs;

. rename Unemp unemp;

. rename IncDiff incdiff;

. rename OldAge oldage;

. rename House house;

. rename Health health;

. rename Scale scale;

. rename Stock stock;

. rename Flow flow;

. rename ChangeFlow changeflow;

. rename belief_H1_11 belief_h1_11;

. rename belief_H1_12 belief_h1_12;

. rename belief_H1_13 belief_h1_13;

. rename Hresult hresult;

. rename Hsupport hsupport;

. rename Hreject hreject;

. rename Hrej hrej;

. rename Hsup hsup;

. rename Hnotest hnotest;

. rename Hmixed hmixed;

. *DROPS TEAMS WITH MISSING ID;
. drop if teamid==.;
(0 observations deleted)

. *DROPS THE BASELINE BRADY-FINNIGAN RESULTS;
. drop if teamid==0;
(48 observations deleted)

. unique teamid;
Number of unique values of teamid is  72
Number of records is  1261

. *SIMPLIFY DATA SET BY DROPPING IRRELEVANT VARIABLES;
. *drop AU-VE;
. *drop emigration_ivC-fbXleftright;
. *AVERAGE MARGINAL EFFECT VARIABLE;
. *START WITH 1253 MODELS WITH NON-MISSING AME;
. destring ame, replace force;
ame: contains nonnumeric characters; replaced as double
(8 missing values generated)

. drop if ame==.;
(8 observations deleted)

. summ ame;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |      1,253    .0007771    .1865197  -1.353765       2.47

. *TEAM 1 DOES NOT REPORT AN AME, SO WILL BE DELETED;
. list teamid if ame==.;

. drop if teamid==1;
(0 observations deleted)

. unique teamid;
Number of unique values of teamid is  71
Number of records is  1253

. *NUMBER OF MODELS PER TEAM;
. egen nmodel=count(ame), by(teamid);

. tabulate nmodel;

     nmodel |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          2        0.16        0.16
          2 |         10        0.80        0.96
          3 |          9        0.72        1.68
          4 |         20        1.60        3.27
          6 |         30        2.39        5.67
          8 |         40        3.19        8.86
         10 |         20        1.60       10.45
         12 |        216       17.24       27.69
         14 |         14        1.12       28.81
         16 |         64        5.11       33.92
         18 |         18        1.44       35.36
         20 |         40        3.19       38.55
         24 |        144       11.49       50.04
         32 |         64        5.11       55.15
         36 |        108        8.62       63.77
         48 |        192       15.32       79.09
         54 |         54        4.31       83.40
         96 |         96        7.66       91.06
        112 |        112        8.94      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. *TEAM SIZE;
. tabulate team_size;

  team_size |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        277       22.11       22.11
          2 |        399       31.84       53.95
          3 |        577       46.05      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. generate t2=(team_size==1);

. generate t3=(team_size==3);

. unique teamid if team_size==1;
Number of unique values of teamid is  14
Number of records is  277

. unique teamid if team_size==2;
Number of unique values of teamid is  27
Number of records is  399

. unique teamid if team_size==3;
Number of unique values of teamid is  30
Number of records is  577

. *PERCENT MEN IN TEAM;
. destring v_1101, force gen(v1101);
v_1101: contains nonnumeric characters; v1101 generated as byte
(126 missing values generated)

. destring v_1102, force gen(v1102);
v_1102: contains nonnumeric characters; v1102 generated as byte
(704 missing values generated)

. destring v_1103, force gen(v1103);
v_1103: contains nonnumeric characters; v1103 generated as byte
(301 missing values generated)

. tabulate v1101, missing;

     v_1101 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        839       66.96       66.96
          2 |        288       22.98       89.94
          . |        126       10.06      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. tabulate v1102, missing;

     v_1102 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        275       21.95       21.95
          2 |        274       21.87       43.81
          . |        704       56.19      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. tabulate v1103, missing;

     v_1103 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        498       39.74       39.74
          2 |        454       36.23       75.98
          . |        301       24.02      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. *TEAM 27 IS MISSING GENDER;
. list team_size backgr_degree1 backgr_degree2 backgr_degree3 if teamid==27;

      +-------------------------------------------+
      | team_s~e   backg~e1   backg~e2   backg~e3 |
      |-------------------------------------------|
 206. |        1          4         NA         NA |
 207. |        1          4         NA         NA |
 208. |        1          4         NA         NA |
 209. |        1          4         NA         NA |
 210. |        1          4         NA         NA |
      |-------------------------------------------|
 211. |        1          4         NA         NA |
 212. |        1          4         NA         NA |
 213. |        1          4         NA         NA |
 214. |        1          4         NA         NA |
 215. |        1          4         NA         NA |
      |-------------------------------------------|
 216. |        1          4         NA         NA |
 217. |        1          4         NA         NA |
      +-------------------------------------------+

. list v1101 v1102 v1103 if teamid==27;

      +-----------------------+
      | v1101   v1102   v1103 |
      |-----------------------|
 206. |     .       .       . |
 207. |     .       .       . |
 208. |     .       .       . |
 209. |     .       .       . |
 210. |     .       .       . |
      |-----------------------|
 211. |     .       .       . |
 212. |     .       .       . |
 213. |     .       .       . |
 214. |     .       .       . |
 215. |     .       .       . |
      |-----------------------|
 216. |     .       .       . |
 217. |     .       .       . |
      +-----------------------+

. *WILL USE HOT DECK IMPUTATION TO FILL IN THE GENDER OF THAT OBSERVATION;
. *TEAM 27 IS A ONE PERSON TEAM WITH A DEGREE IN FIELD 4;
. *TEAM LEVEL DATA SHOWS THAT 3 OTHER TEAMS (83, 87, 96) WITH SAME CHARACTERISTICS;
. *THOSE 3 TEAMS ARE 2 MEN AND ONE WOMEN;
. *WILL ASSIGN PMALE = .67 FOR TEAM 27;
. generate nmale=(v1101==1) + (v1102==1) + (v1103==1);

. generate team=(v1101~=.) + (v1102~=.) + (v1103~=.);

. generate pmale=nmale/team;
(12 missing values generated)

. replace pmale=.6666667 if teamid==27;
(12 real changes made)

. tabulate pmale;

      pmale |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        218       17.40       17.40
   .3333333 |        251       20.03       37.43
         .5 |         99        7.90       45.33
   .6666667 |        111        8.86       54.19
          1 |        574       45.81      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. *T-STATISTIC OF ESTIMATED AME AND IMPLIED STANDARD ERROR AT MODEL LEVEL;
. destring z, force replace;
z: contains nonnumeric characters; replaced as double
(1 missing value generated)

. generate oldz=z;
(1 missing value generated)

. replace z=abs(z);
(686 real changes made)

. gen std=abs(ame/z);
(3 missing values generated)

. summ ame z;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |      1,253    .0007771    .1865197  -1.353765       2.47
           z |      1,252    2.132401    3.242033          0   49.35065

. *FIELD OF HIGHEST DEGREE OF TEAM;
. tabulate backgr_degree1;

backgr_degr |
        ee1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         12        0.96        0.96
          2 |         90        7.18        8.14
          3 |        691       55.15       63.29
          4 |        330       26.34       89.62
          5 |         58        4.63       94.25
          6 |         36        2.87       97.13
          7 |         16        1.28       98.40
         NA |         20        1.60      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. destring backgr_degree1, force gen(degree1);
backgr_degree1: contains nonnumeric characters; degree1 generated as byte
(20 missing values generated)

. destring backgr_degree2, force gen(degree2);
backgr_degree2: contains nonnumeric characters; degree2 generated as byte
(676 missing values generated)

. destring backgr_degree3, force gen(degree3);
backgr_degree3: contains nonnumeric characters; degree3 generated as byte
(289 missing values generated)

. tabulate backgr_degree1 degree1;

backgr_deg |                     backgr_degree1
      ree1 |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
         1 |        12          0          0          0          0 |        12 
         2 |         0         90          0          0          0 |        90 
         3 |         0          0        691          0          0 |       691 
         4 |         0          0          0        330          0 |       330 
         5 |         0          0          0          0         58 |        58 
         6 |         0          0          0          0          0 |        36 
         7 |         0          0          0          0          0 |        16 
-----------+-------------------------------------------------------+----------
     Total |        12         90        691        330         58 |     1,233 


backgr_deg |    backgr_degree1
      ree1 |         6          7 |     Total
-----------+----------------------+----------
         1 |         0          0 |        12 
         2 |         0          0 |        90 
         3 |         0          0 |       691 
         4 |         0          0 |       330 
         5 |         0          0 |        58 
         6 |        36          0 |        36 
         7 |         0         16 |        16 
-----------+----------------------+----------
     Total |        36         16 |     1,233 

. summ degree1 degree2 degree3;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     degree1 |      1,233    3.408759    .9336709          1          7
     degree2 |        577    3.102253    .9023186          1          5
     degree3 |        964    3.525934    .8064844          3          6

. generate d1=degree1;
(20 missing values generated)

. generate d2=degree2;
(676 missing values generated)

. generate d3=degree3;
(289 missing values generated)

. replace d1=0 if d1==.;
(20 real changes made)

. replace d2=0 if d2==.;
(676 real changes made)

. replace d3=0 if d3==.;
(289 real changes made)

. generate counter=d1*100 + d2*10 + d3;

. generate counter2=team_size*1000 + counter;

. summ d1-d3 counter counter2;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
          d1 |      1,253     3.35435    1.020034          0          7
          d2 |      1,253    1.428571    1.663568          0          5
          d3 |      1,253     2.71269    1.645637          0          6
     counter |      1,253    352.4334    102.8099          5        703
    counter2 |      1,253    2591.859    787.3622       1100       3555

. tabulate counter2;

   counter2 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1100 |         12        0.96        0.96
       1200 |         24        1.92        2.87
       1300 |         71        5.67        8.54
       1400 |        132       10.53       19.07
       1500 |         26        2.08       21.15
       1600 |         12        0.96       22.11
       2204 |         48        3.83       25.94
       2303 |        182       14.53       40.46
       2306 |          9        0.72       41.18
       2400 |         12        0.96       42.14
       2404 |         88        7.02       49.16
       2504 |          6        0.48       49.64
       2505 |         14        1.12       50.76
       2606 |          4        0.32       51.08
       2654 |         20        1.60       52.67
       2703 |         16        1.28       53.95
       3005 |         20        1.60       55.55
       3244 |         18        1.44       56.98
       3323 |         32        2.55       59.54
       3333 |        284       22.67       82.20
       3336 |         36        2.87       85.08
       3343 |         53        4.23       89.31
       3344 |         24        1.92       91.22
       3414 |         48        3.83       95.05
       3433 |         22        1.76       96.81
       3443 |         12        0.96       97.77
       3444 |         16        1.28       99.04
       3555 |         12        0.96      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. *SIZE OF TEAM THAT PROVIDES A DEGREE, NOT EQUAL TO TEAM_SIZE BECAUSE OF MISSING INFO
> ;
. replace team=(degree1~=.) + (degree2~=.) + (degree3~=.);
(162 real changes made)

. *THESE ARE THE EXCLUSIVE DISCIPLINES;
. generate mdegree=1 if counter2==1100;
(1,241 missing values generated)

. replace mdegree=2 if counter2==1200;
(24 real changes made)

. replace mdegree=3 if counter2==1300 | counter2==2303 | counter2==3333;
(537 real changes made)

. replace mdegree=4 if counter2==1400 | counter2==2400 | counter2==2404 | counter2==34
> 44;
(248 real changes made)

. replace mdegree=5 if counter2==1500 | counter2==2505 | counter2==3555;
(52 real changes made)

. replace mdegree=6 if counter2==1600 | counter2==2606;
(16 real changes made)

. *ALL MIXED DEGREES FOR ACTUAL TEAM SIZE 2;
. replace mdegree=20 if (team==2 & mdegree==.) | counter2==2654 ;
(99 real changes made)

. tabulate counter2 if mdegree==20;

   counter2 |      Freq.     Percent        Cum.
------------+-----------------------------------
       2204 |         48       48.48       48.48
       2306 |          9        9.09       57.58
       2504 |          6        6.06       63.64
       2654 |         20       20.20       83.84
       2703 |         16       16.16      100.00
------------+-----------------------------------
      Total |         99      100.00

. *NOW BREAK UP TEAM SIZE 3 INTO 4 CATEGORIES;
. tabulate counter2 if mdegree==30;
no observations

. replace mdegree=31 if (counter2==3323 | counter2==3336
>         | counter2==3343);
(121 real changes made)

. replace mdegree=32 if (counter2==3244 
>         | counter2==3414 | counter2==3443);
(78 real changes made)

. *THE FOLLOWING 2 CATEGORIES USE DIFFERENT LEAD AUTHOR IN SOCIO OR POLI SCI TO CLASSI
> FY;
. replace mdegree=33 if (counter2==3344 );
(24 real changes made)

. replace mdegree=34 if ( counter2==3433);
(22 real changes made)

. tabulate counter2 if team==3 & mdegree==.;
no observations

. tabulate counter2 if team_size==3 & mdegree==.;

   counter2 |      Freq.     Percent        Cum.
------------+-----------------------------------
       3005 |         20      100.00      100.00
------------+-----------------------------------
      Total |         20      100.00

. replace mdegree=30 if team_size==3 & mdegree==.;
(20 real changes made)

. tabulate counter2 if mdegree==30, missing;

   counter2 |      Freq.     Percent        Cum.
------------+-----------------------------------
       3005 |         20      100.00      100.00
------------+-----------------------------------
      Total |         20      100.00

. tabulate counter2, sum(mdegree);

            |         Summary of mdegree
   counter2 |        Mean   Std. dev.       Freq.
------------+------------------------------------
       1100 |           1           0          12
       1200 |           2           0          24
       1300 |           3           0          71
       1400 |           4           0         132
       1500 |           5           0          26
       1600 |           6           0          12
       2204 |          20           0          48
       2303 |           3           0         182
       2306 |          20           0           9
       2400 |           4           0          12
       2404 |           4           0          88
       2504 |          20           0           6
       2505 |           5           0          14
       2606 |           6           0           4
       2654 |          20           0          20
       2703 |          20           0          16
       3005 |          30           0          20
       3244 |          32           0          18
       3323 |          31           0          32
       3333 |           3           0         284
       3336 |          31           0          36
       3343 |          31           0          53
       3344 |          33           0          24
       3414 |          32           0          48
       3433 |          34           0          22
       3443 |          32           0          12
       3444 |           4           0          16
       3555 |           5           0          12
------------+------------------------------------
      Total |    10.68316   11.758391       1,253

. *PRO-IMMIGRATION INDEX USES THE VARIABLE MEASURING THE GENERAL ATTITUDE TOWARDS IMMI
> GRATION, ATTITUDE_IMMIGRATION_11;
. *A VARIABLE COLLECTED IN THE FIRST WAVE QUESTIONNAIRE;
. *THE VARIABLE pro_immigrant in lower case IS THE MEAN OF THE INDEX WITHIN A TEAM;
. *THE PRO_IMMIGRANT VARIABLE IN UPPER CASE ONLY HAS 3 VALUES AS COMPARED TO MORE THAN
>  6 FOR THE pro_immigrant VARIABLE;
. *HIGHER VALUES OF PRO_IMMIGRANT INDICATE THAT IMMIGRATION LAWS SHOULD BE RELAXED, MO
> RE IMMIGRATION;
. *NOTE THAT ATTITUDE_IMMIGRATION_11 IS IN REVERSE ORDER;
. tabulate pro_immigrant attitude_immigration_11 if team_size==1;

                 |                attitude_immigration_11
   pro_immigrant |         1          2          3          4          5 |     Total
-----------------+-------------------------------------------------------+----------
               1 |         0          0          0          0          0 |        30 
               2 |         0          0          0          0         12 |        12 
               3 |         0          0          0         36          0 |        36 
               4 |         0          0         14          0          0 |        14 
               5 |         0         62          0          0          0 |        62 
               6 |       123          0          0          0          0 |       123 
-----------------+-------------------------------------------------------+----------
           Total |       123         62         14         36         12 |       277 


                 | attitude_i
                 | mmigration
                 |    _11
   pro_immigrant |         6 |     Total
-----------------+-----------+----------
               1 |        30 |        30 
               2 |         0 |        12 
               3 |         0 |        36 
               4 |         0 |        14 
               5 |         0 |        62 
               6 |         0 |       123 
-----------------+-----------+----------
           Total |        30 |       277 

. rename PRO_IMMIGRANT pro;

. generate proindex=pro_immigrant;

. destring proindex, force replace;
proindex: all characters numeric; replaced as double

. tabulate proindex pro, missing;

           |          PRO_IMMIGRANT
  proindex |      High        Low        Mid |     Total
-----------+---------------------------------+----------
         1 |         0         30          0 |        30 
         2 |         0         24          0 |        24 
  2.333333 |         0         12          0 |        12 
  2.666667 |         0         24          0 |        24 
         3 |         0         48          0 |        48 
  3.333333 |         0          0         20 |        20 
       3.5 |         0          0         80 |        80 
  3.666667 |         0          0        128 |       128 
         4 |         0          0         74 |        74 
  4.333333 |         0          0        160 |       160 
       4.5 |         0          0         98 |        98 
  4.666667 |        52          0          0 |        52 
         5 |       144          0          0 |       144 
  5.333333 |        28          0          0 |        28 
       5.5 |       122          0          0 |       122 
  5.666667 |        18          0          0 |        18 
         6 |       191          0          0 |       191 
-----------+---------------------------------+----------
     Total |       555        138        560 |     1,253 

. *CREATING PINDEX, PERCENT OF TEAM WITH PRO-IMMIGRATION IDEOLOGY;
. *SIMPLY COUNT NUMBER OF AUTHORS WITH CORRECT CODE IN ATTITUDE VARIABLE, AND DIVIDE B
> Y TEAM SIZE;
. destring attitude_immigration_11, force gen(att1);
attitude_immigration_11: contains nonnumeric characters; att1 generated as byte
(74 missing values generated)

. destring attitude_immigration_12, force gen(att2);
attitude_immigration_12: contains nonnumeric characters; att2 generated as byte
(684 missing values generated)

. destring attitude_immigration_13, force gen(att3);
attitude_immigration_13: contains nonnumeric characters; att3 generated as byte
(289 missing values generated)

. *REVERSE ORDER OF THE ATTITUDE IMMIGRATION VARIABLES TO MAKE THEM CONSISTENT WITH PR
> OINDEX;
. replace att1=7-att1;
(1,179 real changes made)

. replace att2=7-att2;
(569 real changes made)

. replace att3=7-att3;
(964 real changes made)

. *NOT ALL MEMBERS IN TEAM RESPONDED TO THE ATTITUDE_IMMIGRATION VARIABLES;
. *WILL USE ACTUAL NUMBER WHO RESPONDED TO DEFINE INDEX BELOW;
. replace team=(att1~=.) + (att2~=.) + (att3~=.);
(62 real changes made)

. generate npro=(att1>4 & att1~=.) + (att2>4 & att2~=.) + (att3>4 & att3~=.);

. tabulate npro;

       npro |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        338       26.98       26.98
          1 |        545       43.50       70.47
          2 |        312       24.90       95.37
          3 |         58        4.63      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. generate pindex=(npro/team);

. *DINDEX IS THE VARIABLE THAT MEASURES IF AT LEAST HALF OF THE TEAM IS PRO-IMMIGRANT;
. generate dindex=(pindex>=.5);

. summ npro pindex dindex;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        npro |      1,253    1.071828    .8362473          0          3
      pindex |      1,253    .5405693    .4084319          0          1
      dindex |      1,253    .5706305    .4951838          0          1

. generate npro1=(att1==1) + (att2==1) + (att3==1);

. generate npro2=(att1==2) + (att2==2) + (att3==2);

. generate npro3=(att1==3) + (att2==3) + (att3==3);

. generate npro4=(att1==4) + (att2==4) + (att3==4);

. generate npro5=(att1==5) + (att2==5) + (att3==5);

. generate npro6=(att1==6) + (att2==6) + (att3==6);

. *THE Px VARIABLES GIVE % OF TEAM THAT IS IN EACH OF THE CODES;
. generate p1=npro1/team;

. generate p2=npro2/team;

. generate p3=npro3/team;

. generate p4=npro4/team;

. generate p5=npro5/team;

. generate p6=npro6/team;

. *P12 P34 P56 GIVE % OF TEAM THAT IS 1,2 OR 3,4, OR 5,6;
. generate p12=p1+p2;

. generate p34=p3+p4;

. generate p56=p5+p6;

. *NOW DEFINING THE THREE TYPES OF TEAMS USED IN PAPER;
. *GROUP 1, AT LEAST 1 PERSON IN TEAM IS ANTI-IMMIGRATION;
. *GROUP 3, MORE THAN HALF OF TEAM IS PRO-IMMIGRATION, SAME AS DINDEX VARIABLE;
. *GROUP 2, THE MODERATE MIDDLE;
. *BUT THERE IS AN OVERLAP OF 2 TEAMS BETWEEN GROUPS 1 AND 3, BOTH TEAMS HAVE 3 PERSON
> S;
. *IN THESE TEAMS, 1 PERSON IS A 2 BUT BOTH OF THE OTHER PEOPLE ARE 5 OR 6;
. *WILL CLASSIFY THEM AS PRO-IMMIGRATION GROUP SINCE MAJORITY IS PRO-IMMIGRATION;
. generate group1=(p12>0);

. generate group3=(pindex>=.5);

. tabulate group3 dindex;

           |        dindex
    group3 |         0          1 |     Total
-----------+----------------------+----------
         0 |       538          0 |       538 
         1 |         0        715 |       715 
-----------+----------------------+----------
     Total |       538        715 |     1,253 

. tabulate group1 group3;

           |        group3
    group1 |         0          1 |     Total
-----------+----------------------+----------
         0 |       404        675 |     1,079 
         1 |       134         40 |       174 
-----------+----------------------+----------
     Total |       538        715 |     1,253 

. list teamid att1 att2 att3 if group1==1 & group3==1;

      +-----------------------------+
      | teamid   att1   att2   att3 |
      |-----------------------------|
 640. |     61      5      2      6 |
 641. |     61      5      2      6 |
 642. |     61      5      2      6 |
 643. |     61      5      2      6 |
 644. |     61      5      2      6 |
      |-----------------------------|
 645. |     61      5      2      6 |
 646. |     61      5      2      6 |
 647. |     61      5      2      6 |
 648. |     61      5      2      6 |
 649. |     61      5      2      6 |
      |-----------------------------|
 650. |     61      5      2      6 |
 651. |     61      5      2      6 |
 652. |     61      5      2      6 |
 653. |     61      5      2      6 |
 654. |     61      5      2      6 |
      |-----------------------------|
 655. |     61      5      2      6 |
 656. |     61      5      2      6 |
 657. |     61      5      2      6 |
 658. |     61      5      2      6 |
 659. |     61      5      2      6 |
      |-----------------------------|
 660. |     61      5      2      6 |
 661. |     61      5      2      6 |
 662. |     61      5      2      6 |
 663. |     61      5      2      6 |
 680. |     64      5      2      5 |
      |-----------------------------|
 681. |     64      5      2      5 |
 682. |     64      5      2      5 |
 683. |     64      5      2      5 |
 684. |     64      5      2      5 |
 685. |     64      5      2      5 |
      |-----------------------------|
 686. |     64      5      2      5 |
 687. |     64      5      2      5 |
 688. |     64      5      2      5 |
 689. |     64      5      2      5 |
 690. |     64      5      2      5 |
      |-----------------------------|
 691. |     64      5      2      5 |
 692. |     64      5      2      5 |
 693. |     64      5      2      5 |
 694. |     64      5      2      5 |
 695. |     64      5      2      5 |
      +-----------------------------+

. unique teamid if group1==10 & group3==1;
Number of unique values of teamid is  0
Number of records is  0

. replace group1=0 if group1==1 & group3==1;
(40 real changes made)

. replace group1=1 if group1==1 & group3==1;
(0 real changes made)

. generate group2=(group1==0 & group3==0);

. generate index=1*group1 +2*group2 + 3*group3;

. tabulate index;

      index |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        134       10.69       10.69
          2 |        404       32.24       42.94
          3 |        715       57.06      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. *TOPIC KNOWLEDGE;
. tabulate topic_knowledge, missing;

TOPIC_KNOWL |
       EDGE |      Freq.     Percent        Cum.
------------+-----------------------------------
       High |        390       31.13       31.13
        Low |        366       29.21       60.34
        Mid |        485       38.71       99.04
         NA |         12        0.96      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. *MISSING DATA FOR THIS VARIABLE AND IT ALL BELONGS TO TEAM 27;
. *MOREOVER TOPIC_KNOWLEDGE FOR TEAM 27 IN TEAM LEVEL DATA IS ALSO MISSING;
. *WILL USE A HOT DECK PROCEDURE TO IMPUTE BASED ON MDEGREE, TEAM SIZE, AND PMALE;
. tabulate teamid if topic_knowledge=="NA";

     teamid |      Freq.     Percent        Cum.
------------+-----------------------------------
         27 |         12      100.00      100.00
------------+-----------------------------------
      Total |         12      100.00

. summ mdegree  if teamid==27;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     mdegree |         12           4           0          4          4

. tabulate topic_knowledge if mdegree==40 & team_size==1 & pmale==0;
no observations

. tabulate topic_ipred if mdegree==40 & team_size==1 & pmale==0;
no observations

. replace topic_knowledge="Low" if teamid==27;
(12 real changes made)

. replace topic_ipred="-0.253722245526001" if teamid==27;
(12 real changes made)

. tabulate topic_knowledge, missing;

TOPIC_KNOWL |
       EDGE |      Freq.     Percent        Cum.
------------+-----------------------------------
       High |        390       31.13       31.13
        Low |        378       30.17       61.29
        Mid |        485       38.71      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. *TOPIC_CAT CONVERTS TOPIC_KNOWLEDGE INTO NUMERIC, NOTE CODE 4 IS NA;
. generate topic_cat=1*(topic_knowledge=="Low") + 2*(topic_knowledge=="Mid") 
>         + 3*(topic_knowledge=="High");

. *TOPIC VARIABLE IN BRW COMES FROM A FACTOR ANALYSIS PREDICTION;
. destring topic_ipred, force gen(topic_brw);
topic_ipred: all characters numeric; topic_brw generated as double

. tabulate topic_brw topic_knowledge, missing;

topic_ipre |         TOPIC_KNOWLEDGE
         d |      High        Low        Mid |     Total
-----------+---------------------------------+----------
 -.3396846 |         0          8          0 |         8 
 -.3125983 |         0         32          0 |        32 
   -.30488 |         0         24          0 |        24 
 -.2948698 |         0         12          0 |        12 
 -.2924661 |         0         12          0 |        12 
 -.2844923 |         0         12          0 |        12 
 -.2842492 |         0         16          0 |        16 
 -.2567398 |         0        112          0 |       112 
 -.2537222 |         0        108          0 |       108 
 -.2501658 |         0          6          0 |         6 
 -.2323944 |         0         24          0 |        24 
 -.2252685 |         0         12          0 |        12 
 -.2088186 |         0          0         12 |        12 
 -.2032106 |         0          0         12 |        12 
 -.1750503 |         0          0          2 |         2 
 -.1700541 |         0          0         48 |        48 
 -.1684909 |         0          0          6 |         6 
 -.1681252 |         0          0          4 |         4 
  -.159743 |         0          0         24 |        24 
  -.152279 |         0          0          3 |         3 
 -.1431925 |         0          0          2 |         2 
 -.1379568 |         0          0          2 |         2 
 -.1322295 |         0          0         32 |        32 
 -.1180402 |         0          0         48 |        48 
 -.1180365 |         0          0         12 |        12 
 -.1160367 |         0          0         20 |        20 
 -.1126539 |         0          0          6 |         6 
 -.1081857 |         0          0         18 |        18 
 -.1060163 |         0          0         10 |        10 
 -.1056993 |         0          0         12 |        12 
 -.0988388 |         0          0          3 |         3 
 -.0964761 |         0          0         36 |        36 
 -.0910359 |         0          0         12 |        12 
 -.0861576 |         0          0          1 |         1 
 -.0766422 |         0          0         12 |        12 
 -.0724543 |         0          0          8 |         8 
 -.0630017 |         0          0         36 |        36 
 -.0605945 |         0          0         16 |        16 
 -.0572294 |         0          0         12 |        12 
 -.0528801 |         0          0         10 |        10 
 -.0390203 |         0          0         12 |        12 
 -.0355067 |         0          0          8 |         8 
 -.0346285 |         0          0          2 |         2 
 -.0198385 |         0          0          6 |         6 
 -.0190452 |         0          0         12 |        12 
 -.0120221 |         0          0         20 |        20 
 -.0084401 |         0          0          6 |         6 
  .0020823 |        24          0          0 |        24 
  .0121719 |        54          0          0 |        54 
  .0199861 |         8          0          0 |         8 
  .0227601 |        14          0          0 |        14 
  .0236555 |        16          0          0 |        16 
  .0544597 |        48          0          0 |        48 
  .0605255 |        12          0          0 |        12 
  .0693577 |        24          0          0 |        24 
  .0731461 |         4          0          0 |         4 
   .084274 |        16          0          0 |        16 
  .0897856 |        12          0          0 |        12 
  .1259155 |         2          0          0 |         2 
  .1959201 |        12          0          0 |        12 
  .2198415 |        36          0          0 |        36 
   .233174 |        24          0          0 |        24 
  .2384678 |         4          0          0 |         4 
  .2590647 |         4          0          0 |         4 
  .3775455 |         1          0          0 |         1 
  .6968864 |        12          0          0 |        12 
  .7740507 |         8          0          0 |         8 
  .8162819 |         3          0          0 |         3 
  .8381723 |         4          0          0 |         4 
  1.210172 |        48          0          0 |        48 
-----------+---------------------------------+----------
     Total |       390        378        485 |     1,253 

. summ topic_brw;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   topic_brw |      1,253   -.0364832    .3129656  -.3396846   1.210172

. *STATS INFO IS MISSING FOR TEAM 27, BUT TEAM 27 DATA IS NOT AVAILABLE IN TEAM DATA;
. *WILL USE HOT DECK PROCEDURE;
. tabulate statistics_skill if mdegree==40 & team_size==1 & pmale==0;
no observations

. tabulate stats_ipred if mdegree==40 & team_size==1 & pmale==0;
no observations

. replace statistics_skill="Mid" if teamid==27;
(12 real changes made)

. replace stats_ipred="0.102538885683808" if teamid==27;
(12 real changes made)

. generate stats_cat=1*(statistics_skill=="Low") + 2*(statistics_skill=="Mid") 
>         + 3*(statistics_skill=="High");

. *STATISTICS VARIABLE IN BRW COMES FROM A FACTOR ANALYSIS PREDICTION;
. destring stats_ipred, force gen(stats_brw);
stats_ipred: all characters numeric; stats_brw generated as double

. tabulate teamid if stats_brw==.;
no observations

. replace stats_brw=0.649019158901927 if teamid==8;
(0 real changes made)

. tabulate statistics_skill, sum(stats_brw);

STATISTICS_ |       Summary of stats_ipred
      SKILL |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |   .73442269   .24230561         178
        Low |  -.51687865   .25222262         282
        Mid |  -.03007244   .17214468         793
------------+------------------------------------
      Total |  -.03102952   .42165622       1,253

. *REFEREE DATA;
. *MODEL SCORE AND DUMMY VARIABLE INDICATING HIGH QUALITY RESEARCH;
. tabulate model_score, missing;

MODEL_SCORE |      Freq.     Percent        Cum.
------------+-----------------------------------
       High |        294       23.46       23.46
        Low |        417       33.28       56.74
        Mid |        542       43.26      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. generate model_cat=1*(model_score=="Low") + 2*(model_score=="Mid") 
>         + 3*(model_score=="High");

.         *MODEL SCORE VARIABLE IN BRW COMES FROM A FACTOR ANALYSIS PREDICTION;
. generate model_brw=total_score;

. destring model_brw, force replace;
model_brw already numeric; no replace

. summ model_brw model_cat;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   model_brw |      1,253    .4471207    .1142991   .1488998   .7288508
   model_cat |      1,253    1.901836    .7471596          1          3

. *GENERATE HIGH QUALITY RESEARCH VARIABLE;
. *NOTE THAT QUALITY THRESHOLD IS DEFINED IN BRW STUDY;
. generate quality=(model_cat==3);

. *NOTE THAT SINGLE AUTHORS DO NOT PRODUCE VALUABLE RESEARCH;
. tabulate model_score team_size;

MODEL_SCOR |            team_size
         E |         1          2          3 |     Total
-----------+---------------------------------+----------
      High |         0         19        275 |       294 
       Low |       100        183        134 |       417 
       Mid |       177        197        168 |       542 
-----------+---------------------------------+----------
     Total |       277        399        577 |     1,253 

. *MERGING IN ALTERNATIVE REFEREE SCORE;
. sort id;

. merge id using /volumes/ddisk/mi/researcher/cri_new_peer_scores.dta;
(you are using old merge syntax; see [D] merge for new syntax)

. drop _merge;

. drop if ame==.;
(8 observations deleted)

. tabulate peer_mean;

  peer_mean |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |          7        0.58        0.58
        2.3 |          4        0.33        0.91
        2.6 |          4        0.33        1.23
          3 |         48        3.95        5.19
   3.142857 |         12        0.99        6.17
   3.285714 |         32        2.63        8.81
        3.4 |          8        0.66        9.47
        3.5 |         28        2.30       11.77
   3.666667 |          4        0.33       12.10
   3.692308 |          4        0.33       12.43
        3.7 |          2        0.16       12.59
   3.714286 |         12        0.99       13.58
        3.8 |          8        0.66       14.24
   3.833333 |         54        4.44       18.68
   3.843137 |         24        1.98       20.66
   3.888889 |          6        0.49       21.15
        3.9 |         12        0.99       22.14
       3.92 |         24        1.98       24.12
   3.952381 |          6        0.49       24.61
          4 |         20        1.65       26.26
   4.033333 |         24        1.98       28.23
   4.076923 |         16        1.32       29.55
   4.111111 |         16        1.32       30.86
   4.142857 |        130       10.70       41.56
   4.153846 |          2        0.16       41.73
   4.166667 |         24        1.98       43.70
   4.173077 |          2        0.16       43.87
   4.181818 |          4        0.33       44.20
        4.2 |         12        0.99       45.19
   4.222222 |         29        2.39       47.57
   4.285714 |         16        1.32       48.89
   4.304348 |          4        0.33       49.22
   4.333333 |        124       10.21       59.42
        4.4 |         42        3.46       62.88
   4.428571 |         91        7.49       70.37
   4.454545 |          1        0.08       70.45
   4.461538 |         12        0.99       71.44
   4.473684 |          1        0.08       71.52
   4.481481 |          2        0.16       71.69
   4.484848 |          1        0.08       71.77
        4.5 |         67        5.51       77.28
   4.521739 |          3        0.25       77.53
       4.55 |          1        0.08       77.61
   4.555556 |          1        0.08       77.70
     4.5625 |          1        0.08       77.78
   4.571429 |          4        0.33       78.11
        4.6 |         14        1.15       79.26
   4.636364 |         48        3.95       83.21
   4.666667 |         92        7.57       90.78
   4.756757 |         12        0.99       91.77
        4.8 |         12        0.99       92.76
   4.842105 |          8        0.66       93.42
   4.888889 |          8        0.66       94.07
       4.92 |         20        1.65       95.72
          5 |         26        2.14       97.86
        5.2 |          2        0.16       98.02
       5.25 |         12        0.99       99.01
   5.428571 |          8        0.66       99.67
   5.666667 |          4        0.33      100.00
------------+-----------------------------------
      Total |      1,215      100.00

. summ peer_mean, detail;

                          peer_mean
-------------------------------------------------------------
      Percentiles      Smallest
 1%          2.6              2
 5%            3              2
10%          3.5              2       Obs               1,215
25%            4              2       Sum of wgt.       1,215

50%     4.333333                      Mean           4.203944
                        Largest       Std. dev.      .5266504
75%          4.5       5.666667
90%     4.666667       5.666667       Variance       .2773606
95%         4.92       5.666667       Skewness      -.9818616
99%         5.25       5.666667       Kurtosis       5.123153

. generate quality2=(peer_mean>4.5);

. replace quality2=. if peer_mean==.;
(38 real changes made, 38 to missing)

. *IMPUTING MISSING VALUES OF PEER_MEAN USING MODEL_SCORE AND SPECIFICATION CHARATERIS
> TICS;
. global design jobs-health logit ols stock flow changeflow w1985-w2016 orig13 eeurope
>  allavailable 
>         twowayfe level_cyear mlm_fe mlm_re anynonlin;

.         summ peer_mean model_score;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   peer_mean |      1,215    4.203944    .5266504          2   5.666667
 model_score |          0

. generate pscore=peer_mean;
(38 missing values generated)

. regress peer_mean model_brw $design;
note: flow omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   =     1,215
-------------+----------------------------------   F(24, 1190)     =     34.05
       Model |  137.086953        24  5.71195637   Prob > F        =    0.0000
    Residual |  199.628857     1,190  .167755342   R-squared       =    0.4071
-------------+----------------------------------   Adj R-squared   =    0.3952
       Total |   336.71581     1,214  .277360634   Root MSE        =    .40958

------------------------------------------------------------------------------
   peer_mean | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   model_brw |   2.064219    .309029     6.68   0.000     1.457916    2.670521
        jobs |   .0402603   .0275441     1.46   0.144    -.0137801    .0943008
       unemp |   .0152979    .027794     0.55   0.582    -.0392329    .0698287
     incdiff |   .0217294   .0277998     0.78   0.435    -.0328126    .0762714
      oldage |   .0175151   .0275287     0.64   0.525    -.0364952    .0715254
       house |   .0337241   .0327091     1.03   0.303    -.0304498     .097898
      health |   .0694766   .0321217     2.16   0.031     .0064552     .132498
       logit |   .0045312   .0350218     0.13   0.897    -.0641801    .0732425
         ols |  -.4394082   .0690574    -6.36   0.000    -.5748961   -.3039203
       stock |  -.0049934   .0248678    -0.20   0.841    -.0537829    .0437962
        flow |          0  (omitted)
  changeflow |   .1076898   .0834466     1.29   0.197     -.056029    .2714086
       w1985 |   .3891232   .1279061     3.04   0.002     .1381766    .6400699
       w1990 |  -.5689784   .1249991    -4.55   0.000    -.8142216   -.3237352
       w1996 |   .4485643   .0430398    10.42   0.000      .364122    .5330066
       w2006 |   .6075289   .0648645     9.37   0.000     .4802673    .7347905
       w2016 |   .1748775   .0326295     5.36   0.000     .1108597    .2388954
      orig13 |    .137428   .0355999     3.86   0.000     .0675826    .2072735
     eeurope |   .0095592   .0610186     0.16   0.876    -.1101568    .1292753
allavailable |   .2074884   .0507655     4.09   0.000     .1078885    .3070883
    twowayfe |   .5312994   .0617502     8.60   0.000     .4101479    .6524509
 level_cyear |  -.3346596   .0437875    -7.64   0.000    -.4205689   -.2487503
      mlm_fe |   .1761109   .1100412     1.60   0.110    -.0397855    .3920073
      mlm_re |   .3369553   .0749657     4.49   0.000     .1898758    .4840349
   anynonlin |   .2283694   .0490613     4.65   0.000     .1321131    .3246257
       _cons |    1.74456   .1476256    11.82   0.000     1.454924    2.034195
------------------------------------------------------------------------------

. predict phat;
(option xb assumed; fitted values)

. replace pscore=phat if peer_mean==.;
(38 real changes made)

. summ pscore peer_mean model_brw;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      pscore |      1,253    4.190467      .52501          2   5.666667
   peer_mean |      1,215    4.203944    .5266504          2   5.666667
   model_brw |      1,253    .4471207    .1142991   .1488998   .7288508

. corr pscore model_brw;
(obs=1,253)

             |   pscore model_~w
-------------+------------------
      pscore |   1.0000
   model_brw |   0.2007   1.0000


. *BELIEF HYPOTHESIS HAS USUAL PROBLEM WITH MISSING DATA FOR TEAM 27;
. *WILL AGAIN USE HOT DECK PROCEDURE;
. tabulate belief_hypothesis if teamid==27;

BELIEF_HYPO |
     THESIS |      Freq.     Percent        Cum.
------------+-----------------------------------
         NA |         12      100.00      100.00
------------+-----------------------------------
      Total |         12      100.00

. tabulate belief_ipred if teamid==27;

      belief_ipred |      Freq.     Percent        Cum.
-------------------+-----------------------------------
                NA |         12      100.00      100.00
-------------------+-----------------------------------
             Total |         12      100.00

. tabulate belief_hypothesis if mdegree==40 & team_size==1 & pmale==0;
no observations

. replace belief_hypothesis="Low" if teamid==27;
(12 real changes made)

. replace belief_ipred="-1.13508799270782" if teamid==27;
(12 real changes made)

. tabulate belief_hypothesis, missing;

BELIEF_HYPO |
     THESIS |      Freq.     Percent        Cum.
------------+-----------------------------------
       High |        186       14.84       14.84
        Low |        230       18.36       33.20
        Mid |        837       66.80      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. generate belief_cat=1*(belief_hypothesis=="Low") + 2*(belief_hypothesis=="Mid") 
>         + 3*(belief_hypothesis=="High");

. tabulate belief_hypothesis belief_cat, missing;

BELIEF_HYP |            belief_cat
   OTHESIS |         1          2          3 |     Total
-----------+---------------------------------+----------
      High |         0          0        186 |       186 
       Low |       230          0          0 |       230 
       Mid |         0        837          0 |       837 
-----------+---------------------------------+----------
     Total |       230        837        186 |     1,253 

. destring belief_ipred, force replace;
belief_ipred: all characters numeric; replaced as double

. generate belief_brw=belief_ipred;

. summ belief_brw belief_cat;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  belief_brw |      1,253   -.0645854     .447783  -1.135088   .7355577
  belief_cat |      1,253    1.964884    .5753558          1          3

. *THERE IS PROBABLY A MISCODING OF WHAT "HIGH BELIEF" MEANS IN DATA SET;
. *SEE DISTRIBUTION.DO PROGRAM;
. *ALSO APPENDIX SAYS THERE ARE 161 RESEARCHERS IN 73 TEAMS, P. 5;
. *USING TEAM LEVEL DATA AND RESHAPING IT LEADS TO 159 PARTICIPANTS;
. *DOING TABULATION OF THE BELIEF_H1_Hx VARIABLES LEADS TO DISTRIBUTION OF BELIEF;
. *SIMILAR TO THAT IN APPENDIX QUESTIONNAIRE, P. 84, WHERE 1 MEANS BELIEF IMM STRONGLY
>  REDUCES SOCIAL POLICY SUPPORT;
. *ALTERNATIVE MEASURE OF BELIEF HYPOTHESIS USING INDIVIDUAL TEAM MEMBER BELIEFS;
. *SEE 002_CRI_DATA_PREP.RMD, LINE 356;
. *SUGGESTS CODING CHANGED FROM QUESTIONNAIRE AND HIGHER VALUES OF BELIEF_H1_11 SHOULD
>  INDICATE MORE BELIEF IN HYPOTHESIS;
. *BUT DISTRIBUTION OF VARIABLE COMPARED TO APPENDIX SUGGESTS THAT 1 IS STRONGLY REDUC
> ES, AND 4 IS SOMEWHAT INCREASES;
. *NOTE HIGH VALUE OF BELIEF_1_AVG MEANS *WEAKER* BELIEF IN HYPOTHESIS IMMIGRATION RED
> UCES SOCIAL SUPPORT;
. *NOTE THAT BELIEF_1_AVG AND BELIEF_H1_11 ARE THE SAME FOR SINGLE PERSON TEAMS;
. tabulate belief_1_avg belief_hypothesis;

                 |        BELIEF_HYPOTHESIS
    belief_1_avg |      High        Low        Mid |     Total
-----------------+---------------------------------+----------
               1 |         0         96          0 |        96 
1.66666666666667 |         0         16          0 |        16 
               2 |         0        106        272 |       378 
2.33333333333333 |         0          0        183 |       183 
             2.5 |         0          0        126 |       126 
2.66666666666667 |         0          0        111 |       111 
               3 |       160         12        141 |       313 
3.33333333333333 |        12          0          0 |        12 
             3.5 |        14          0          4 |        18 
-----------------+---------------------------------+----------
           Total |       186        230        837 |     1,253 

. tabulate belief_1_avg;

    belief_1_avg |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               1 |         96        7.66        7.66
1.66666666666667 |         16        1.28        8.94
               2 |        378       30.17       39.11
2.33333333333333 |        183       14.60       53.71
             2.5 |        126       10.06       63.77
2.66666666666667 |        111        8.86       72.63
               3 |        313       24.98       97.61
3.33333333333333 |         12        0.96       98.56
             3.5 |         18        1.44      100.00
-----------------+-----------------------------------
           Total |      1,253      100.00

. tabulate belief_1_avg belief_h1_11 if team_size==1;

                 |           belief_H1_11
    belief_1_avg |         1          2          3 |     Total
-----------------+---------------------------------+----------
               1 |        96          0          0 |        96 
               2 |         0         59          0 |        59 
               3 |         0          0        122 |       122 
-----------------+---------------------------------+----------
           Total |        96         59        122 |       277 

. destring belief_h1_11, force replace;
belief_h1_11: contains nonnumeric characters; replaced as byte
(20 missing values generated)

. destring belief_h1_12, force replace;
belief_h1_12: contains nonnumeric characters; replaced as byte
(676 missing values generated)

. destring belief_h1_13, force replace;
belief_h1_13: contains nonnumeric characters; replaced as byte
(289 missing values generated)

. tabulate belief_h1_11, missing;

belief_H1_1 |
          1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        112        8.94        8.94
          2 |        702       56.03       64.96
          3 |        383       30.57       95.53
          4 |         36        2.87       98.40
          . |         20        1.60      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. tabulate belief_h1_12, missing;

belief_H1_1 |
          2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |        251       20.03       20.03
          3 |        326       26.02       46.05
          . |        676       53.95      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. tabulate belief_h1_13, missing;

belief_H1_1 |
          3 |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |        550       43.89       43.89
          3 |        384       30.65       74.54
          4 |         30        2.39       76.94
          . |        289       23.06      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. *NBELIEF IS NUMBER IN TEAM THAT BELIEVES HYPOTHESIS IMMIGRATION REDUCES SUPPORT;
. *DBELIEF EQUALS 1 IF MORE THAN HALF THE TEAM BELIEVES IMMIGRATION REDUCES SUPPORT;
. *IF IMMIGRATION REDUCES SUPPORT IT WOULD MEAN THAT THE AME IS NEGATIVE;
. *USE CORRECT MEASURE OF TEAM SIZE TO DEFINE PBELIEF;
. *THE ORIGINAL BELIEF INDICES ONLY HAVE 4 POTENTIAL VALUES SO CANNOT DIFFERENTIATE LO
> WER AND UPPER ENDS;
. generate nbelief=(belief_h1_11<=2 & belief_h1_11~=.) 
>         + (belief_h1_12<=2 & belief_h1_12~=.) + (belief_h1_13<=2 & belief_h1_13~=.);

. replace team=(belief_h1_11~=.) + (belief_h1_12~=.) + (belief_h1_13~=.);
(62 real changes made)

. *generate nbelief=(belief_h1_11<2) + (belief_h1_12<2) + (belief_h1_13<2);
. generate pbelief=nbelief/team;

. tabulate pbelief;

    pbelief |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        319       25.46       25.46
   .3333333 |         99        7.90       33.36
         .5 |        150       11.97       45.33
   .6666667 |        195       15.56       60.89
          1 |        490       39.11      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. *******************************************;
. *TYPE OF DEPENDENT VARIABLE USED;
. encode dv, generate(dep);

. tabulate dv, sum(dep);

            |            Summary of DV
         DV |        Mean   Std. dev.       Freq.
------------+------------------------------------
     Health |           1           0         123
      House |           2           0         123
    IncDiff |           3           0         203
       Jobs |           4           0         203
     OldAge |           5           0         203
    Scale_4 |           6           0          33
    Scale_5 |           7           0          12
    Scale_6 |           8           0         114
Scale_Desrv |           9           0          18
 Scale_Univ |          10           0          18
      Unemp |          11           0         203
------------+------------------------------------
      Total |   5.2466081   3.2429326       1,253

. tabulate scale;

      Scale |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,058       84.44       84.44
          1 |        195       15.56      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. tabulate dv scale;

            |         Scale
         DV |         0          1 |     Total
------------+----------------------+----------
     Health |       123          0 |       123 
      House |       123          0 |       123 
    IncDiff |       203          0 |       203 
       Jobs |       203          0 |       203 
     OldAge |       203          0 |       203 
    Scale_4 |         0         33 |        33 
    Scale_5 |         0         12 |        12 
    Scale_6 |         0        114 |       114 
Scale_Desrv |         0         18 |        18 
 Scale_Univ |         0         18 |        18 
      Unemp |       203          0 |       203 
------------+----------------------+----------
      Total |     1,058        195 |     1,253 

.  ***************************************************************************;
. *ALL REGRESSIONS WILL BE WEIGHTED BY 1/NMODEL SO THEY ARE NUMERICALLY EQUIVALENT TO 
> TEAM LEVEL REGRESSIONS;
. *WILL LEAVE OUT PMALE FROM ALL REGRESSIONS;
. *WILL INCLUDE TEAM_SIZE IN THE REFEREE SCORE, QUALITY REGRESSIONS;
. reg ame  proindex    stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  cluster(
> teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0614
                                                Root MSE          =     .19874

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0116393   .0055867     2.08   0.041      .000497    .0227816
   stats_brw |   .0900395   .0418691     2.15   0.035     .0065342    .1735448
   topic_brw |  -.1294198   .0531681    -2.43   0.017    -.2354601   -.0233794
          t2 |  -.0096454   .0153086    -0.63   0.531    -.0401774    .0208866
          t3 |   .0038016   .0244364     0.16   0.877    -.0449353    .0525384
             |
     mdegree |
          2  |  -.1804028   .0546084    -3.30   0.002    -.2893157   -.0714898
          3  |  -.1814254   .0503022    -3.61   0.001    -.2817499   -.0811009
          4  |  -.1826953   .0541265    -3.38   0.001    -.2906472   -.0747433
          5  |  -.1329846   .0641917    -2.07   0.042     -.261011   -.0049582
          6  |  -.2044895   .0555489    -3.68   0.000    -.3152782   -.0937007
         20  |   -.172863   .0510096    -3.39   0.001    -.2745985   -.0711275
         30  |   -.457071   .0532694    -8.58   0.000    -.5633135   -.3508285
         31  |  -.1777304   .0627677    -2.83   0.006    -.3029166   -.0525442
         32  |  -.1891611   .0560891    -3.37   0.001    -.3010273    -.077295
         33  |  -.1822046   .0646703    -2.82   0.006    -.3111854   -.0532238
         34  |    -.26998   .0970128    -2.78   0.007     -.463466    -.076494
             |
       _cons |   .1247144   .0542707     2.30   0.025     .0164749    .2329539
------------------------------------------------------------------------------

. reg ame  dindex    stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  cluster(te
> amid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0657
                                                Root MSE          =     .19828

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0398253   .0145235     2.74   0.008      .010859    .0687915
   stats_brw |   .0863276    .038733     2.23   0.029     .0090772    .1635781
   topic_brw |  -.1257943   .0508545    -2.47   0.016    -.2272204   -.0243682
          t2 |  -.0031431   .0150992    -0.21   0.836    -.0332575    .0269713
          t3 |   .0109625   .0235825     0.46   0.643    -.0360712    .0579963
             |
     mdegree |
          2  |  -.1639222   .0510658    -3.21   0.002    -.2657697   -.0620746
          3  |  -.1749967   .0505179    -3.46   0.001    -.2757515   -.0742419
          4  |  -.1734813   .0549028    -3.16   0.002    -.2829814   -.0639812
          5  |  -.1232372   .0616521    -2.00   0.050    -.2461984    -.000276
          6  |  -.1902871   .0551346    -3.45   0.001    -.3002496   -.0803246
         20  |  -.1618314   .0531094    -3.05   0.003    -.2677547   -.0559082
         30  |    -.44713   .0579352    -7.72   0.000    -.5626781   -.3315819
         31  |  -.1686578   .0632633    -2.67   0.010    -.2948325    -.042483
         32  |  -.1818467   .0554282    -3.28   0.002    -.2923947   -.0712987
         33  |  -.1585105   .0622615    -2.55   0.013     -.282687   -.0343339
         34  |  -.2584638   .0893027    -2.89   0.005    -.4365725   -.0803552
             |
       _cons |   .1372257   .0481557     2.85   0.006     .0411823    .2332691
------------------------------------------------------------------------------

. reg ame  group1 group3    stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  clu
> ster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0703
                                                Root MSE          =     .19788

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   -.054467    .029377    -1.85   0.068    -.1130575    .0041236
      group3 |   .0244587   .0135193     1.81   0.075    -.0025048    .0514222
   stats_brw |   .0819837   .0372065     2.20   0.031     .0077777    .1561896
   topic_brw |  -.1300778   .0509323    -2.55   0.013     -.231659   -.0284966
          t2 |   .0019352   .0147636     0.13   0.896    -.0275099    .0313803
          t3 |   .0123606   .0219355     0.56   0.575    -.0313885    .0561096
             |
     mdegree |
          2  |  -.2135426   .0618332    -3.45   0.001     -.336865   -.0902201
          3  |  -.2016799   .0537663    -3.75   0.000    -.3089135   -.0944463
          4  |  -.2039425   .0585804    -3.48   0.001    -.3207774   -.0871075
          5  |  -.1514827   .0646649    -2.34   0.022    -.2804527   -.0225126
          6  |  -.2250256   .0596693    -3.77   0.000    -.3440323   -.1060188
         20  |  -.1955471   .0562475    -3.48   0.001    -.3077291    -.083365
         30  |  -.4763459   .0607573    -7.84   0.000    -.5975225   -.3551693
         31  |  -.1952754   .0674265    -2.90   0.005    -.3297534   -.0607975
         32  |  -.2059973   .0555845    -3.71   0.000    -.3168572   -.0951375
         33  |  -.1466609   .0611378    -2.40   0.019    -.2685964   -.0247255
         34  |  -.2940877   .0965472    -3.05   0.003     -.486645   -.1015303
             |
       _cons |   .1798427   .0563821     3.19   0.002     .0673921    .2922934
------------------------------------------------------------------------------

. *ADDING BELIEF;
. reg ame  proindex  pbelief  stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  c
> luster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0619
                                                Root MSE          =     .19877

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0121576   .0054319     2.24   0.028      .001324    .0229911
     pbelief |  -.0130332   .0151424    -0.86   0.392    -.0432337    .0171673
   stats_brw |   .0892368   .0409995     2.18   0.033     .0074659    .1710077
   topic_brw |  -.1300511   .0526199    -2.47   0.016    -.2349982   -.0251041
          t2 |  -.0108112   .0142816    -0.76   0.452     -.039295    .0176726
          t3 |   .0038463   .0243519     0.16   0.875     -.044722    .0524146
             |
     mdegree |
          2  |  -.1930433   .0634073    -3.04   0.003    -.3195052   -.0665814
          3  |  -.1879071   .0534138    -3.52   0.001    -.2944376   -.0813766
          4  |  -.1912577   .0583726    -3.28   0.002    -.3076782   -.0748372
          5  |  -.1329573   .0637072    -2.09   0.041    -.2600173   -.0058973
          6  |  -.2143325   .0603783    -3.55   0.001    -.3347532   -.0939119
         20  |  -.1804268   .0537757    -3.36   0.001     -.287679   -.0731746
         30  |  -.4722729   .0626124    -7.54   0.000    -.5971495   -.3473964
         31  |  -.1845294   .0674555    -2.74   0.008    -.3190651   -.0499936
         32  |    -.19483   .0588956    -3.31   0.001    -.3122935   -.0773665
         33  |  -.1871583   .0672849    -2.78   0.007    -.3213538   -.0529628
         34  |  -.2775665   .1011323    -2.74   0.008    -.4792685   -.0758644
             |
       _cons |    .136659   .0617679     2.21   0.030     .0134669    .2598511
------------------------------------------------------------------------------

. reg ame  dindex  pbelief  stats_brw topic_brw t2 t3 i.mdegree    [aw=1/nmodel] ,  cl
> uster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0665
                                                Root MSE          =     .19828

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0418244   .0147802     2.83   0.006     .0123463    .0713026
     pbelief |  -.0171121   .0159949    -1.07   0.288     -.049013    .0147888
   stats_brw |   .0851309   .0375655     2.27   0.027     .0102089    .1600529
   topic_brw |  -.1265001   .0497724    -2.54   0.013    -.2257679   -.0272322
          t2 |  -.0043382   .0138237    -0.31   0.755    -.0319086    .0232322
          t3 |   .0113801   .0235577     0.48   0.631    -.0356043    .0583645
             |
     mdegree |
          2  |  -.1796535   .0602438    -2.98   0.004     -.299806    -.059501
          3  |  -.1829834   .0538258    -3.40   0.001    -.2903356   -.0756313
          4  |  -.1840596   .0591765    -3.11   0.003    -.3020834   -.0660358
          5  |  -.1226585   .0605999    -2.02   0.047    -.2435211   -.0017959
          6  |  -.2023239   .0598319    -3.38   0.001    -.3216549   -.0829929
         20  |  -.1710123   .0560331    -3.05   0.003    -.2827667   -.0592579
         30  |   -.466238   .0680464    -6.85   0.000    -.6019523   -.3305238
         31  |  -.1769586   .0677513    -2.61   0.011    -.3120843   -.0418329
         32  |   -.188753   .0584565    -3.23   0.002    -.3053408   -.0721653
         33  |  -.1637086   .0642147    -2.55   0.013    -.2917808   -.0356363
         34  |  -.2676668    .093394    -2.87   0.005    -.4539353   -.0813983
             |
       _cons |   .1537664   .0559727     2.75   0.008     .0421323    .2654005
------------------------------------------------------------------------------

. reg ame  group1 group3  pbelief  stats_brw topic_brw t2 t3 i.mdegree    [aw=1/nmodel
> ] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0707
                                                Root MSE          =     .19791

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0525287   .0295954    -1.77   0.080    -.1115549    .0064974
      group3 |   .0264802   .0138097     1.92   0.059    -.0010624    .0540227
     pbelief |  -.0126222   .0161739    -0.78   0.438      -.04488    .0196356
   stats_brw |   .0812555   .0364356     2.23   0.029     .0085871     .153924
   topic_brw |   -.130446   .0502052    -2.60   0.011    -.2305772   -.0303148
          t2 |   .0008729   .0138297     0.06   0.950    -.0267095    .0284553
          t3 |   .0126188   .0220293     0.57   0.569    -.0313173    .0565549
             |
     mdegree |
          2  |  -.2233805   .0681825    -3.28   0.002    -.3593663   -.0873948
          3  |  -.2066215   .0564182    -3.66   0.000     -.319144    -.094099
          4  |  -.2106612   .0620925    -3.39   0.001    -.3345009   -.0868216
          5  |  -.1500507   .0632937    -2.37   0.021     -.276286   -.0238154
          6  |  -.2326679   .0634288    -3.67   0.000    -.3591728   -.1061631
         20  |  -.2011192   .0586552    -3.43   0.001    -.3181032   -.0841352
         30  |  -.4894007    .070186    -6.97   0.000    -.6293824    -.349419
         31  |  -.2004511   .0714724    -2.80   0.007    -.3429982   -.0579039
         32  |  -.2102321   .0582459    -3.61   0.001    -.3263999   -.0940644
         33  |  -.1509168    .063727    -2.37   0.021    -.2780163   -.0238173
         34  |  -.2996082   .0996142    -3.01   0.004    -.4982824   -.1009341
             |
       _cons |    .190527   .0623558     3.06   0.003     .0661622    .3148917
------------------------------------------------------------------------------

. ***************************************************************************;
. *WEIGHTED REGRESSIONS USING PSCORE/NMODEL;
. *WEIGHTING BY QUALITY HELPS ADDRESS PUBLICATION BIAS PROBLEM;
. reg ame  proindex    stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel] ,  clu
> ster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0630
                                                Root MSE          =     .20012

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0120471   .0055591     2.17   0.034     .0009598    .0231343
   stats_brw |   .0920492   .0429925     2.14   0.036     .0063034     .177795
   topic_brw |  -.1309698   .0544387    -2.41   0.019    -.2395444   -.0223953
          t2 |  -.0097905   .0155678    -0.63   0.531    -.0408394    .0212585
          t3 |   .0031476   .0253026     0.12   0.901    -.0473169     .053612
             |
     mdegree |
          2  |   -.183392   .0565183    -3.24   0.002    -.2961142   -.0706697
          3  |  -.1856859   .0538491    -3.45   0.001    -.2930846   -.0782872
          4  |  -.1892911    .057113    -3.31   0.001    -.3031994   -.0753827
          5  |  -.1339627   .0658694    -2.03   0.046     -.265335   -.0025903
          6  |  -.2077685   .0586692    -3.54   0.001    -.3247806   -.0907564
         20  |  -.1752975    .053935    -3.25   0.002    -.2828675   -.0677276
         30  |  -.4603683   .0549758    -8.37   0.000     -.570014   -.3507226
         31  |  -.1852679   .0635055    -2.92   0.005    -.3119256   -.0586102
         32  |   -.190316   .0564724    -3.37   0.001    -.3029467   -.0776854
         33  |  -.1851722   .0657841    -2.81   0.006    -.3163745   -.0539698
         34  |  -.2809694   .0971726    -2.89   0.005     -.474774   -.0871648
             |
       _cons |   .1264393   .0548727     2.30   0.024     .0169991    .2358794
------------------------------------------------------------------------------

. reg ame  dindex    stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel] ,  clust
> er(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0675
                                                Root MSE          =     .19963

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0405764   .0151003     2.69   0.009     .0104599     .070693
   stats_brw |   .0886471   .0398114     2.23   0.029     .0092457    .1680484
   topic_brw |  -.1268536   .0518138    -2.45   0.017    -.2301929   -.0235143
          t2 |  -.0032695   .0152839    -0.21   0.831    -.0337522    .0272133
          t3 |   .0106099   .0240433     0.44   0.660    -.0373429    .0585628
             |
     mdegree |
          2  |  -.1668315   .0524477    -3.18   0.002     -.271435   -.0622279
          3  |  -.1790318   .0531498    -3.37   0.001    -.2850358   -.0730278
          4  |  -.1793226   .0570563    -3.14   0.002    -.2931179   -.0655274
          5  |  -.1245265    .063134    -1.97   0.053    -.2504432    .0013902
          6  |  -.1923775   .0568884    -3.38   0.001    -.3058378   -.0789172
         20  |   -.163636    .055437    -2.95   0.004    -.2742016   -.0530704
         30  |  -.4503091   .0589142    -7.64   0.000    -.5678098   -.3328084
         31  |  -.1760259   .0633061    -2.78   0.007    -.3022859    -.049766
         32  |  -.1837491   .0556445    -3.30   0.002    -.2947286   -.0727695
         33  |  -.1617153   .0628429    -2.57   0.012    -.2870515   -.0363792
         34  |  -.2684635   .0890197    -3.02   0.004    -.4460078   -.0909193
             |
       _cons |    .140269    .050012     2.80   0.007     .0405233    .2400147
------------------------------------------------------------------------------

. reg ame  group1 group3    stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel] ,
>   cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0729
                                                Root MSE          =     .19914

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0582326   .0325213    -1.79   0.078    -.1230942    .0066291
      group3 |   .0247556   .0135577     1.83   0.072    -.0022844    .0517957
   stats_brw |   .0824518   .0377324     2.19   0.032     .0071968    .1577068
   topic_brw |  -.1306958   .0518089    -2.52   0.014    -.2340254   -.0273662
          t2 |   .0026432   .0147958     0.18   0.859    -.0268662    .0321526
          t3 |   .0129497    .021795     0.59   0.554     -.030519    .0564185
             |
     mdegree |
          2  |  -.2179342   .0642271    -3.39   0.001    -.3460311   -.0898372
          3  |  -.2058674   .0563474    -3.65   0.000    -.3182487   -.0934862
          4  |  -.2107133   .0609407    -3.46   0.001    -.3322558   -.0891709
          5  |  -.1527591   .0661516    -2.31   0.024    -.2846942   -.0208239
          6  |  -.2279165   .0619981    -3.68   0.000    -.3515677   -.1042653
         20  |  -.1983287   .0587288    -3.38   0.001    -.3154596   -.0811979
         30  |  -.4807457   .0621173    -7.74   0.000    -.6046348   -.3568565
         31  |   -.203052   .0682924    -2.97   0.004     -.339257    -.066847
         32  |  -.2093088   .0560859    -3.73   0.000    -.3211685   -.0974491
         33  |  -.1471221   .0613559    -2.40   0.019    -.2694926   -.0247516
         34  |  -.3057097   .0969643    -3.15   0.002    -.4990988   -.1123206
             |
       _cons |   .1834046   .0587201     3.12   0.003     .0662911    .3005182
------------------------------------------------------------------------------

. *ADDING BELIEF;
. reg ame  proindex  pbelief  stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel]
>  ,  cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0636
                                                Root MSE          =     .20013

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0126987   .0054081     2.35   0.022     .0019126    .0234849
     pbelief |   -.015133   .0150869    -1.00   0.319    -.0452229    .0149568
   stats_brw |   .0912723   .0420989     2.17   0.034     .0073087    .1752359
   topic_brw |  -.1320031   .0538053    -2.45   0.017    -.2393143   -.0246919
          t2 |  -.0109571   .0144424    -0.76   0.451    -.0397614    .0178473
          t3 |   .0034179   .0252752     0.14   0.893    -.0469919    .0538277
             |
     mdegree |
          2  |  -.1983356   .0653932    -3.03   0.003    -.3287582   -.0679129
          3  |  -.1932411   .0567703    -3.40   0.001    -.3064659   -.0800164
          4  |  -.1990905    .060989    -3.26   0.002    -.3207293   -.0774517
          5  |  -.1341594   .0653018    -2.05   0.044    -.2643998   -.0039191
          6  |  -.2195703   .0635581    -3.45   0.001    -.3463329   -.0928078
         20  |  -.1842148   .0566443    -3.25   0.002    -.2971883   -.0712413
         30  |  -.4783827    .064355    -7.43   0.000    -.6067348   -.3500307
         31  |  -.1937403    .068309    -2.84   0.006    -.3299783   -.0575023
         32  |  -.1971222    .059215    -3.33   0.001    -.3152229   -.0790215
         33  |  -.1912042   .0683427    -2.80   0.007    -.3275094    -.054899
         34  |  -.2902977   .1016713    -2.86   0.006    -.4930748   -.0875206
             |
       _cons |   .1401687    .062246     2.25   0.027      .016023    .2643145
------------------------------------------------------------------------------

. reg ame  dindex  pbelief  stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel] ,
>   cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0686
                                                Root MSE          =      .1996

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0430906   .0154888     2.78   0.007      .012199    .0739821
     pbelief |  -.0199959   .0160138    -1.25   0.216    -.0519345    .0119427
   stats_brw |   .0874644   .0385495     2.27   0.026     .0105797     .164349
   topic_brw |  -.1280347   .0504968    -2.54   0.013    -.2287475    -.027322
          t2 |  -.0043881   .0138343    -0.32   0.752    -.0319796    .0232035
          t3 |   .0114265   .0240167     0.48   0.636    -.0364733    .0593262
             |
     mdegree |
          2  |  -.1855092   .0617674    -3.00   0.004    -.3087004   -.0623181
          3  |  -.1883646   .0562779    -3.35   0.001    -.3006073   -.0761219
          4  |  -.1914128   .0610113    -3.14   0.002    -.3130959   -.0697297
          5  |  -.1241402   .0618976    -2.01   0.049     -.247591   -.0006894
          6  |  -.2068145   .0617341    -3.35   0.001    -.3299394   -.0836897
         20  |  -.1744586    .058419    -2.99   0.004    -.2909716   -.0579457
         30  |  -.4730621   .0691793    -6.84   0.000    -.6110359   -.3350884
         31  |  -.1864473   .0679326    -2.74   0.008    -.3219346   -.0509599
         32  |  -.1921234    .058594    -3.28   0.002    -.3089854   -.0752614
         33  |  -.1680874   .0646402    -2.60   0.011    -.2970082   -.0391666
         34  |  -.2797972   .0933481    -3.00   0.004    -.4659742   -.0936202
             |
       _cons |   .1595367   .0577581     2.76   0.007     .0443417    .2747317
------------------------------------------------------------------------------

. reg ame  group1 group3  pbelief  stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nm
> odel] ,  cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0735
                                                Root MSE          =     .19915

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0559156   .0327906    -1.71   0.093    -.1213145    .0094832
      group3 |   .0272545   .0139834     1.95   0.055    -.0006346    .0551435
     pbelief |  -.0148681   .0163533    -0.91   0.366    -.0474836    .0177475
   stats_brw |   .0818189   .0369636     2.21   0.030     .0080974    .1555404
   topic_brw |  -.1314212   .0509675    -2.58   0.012    -.2330726   -.0297697
          t2 |   .0015762   .0137369     0.11   0.909    -.0258213    .0289737
          t3 |   .0134638   .0219481     0.61   0.542    -.0303102    .0572378
             |
     mdegree |
          2  |  -.2297889   .0706964    -3.25   0.002    -.3707883   -.0887894
          3  |  -.2117392   .0588981    -3.60   0.001    -.3292078   -.0942706
          4  |  -.2184541   .0642334    -3.40   0.001    -.3465636   -.0903445
          5  |  -.1513485   .0647281    -2.34   0.022    -.2804446   -.0222524
          6  |  -.2372372   .0658369    -3.60   0.001    -.3685448   -.1059297
         20  |  -.2049956    .061245    -3.35   0.001    -.3271449   -.0828463
         30  |  -.4964528   .0718067    -6.91   0.000    -.6396668   -.3532389
         31  |  -.2097255   .0727277    -2.88   0.005    -.3547763   -.0646747
         32  |  -.2145186   .0587674    -3.65   0.001    -.3317265   -.0973108
         33  |  -.1524408   .0639526    -2.38   0.020    -.2799901   -.0248914
         34  |   -.312655   .1002843    -3.12   0.003    -.5126657   -.1126444
             |
       _cons |    .196015   .0647077     3.03   0.003     .0669595    .3250704
------------------------------------------------------------------------------

. ********************************************************************;
. *GETTING EFFECTS ON ESTIMATE BY LOOKING AT EXTREME SIGNIFICANT COEFFICIENTS, USING 1
> 0TH AND 90TH PERCENTILES;
. generate negsig=(ame<0 & z>1.645);

. generate possig=(ame>0 & z>1.645);

. summ ame;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |      1,253    .0007771    .1865197  -1.353765       2.47

. generate pos10=(ame>.052);

. generate neg10=(ame<-.071);

. generate pos10s=(ame>.052 & z>1.645);

. generate neg10s=(ame<-.071 & z>1.645);

. summ pos10-neg10s;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       pos10 |      1,253    .1005587    .3008635          0          1
       neg10 |      1,253    .1005587    .3008635          0          1
      pos10s |      1,253    .0526736    .2234702          0          1
      neg10s |      1,253    .0630487    .2431475          0          1

. summ pos10-neg10s [aw=model_brw];

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
       pos10 |   1,253  560.242243    .1000907   .3002407          0          1
       neg10 |   1,253  560.242243    .1076047   .3100043          0          1
      pos10s |   1,253  560.242243    .0478909   .2136206          0          1
      neg10s |   1,253  560.242243    .0661285   .2486058          0          1

. *OLS REGRESSIONS ON EXTREME OUTCOMES;
. reg neg10 proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(
> teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0814
                                                Root MSE          =     .33306

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
       neg10 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0499845   .0216344    -2.31   0.024    -.0931329    -.006836
   stats_brw |  -.1322726   .0872984    -1.52   0.134    -.3063837    .0418385
   topic_brw |   .2418066   .0997363     2.42   0.018     .0428889    .4407244
          t2 |  -.0427532     .05935    -0.72   0.474     -.161123    .0756165
          t3 |   .0070125   .0744793     0.09   0.925    -.1415317    .1555568
             |
     mdegree |
          2  |   .1499869   .1149902     1.30   0.196    -.0793538    .3793276
          3  |   .2780929    .164288     1.69   0.095    -.0495691     .605755
          4  |   .2950735   .1481988     1.99   0.050    -.0004998    .5906467
          5  |   .1438555   .1467891     0.98   0.330    -.1489061    .4366171
          6  |   .2460727   .1700921     1.45   0.152    -.0931652    .5853106
         20  |   .1908511   .1464089     1.30   0.197    -.1011522    .4828543
         30  |   .6325027   .1470125     4.30   0.000     .3392955    .9257099
         31  |   .2354025   .1613918     1.46   0.149    -.0864833    .5572884
         32  |   .2695419   .1446635     1.86   0.067    -.0189804    .5580641
         33  |   .0954145   .1473557     0.65   0.519    -.1984771    .3893061
         34  |   .3865756   .2268755     1.70   0.093    -.0659134    .8390646
             |
       _cons |   .0975889    .136845     0.71   0.478    -.1753398    .3705176
------------------------------------------------------------------------------

. reg neg10 dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(te
> amid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0916
                                                Root MSE          =     .33122

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
       neg10 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.1363508   .0525858    -2.59   0.012    -.2412298   -.0314718
   stats_brw |  -.1241551    .081951    -1.51   0.134    -.2876012    .0392909
   topic_brw |   .2355921   .0957507     2.46   0.016     .0446234    .4265608
          t2 |  -.0659788   .0594862    -1.11   0.271    -.1846204    .0526628
          t3 |   -.017435   .0699937    -0.25   0.804    -.1570331     .122163
             |
     mdegree |
          2  |   .0895798   .1048854     0.85   0.396    -.1196076    .2987671
          3  |   .2349336   .1541787     1.52   0.132     -.072566    .5424332
          4  |   .2423193   .1371141     1.77   0.082    -.0311463    .5157848
          5  |   .1048402   .1319519     0.79   0.430    -.1583295    .3680099
          6  |   .1791347   .1459138     1.23   0.224    -.1118813    .4701506
         20  |   .1323944   .1385376     0.96   0.343    -.1439102     .408699
         30  |   .5613421   .1292595     4.34   0.000     .3035422    .8191419
         31  |   .1863743   .1482854     1.26   0.213    -.1093716    .4821202
         32  |    .226634   .1344594     1.69   0.096    -.0415369    .4948049
         33  |   .0020186   .1408469     0.01   0.989    -.2788918     .282929
         34  |   .3282193   .1955492     1.68   0.098    -.0617913    .7182299
             |
       _cons |   .0305306   .1331636     0.23   0.819    -.2350559     .296117
------------------------------------------------------------------------------

. reg neg10 group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  clu
> ster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1060
                                                Root MSE          =      .3287

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
       neg10 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .1637142   .1189647     1.38   0.173    -.0735535    .4009819
      group3 |  -.0901627   .0472584    -1.91   0.061    -.1844166    .0040912
   stats_brw |  -.1110984   .0780868    -1.42   0.159    -.2668375    .0446408
   topic_brw |   .2484674   .1016906     2.44   0.017     .0456519    .4512829
          t2 |  -.0812428   .0606601    -1.34   0.185    -.2022255    .0397399
          t3 |  -.0216372   .0642289    -0.34   0.737    -.1497378    .1064634
             |
     mdegree |
          2  |   .2387264   .1677892     1.42   0.159    -.0959185    .5733713
          3  |   .3151366   .1731818     1.82   0.073    -.0302636    .6605368
          4  |   .3338779   .1578424     2.12   0.038     .0190712    .6486846
          5  |   .1897391   .1665243     1.14   0.258    -.1423831    .5218613
          6  |   .2835498   .1792196     1.58   0.118    -.0738925    .6409921
         20  |   .2337351   .1675735     1.39   0.167    -.1004797      .56795
         30  |   .6491579   .1528349     4.25   0.000     .3443382    .9539775
         31  |   .2663804    .181881     1.46   0.148    -.0963699    .6291306
         32  |   .2992247   .1398669     2.14   0.036     .0202689    .5781805
         33  |  -.0335981   .1410837    -0.24   0.812    -.3149807    .2477845
         34  |   .4352957   .2298803     1.89   0.062    -.0231861    .8937776
             |
       _cons |  -.0975657    .176202    -0.55   0.582    -.4489896    .2538582
------------------------------------------------------------------------------

. reg neg10s proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster
> (teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0967
                                                Root MSE          =     .29047

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0517621   .0198857    -2.60   0.011    -.0914229   -.0121012
   stats_brw |  -.1597304   .0783575    -2.04   0.045    -.3160096   -.0034513
   topic_brw |   .2207763   .0838159     2.63   0.010     .0536108    .3879418
          t2 |  -.0396395   .0591037    -0.67   0.505    -.1575182    .0782392
          t3 |   .0175014   .0726729     0.24   0.810    -.1274401    .1624428
             |
     mdegree |
          2  |   .1829803   .1050482     1.74   0.086    -.0265318    .3924924
          3  |   .2933683   .1619121     1.81   0.074    -.0295551    .6162917
          4  |   .3211398   .1429142     2.25   0.028     .0361063    .6061732
          5  |   .1680948   .1390258     1.21   0.231    -.1091834    .4453731
          6  |   .3088563   .1710627     1.81   0.075    -.0323176    .6500301
         20  |   .1656405   .1388085     1.19   0.237    -.1112043    .4424854
         30  |   .2702653   .1379132     1.96   0.054     -.004794    .5453246
         31  |   .2632351   .1470729     1.79   0.078    -.0300926    .5565627
         32  |   .1920632   .1277704     1.50   0.137    -.0627668    .4468931
         33  |   .1409581   .1386757     1.02   0.313    -.1356218     .417538
         34  |   .4294133   .2177433     1.97   0.053    -.0048621    .8636886
             |
       _cons |   .0564894   .1288923     0.44   0.663    -.2005781     .313557
------------------------------------------------------------------------------

. reg neg10s dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(t
> eamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1214
                                                Root MSE          =     .28648

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.1582345   .0495748    -3.19   0.002    -.2571083   -.0593608
   stats_brw |  -.1474813    .071772    -2.05   0.044    -.2906261   -.0043365
   topic_brw |   .2097452   .0704858     2.98   0.004     .0691658    .3503247
          t2 |  -.0659991   .0588394    -1.12   0.266    -.1833505    .0513523
          t3 |  -.0109128   .0656066    -0.17   0.868    -.1417611    .1199354
             |
     mdegree |
          2  |   .1153317   .0904044     1.28   0.206    -.0649742    .2956376
          3  |   .2563137   .1501448     1.71   0.092    -.0431408    .5557681
          4  |   .2729866   .1283484     2.13   0.037     .0170038    .5289694
          5  |   .1262946   .1198792     1.05   0.296    -.1127969    .3653862
          6  |    .242459    .139389     1.74   0.086    -.0355437    .5204616
         20  |   .1105489   .1293738     0.85   0.396     -.147479    .3685767
         30  |   .2105591   .1167255     1.80   0.076    -.0222425    .4433607
         31  |   .2174082   .1317999     1.65   0.104    -.0454585    .4802749
         32  |   .1532769   .1139202     1.35   0.183    -.0739298    .3804836
         33  |   .0401352   .1300501     0.31   0.759    -.2192415     .299512
         34  |    .373354   .1780957     2.10   0.040     .0181534    .7285546
             |
       _cons |   -.006406   .1277444    -0.05   0.960    -.2611841    .2483721
------------------------------------------------------------------------------

. reg neg10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cl
> uster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1338
                                                Root MSE          =     .28456

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .1334609    .115071     1.16   0.250    -.0960409    .3629627
      group3 |  -.1205817   .0443021    -2.72   0.008    -.2089396   -.0322239
   stats_brw |  -.1368373   .0669396    -2.04   0.045    -.2703441   -.0033306
   topic_brw |   .2202412   .0777891     2.83   0.006     .0650959    .3753866
          t2 |  -.0784424   .0599479    -1.31   0.195    -.1980047      .04112
          t3 |  -.0143384   .0608156    -0.24   0.814    -.1356313    .1069544
             |
     mdegree |
          2  |    .236917   .1621269     1.46   0.148    -.0864348    .5602689
          3  |   .3216957   .1726524     1.86   0.067    -.0226487      .66604
          4  |   .3476258   .1534916     2.26   0.027     .0414966    .6537551
          5  |   .1955048   .1570299     1.25   0.217    -.1176815    .5086911
          6  |   .3275788   .1784957     1.84   0.071    -.0284195    .6835772
         20  |   .1931626   .1612436     1.20   0.235    -.1284277    .5147528
         30  |   .2821471    .142575     1.98   0.052    -.0022098     .566504
         31  |   .2826297   .1654374     1.71   0.092    -.0473248    .6125842
         32  |   .2124533   .1259108     1.69   0.096    -.0386679    .4635745
         33  |   .0111002   .1293168     0.09   0.932     -.246814    .2690144
         34  |   .4606434   .2126703     2.17   0.034     .0364859    .8848009
             |
       _cons |  -.1108309   .1749665    -0.63   0.529    -.4597907    .2381288
------------------------------------------------------------------------------

. *REGRESSIONS ON OUTLYING POSITIVE & SIGNIFICANT COEFFICIENTS;
. reg pos10 proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(
> teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0831
                                                Root MSE          =     .30677

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
       pos10 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0249834   .0132176     1.89   0.063    -.0013783    .0513451
   stats_brw |    .150306   .0598811     2.51   0.014      .030877     .269735
   topic_brw |  -.1623025   .0722587    -2.25   0.028    -.3064178   -.0181871
          t2 |  -.0808314   .0414532    -1.95   0.055    -.1635071    .0018444
          t3 |   -.051665   .0432397    -1.19   0.236    -.1379039    .0345739
             |
     mdegree |
          2  |  -.5558436   .0782033    -7.11   0.000    -.7118151   -.3998721
          3  |  -.5244508   .0814276    -6.44   0.000    -.6868531   -.3620485
          4  |  -.5219762   .0893897    -5.84   0.000    -.7002584   -.3436941
          5  |   -.274997   .1225508    -2.24   0.028    -.5194169   -.0305771
          6  |  -.6119497   .0964127    -6.35   0.000    -.8042387   -.4196607
         20  |  -.4346786   .1198125    -3.63   0.001    -.6736371   -.1957202
         30  |  -.5660004    .093631    -6.05   0.000    -.7527417   -.3792592
         31  |  -.4876108   .1087347    -4.48   0.000    -.7044753   -.2707463
         32  |  -.4383361   .0858695    -5.10   0.000    -.6095974   -.2670747
         33  |  -.6004284   .0959569    -6.26   0.000    -.7918085   -.4090483
         34  |   -.408944   .1712165    -2.39   0.020    -.7504246   -.0674634
             |
       _cons |    .533665   .0935357     5.71   0.000     .3471139     .720216
------------------------------------------------------------------------------

. reg pos10 dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(te
> amid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0814
                                                Root MSE          =     .30705

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
       pos10 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0469635   .0291696     1.61   0.112    -.0112135    .1051404
   stats_brw |   .1510287   .0596086     2.53   0.014     .0321431    .2699144
   topic_brw |  -.1649123   .0713608    -2.31   0.024    -.3072369   -.0225878
          t2 |  -.0720933   .0413773    -1.74   0.086    -.1546178    .0104312
          t3 |  -.0432978   .0422596    -1.02   0.309    -.1275819    .0409863
             |
     mdegree |
          2  |  -.5319856   .0778905    -6.83   0.000    -.6873333   -.3766379
          3  |  -.4933765   .0789712    -6.25   0.000    -.6508797   -.3358734
          4  |  -.4875521   .0874504    -5.58   0.000    -.6619664   -.3131377
          5  |  -.2572343   .1315728    -1.96   0.055    -.5196479    .0051793
          6  |   -.574859   .0984164    -5.84   0.000    -.7711443   -.3785736
         20  |  -.3986893   .1186455    -3.36   0.001    -.6353203   -.1620582
         30  |  -.5130376   .0861584    -5.95   0.000    -.6848752   -.3412001
         31  |  -.4569547    .108833    -4.20   0.000    -.6740154   -.2398941
         32  |  -.4098651   .0853436    -4.80   0.000    -.5800776   -.2396526
         33  |  -.5588534   .0937724    -5.96   0.000    -.7458765   -.3718302
         34  |  -.3743377    .161343    -2.32   0.023    -.6961261   -.0525493
             |
       _cons |   .5753266   .0891854     6.45   0.000     .3974519    .7532012
------------------------------------------------------------------------------

. reg pos10 group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  clu
> ster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0851
                                                Root MSE          =     .30657

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
       pos10 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   -.075473    .044751    -1.69   0.096     -.164726      .01378
      group3 |   .0256705   .0329593     0.78   0.439    -.0400648    .0914059
   stats_brw |   .1450095   .0572001     2.54   0.013     .0309275    .2590914
   topic_brw |  -.1708479   .0694226    -2.46   0.016     -.309307   -.0323888
          t2 |  -.0650565   .0386675    -1.68   0.097    -.1421764    .0120633
          t3 |  -.0413606   .0423178    -0.98   0.332    -.1257607    .0430395
             |
     mdegree |
          2  |  -.6007429   .0883891    -6.80   0.000    -.7770294   -.4244564
          3  |  -.5303505   .0832308    -6.37   0.000    -.6963491   -.3643518
          4  |   -.529761   .0907909    -5.83   0.000    -.7108378   -.3486843
          5  |  -.2963731   .1231804    -2.41   0.019    -.5420487   -.0506974
          6  |  -.6229948   .1008714    -6.18   0.000    -.8241764   -.4218132
         20  |  -.4454078   .1177663    -3.78   0.000    -.6802853   -.2105304
         30  |  -.5535211   .0877752    -6.31   0.000    -.7285833   -.3784589
         31  |  -.4938379   .1084827    -4.55   0.000    -.7101998    -.277476
         32  |  -.4433298   .0863625    -5.13   0.000    -.6155744   -.2710852
         33  |  -.5424339   .0891401    -6.09   0.000    -.7202181   -.3646497
         34  |  -.4237004   .1707426    -2.48   0.015    -.7642359    -.083165
             |
       _cons |   .6343795   .0982534     6.46   0.000     .4384193    .8303397
------------------------------------------------------------------------------

. reg pos10s proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster
> (teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0860
                                                Root MSE          =     .24493

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0199564   .0115769     1.72   0.089     -.003133    .0430458
   stats_brw |   .0552387   .0403667     1.37   0.176    -.0252701    .1357475
   topic_brw |  -.0707617   .0435445    -1.63   0.109    -.1576085    .0160852
          t2 |  -.0273513   .0370496    -0.74   0.463    -.1012444    .0465417
          t3 |  -.0058204   .0289412    -0.20   0.841    -.0635417     .051901
             |
     mdegree |
          2  |  -.4269501   .0542548    -7.87   0.000    -.5351579   -.3187423
          3  |  -.4336662   .0674306    -6.43   0.000    -.5681522   -.2991801
          4  |  -.3821968   .0664299    -5.75   0.000    -.5146871   -.2497065
          5  |  -.1965194   .1101324    -1.78   0.079    -.4161716    .0231328
          6  |  -.4535337   .0725535    -6.25   0.000     -.598237   -.3088304
         20  |  -.3499143   .0918679    -3.81   0.000    -.5331391   -.1666894
         30  |  -.4889398   .0760743    -6.43   0.000    -.6406651   -.3372144
         31  |  -.3762322   .0871803    -4.32   0.000    -.5501078   -.2023565
         32  |  -.4345484   .0604396    -7.19   0.000    -.5550913   -.3140055
         33  |  -.4571713   .0693988    -6.59   0.000    -.5955829   -.3187596
         34  |  -.2630743   .1613112    -1.63   0.107    -.5847993    .0586507
             |
       _cons |   .3807315   .0627254     6.07   0.000     .2556296    .5058334
------------------------------------------------------------------------------

. reg pos10s dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(t
> eamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0804
                                                Root MSE          =     .24567

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0094551   .0279482     0.34   0.736    -.0462858     .065196
   stats_brw |   .0621459   .0434512     1.43   0.157    -.0245148    .1488067
   topic_brw |  -.0804159   .0464074    -1.73   0.088    -.1729726    .0121408
          t2 |   -.024173   .0358313    -0.67   0.502    -.0956364    .0472904
          t3 |  -.0042383   .0288735    -0.15   0.884    -.0618246    .0533481
             |
     mdegree |
          2  |  -.4162819   .0561132    -7.42   0.000     -.528196   -.3043677
          3  |  -.3962609   .0611824    -6.48   0.000    -.5182854   -.2742364
          4  |  -.3440304   .0616331    -5.58   0.000    -.4669537   -.2211071
          5  |  -.1846324   .1185715    -1.56   0.124    -.4211159    .0518511
          6  |  -.4190944   .0668862    -6.27   0.000    -.5524947   -.2856941
         20  |  -.3121994   .0853852    -3.66   0.000    -.4824949    -.141904
         30  |  -.4235981   .0625774    -6.77   0.000    -.5484048   -.2987914
         31  |  -.3435995   .0899359    -3.82   0.000     -.522971   -.1642279
         32  |  -.4025038   .0557775    -7.22   0.000    -.5137484   -.2912591
         33  |  -.4307241   .0680653    -6.33   0.000     -.566476   -.2949722
         34  |  -.2282294     .16074    -1.42   0.160    -.5488151    .0923564
             |
       _cons |   .4247953    .067175     6.32   0.000      .290819    .5587717
------------------------------------------------------------------------------

. reg pos10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cl
> uster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0868
                                                Root MSE          =     .24492

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0799933   .0385985    -2.07   0.042    -.1569755    -.003011
      group3 |  -.0131131   .0331021    -0.40   0.693    -.0791332     .052907
   stats_brw |   .0557662   .0403839     1.38   0.172     -.024777    .1363095
   topic_brw |   -.086707   .0451761    -1.92   0.059    -.1768079    .0033939
          t2 |  -.0167148   .0338005    -0.49   0.622    -.0841279    .0506983
          t3 |   -.002185   .0279772    -0.08   0.938    -.0579838    .0536138
             |
     mdegree |
          2  |  -.4891572   .0684671    -7.14   0.000    -.6257106   -.3526038
          3  |  -.4354493   .0622817    -6.99   0.000    -.5596663   -.3112324
          4  |  -.3887674   .0635411    -6.12   0.000    -.5154961   -.2620387
          5  |  -.2261153   .1056497    -2.14   0.036    -.4368271   -.0154036
          6  |  -.4701132   .0692873    -6.78   0.000    -.6083023   -.3319241
         20  |  -.3617161    .084687    -4.27   0.000     -.530619   -.1928131
         30  |  -.4665062    .062499    -7.46   0.000    -.5911566   -.3418558
         31  |  -.3826916   .0891694    -4.29   0.000    -.5605344   -.2048489
         32  |  -.4379727   .0607176    -7.21   0.000      -.55907   -.3168753
         33  |  -.4133212   .0628879    -6.57   0.000    -.5387472   -.2878952
         34  |  -.2805485   .1705752    -1.64   0.105      -.62075    .0596529
             |
       _cons |   .4873851   .0750979     6.49   0.000     .3376071    .6371631
------------------------------------------------------------------------------

. *WEIGHTED REGRESSIONS ON OUTLYING NEGATIVE & SIGNIFICANT COEFFICIENTS;
. reg neg10 proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,  clu
> ster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0858
                                                Root MSE          =      .3397

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
       neg10 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0535407   .0223679    -2.39   0.019     -.098152   -.0089294
   stats_brw |  -.1325663   .0912985    -1.45   0.151    -.3146554    .0495228
   topic_brw |   .2436669   .0999221     2.44   0.017     .0443786    .4429552
          t2 |  -.0506173    .059115    -0.86   0.395    -.1685185    .0672838
          t3 |   .0187031    .081144     0.23   0.818    -.1431335    .1805397
             |
     mdegree |
          2  |   .1540773   .1211769     1.27   0.208    -.0876024    .3957571
          3  |   .2776335   .1736788     1.60   0.114     -.068758     .624025
          4  |   .3053848   .1556279     1.96   0.054    -.0050053    .6157749
          5  |   .1378404   .1517786     0.91   0.367    -.1648723    .4405532
          6  |   .2590052   .1815639     1.43   0.158    -.1031127    .6211231
         20  |   .1919603   .1542357     1.24   0.217    -.1156532    .4995737
         30  |   .6271695   .1525873     4.11   0.000     .3228436    .9314953
         31  |   .2293214   .1669239     1.37   0.174    -.1035978    .5622406
         32  |   .2559756   .1451646     1.76   0.082     -.033546    .5454973
         33  |   .0817412   .1515403     0.54   0.591    -.2204964    .3839788
         34  |   .3940366   .2276441     1.73   0.088    -.0599852    .8480583
             |
       _cons |   .1125567   .1382701     0.81   0.418    -.1632144    .3883277
------------------------------------------------------------------------------

. reg neg10 dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,  clust
> er(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0969
                                                Root MSE          =     .33762

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
       neg10 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.1429693   .0543019    -2.63   0.010     -.251271   -.0346675
   stats_brw |  -.1258623   .0854157    -1.47   0.145    -.2962187     .044494
   topic_brw |   .2360161   .0959312     2.46   0.016     .0446874    .4273449
          t2 |  -.0754192   .0579213    -1.30   0.197    -.1909396    .0401012
          t3 |  -.0073043     .07556    -0.10   0.923    -.1580038    .1433953
             |
     mdegree |
          2  |    .091687   .1089011     0.84   0.403    -.1255095    .3088834
          3  |   .2311667   .1606662     1.44   0.155     -.089272    .5516053
          4  |   .2469809   .1412219     1.75   0.085    -.0346773    .5286392
          5  |   .0986284   .1352842     0.73   0.468    -.1711874    .3684443
          6  |   .1850702   .1538544     1.20   0.233    -.1217827    .4919232
         20  |   .1278746   .1437097     0.89   0.377    -.1587453    .4144945
         30  |    .550413   .1313233     4.19   0.000     .2884969    .8123292
         31  |   .1773101   .1504837     1.18   0.243    -.1228202    .4774403
         32  |   .2123199   .1329193     1.60   0.115    -.0527793    .4774192
         33  |  -.0149282   .1412049    -0.11   0.916    -.2965525    .2666961
         34  |   .3289403    .193311     1.70   0.093    -.0566064     .714487
             |
       _cons |   .0377497   .1367462     0.28   0.783    -.2349821    .3104814
------------------------------------------------------------------------------

. reg neg10 group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,
>   cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1139
                                                Root MSE          =     .33457

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
       neg10 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .1779493   .1277606     1.39   0.168    -.0768611    .4327598
      group3 |  -.0946234   .0475386    -1.99   0.050    -.1894362    .0001894
   stats_brw |  -.1069306   .0786547    -1.36   0.178    -.2638024    .0499412
   topic_brw |   .2477572   .1019731     2.43   0.018     .0443783    .4511361
          t2 |  -.0934873   .0584109    -1.60   0.114    -.2099841    .0230095
          t3 |  -.0144542   .0675777    -0.21   0.831    -.1492337    .1203252
             |
     mdegree |
          2  |   .2478485   .1777656     1.39   0.168    -.1066939    .6023909
          3  |   .3131721   .1805043     1.73   0.087    -.0468324    .6731765
          4  |   .3429059   .1642211     2.09   0.040     .0153773    .6704345
          5  |   .1849027   .1713421     1.08   0.284    -.1568283    .5266337
          6  |   .2936716   .1898025     1.55   0.126    -.0848775    .6722208
         20  |     .23389   .1751193     1.34   0.186    -.1153745    .5831544
         30  |   .6434222   .1580859     4.07   0.000     .3281298    .9587145
         31  |   .2598972   .1893855     1.37   0.174    -.1178202    .6376146
         32  |   .2904263   .1417649     2.05   0.044     .0076851    .5731675
         33  |  -.0595227   .1394353    -0.43   0.671    -.3376176    .2185722
         34  |   .4427586    .232432     1.90   0.061    -.0208124    .9063297
             |
       _cons |  -.0940658   .1835121    -0.51   0.610    -.4600691    .2719375
------------------------------------------------------------------------------

. reg neg10s proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,  cl
> uster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1031
                                                Root MSE          =     .29899

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0556901   .0209406    -2.66   0.010    -.0974549   -.0139254
   stats_brw |  -.1579376   .0835094    -1.89   0.063    -.3244917    .0086166
   topic_brw |   .2236605    .086414     2.59   0.012     .0513133    .3960077
          t2 |  -.0455876   .0595648    -0.77   0.447    -.1643857    .0732106
          t3 |   .0292147    .080164     0.36   0.717    -.1306674    .1890967
             |
     mdegree |
          2  |   .1850152   .1125548     1.64   0.105    -.0394682    .4094987
          3  |   .2922501   .1722809     1.70   0.094    -.0513533    .6358535
          4  |   .3343783   .1514762     2.21   0.031     .0322685    .6364881
          5  |   .1605812   .1449483     1.11   0.272     -.128509    .4496714
          6  |   .3212299   .1825594     1.76   0.083    -.0428733    .6853331
         20  |   .1662086   .1481606     1.12   0.266    -.1292883    .4617056
         30  |   .2655357    .144751     1.83   0.071    -.0231612    .5542325
         31  |   .2564722   .1536675     1.67   0.100    -.0500079    .5629522
         32  |    .176465   .1301211     1.36   0.179    -.0830532    .4359833
         33  |   .1261612   .1440873     0.88   0.384    -.1612118    .4135343
         34  |   .4357849    .219368     1.99   0.051    -.0017308    .8733007
             |
       _cons |   .0733215   .1315436     0.56   0.579    -.1890338    .3356769
------------------------------------------------------------------------------

. reg neg10s dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,  clus
> ter(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1286
                                                Root MSE          =     .29472

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   -.164764   .0514121    -3.20   0.002    -.2673022   -.0622258
   stats_brw |  -.1473482    .075966    -1.94   0.056    -.2988577    .0041613
   topic_brw |   .2111295   .0724499     2.91   0.005     .0666327    .3556263
          t2 |  -.0731809   .0578818    -1.26   0.210    -.1886225    .0422606
          t3 |  -.0009123   .0717669    -0.01   0.990    -.1440469    .1422223
             |
     mdegree |
          2  |   .1153036   .0953903     1.21   0.231    -.0749463    .3055535
          3  |   .2511769   .1569761     1.60   0.114     -.061902    .5642559
          4  |   .2796889   .1333855     2.10   0.040     .0136599    .5457179
          5  |   .1186241   .1236874     0.96   0.341    -.1280627    .3653108
          6  |   .2467042   .1477786     1.67   0.100     -.048031    .5414394
         20  |   .1048176   .1354659     0.77   0.442    -.1653605    .3749957
         30  |   .1994695   .1193186     1.67   0.099     -.038504     .437443
         31  |   .2070724    .134711     1.54   0.129    -.0616002    .4757451
         32  |   .1372745    .113548     1.21   0.231    -.0891899    .3637388
         33  |    .022354   .1306908     0.17   0.865    -.2383005    .2830085
         34  |   .3721646   .1764784     2.11   0.039     .0201896    .7241396
             |
       _cons |    .001245   .1316602     0.01   0.992    -.2613431    .2638331
------------------------------------------------------------------------------

. reg neg10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] 
> ,  cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1435
                                                Root MSE          =     .29231

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .1481442    .125049     1.18   0.240    -.1012582    .3975467
      group3 |  -.1245157   .0444364    -2.80   0.007    -.2131413     -.03589
   stats_brw |  -.1315874   .0676911    -1.94   0.056    -.2665931    .0034183
   topic_brw |    .220904   .0799707     2.76   0.007     .0614074    .3804006
          t2 |  -.0882228   .0584734    -1.51   0.136    -.2048443    .0283987
          t3 |  -.0068647   .0649161    -0.11   0.916    -.1363358    .1226063
             |
     mdegree |
          2  |   .2453093   .1736697     1.41   0.162     -.101064    .5916827
          3  |   .3194471   .1811734     1.76   0.082    -.0418919    .6807862
          4  |   .3595472   .1612245     2.23   0.029      .037995    .6810994
          5  |   .1904481    .162887     1.17   0.246    -.1344199     .515316
          6  |   .3371157   .1902037     1.77   0.081    -.0422336     .716465
         20  |   .1930762   .1704953     1.13   0.261    -.1469658    .5331183
         30  |   .2769004   .1492355     1.86   0.068    -.0207404    .5745412
         31  |   .2758269   .1736274     1.59   0.117     -.070462    .6221159
         32  |   .2022987   .1295591     1.56   0.123    -.0560988    .4606961
         33  |  -.0147713   .1275008    -0.12   0.908    -.2690636    .2395211
         34  |   .4669192    .216681     2.15   0.035     .0347626    .8990759
             |
       _cons |  -.1084925    .183424    -0.59   0.556    -.4743202    .2573353
------------------------------------------------------------------------------

. *WEIGHTED REGRESSIONS ON OUTLYING POSITIVE & SIGNIFICANT COEFFICIENTS;
. reg pos10 proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,  clu
> ster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0854
                                                Root MSE          =     .30165

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
       pos10 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0238447   .0125359     1.90   0.061    -.0011573    .0488467
   stats_brw |   .1495569   .0581996     2.57   0.012     .0334816    .2656323
   topic_brw |  -.1660907   .0702235    -2.37   0.021     -.306147   -.0260345
          t2 |  -.0849213   .0394421    -2.15   0.035    -.1635861   -.0062565
          t3 |  -.0440426   .0398446    -1.11   0.273    -.1235102     .035425
             |
     mdegree |
          2  |   -.554162   .0762133    -7.27   0.000    -.7061648   -.4021593
          3  |  -.5252807   .0812676    -6.46   0.000    -.6873639   -.3631976
          4  |  -.5269874   .0871867    -6.04   0.000    -.7008758    -.353099
          5  |  -.2734409   .1214472    -2.25   0.027    -.5156597    -.031222
          6  |  -.6028703   .0954545    -6.32   0.000    -.7932483   -.4124923
         20  |  -.4297219   .1198071    -3.59   0.001    -.6686697   -.1907741
         30  |  -.5714879   .0930758    -6.14   0.000    -.7571217   -.3858541
         31  |  -.5064561   .1050794    -4.82   0.000    -.7160304   -.2968818
         32  |  -.4457275   .0853599    -5.22   0.000    -.6159725   -.2754824
         33  |  -.6079858   .0955328    -6.36   0.000    -.7985201   -.4174516
         34  |  -.4314973   .1701484    -2.54   0.013    -.7708475   -.0921471
             |
       _cons |   .5382278   .0891068     6.04   0.000     .3605099    .7159456
------------------------------------------------------------------------------

. reg pos10 dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,  clust
> er(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0841
                                                Root MSE          =     .30187

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
       pos10 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0451512    .028379     1.59   0.116     -.011449    .1017514
   stats_brw |    .150743   .0582899     2.59   0.012     .0344874    .2669986
   topic_brw |  -.1679589   .0692951    -2.42   0.018    -.3061636   -.0297543
          t2 |  -.0759473   .0391627    -1.94   0.056    -.1540549    .0021603
          t3 |   -.036008   .0387045    -0.93   0.355    -.1132017    .0411856
             |
     mdegree |
          2  |  -.5319324   .0760956    -6.99   0.000    -.6837002   -.3801646
          3  |  -.4962123   .0785808    -6.31   0.000    -.6529368   -.3394878
          4  |   -.493987   .0850391    -5.81   0.000    -.6635921   -.3243819
          5  |  -.2573284    .130631    -1.97   0.053    -.5178637    .0032069
          6  |  -.5672003   .0971013    -5.84   0.000    -.7608627   -.3735379
         20  |  -.3951046   .1183611    -3.34   0.001    -.6311683   -.1590408
         30  |  -.5214169   .0862817    -6.04   0.000    -.6935004   -.3493334
         31  |  -.4778711   .1044538    -4.57   0.000    -.6861976   -.2695445
         32  |  -.4191124   .0855728    -4.90   0.000     -.589782   -.2484428
         33  |  -.5686907   .0937372    -6.07   0.000    -.7556437   -.3817377
         34  |   -.397789   .1607837    -2.47   0.016    -.7184619   -.0771161
             |
       _cons |   .5781578   .0868007     6.66   0.000     .4050392    .7512764
------------------------------------------------------------------------------

. reg pos10 group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,
>   cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0873
                                                Root MSE          =     .30145

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
       pos10 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0690469    .043888    -1.57   0.120    -.1565788     .018485
      group3 |   .0263923   .0324929     0.81   0.419    -.0384128    .0911973
   stats_brw |   .1433972   .0560112     2.56   0.013     .0316864    .2551081
   topic_brw |  -.1725146   .0672128    -2.57   0.012    -.3065664   -.0384629
          t2 |  -.0689366   .0363685    -1.90   0.062    -.1414712     .003598
          t3 |  -.0332337   .0389362    -0.85   0.396    -.1108894     .044422
             |
     mdegree |
          2  |  -.5925254   .0845918    -7.00   0.000    -.7612383   -.4238124
          3  |  -.5280316    .081625    -6.47   0.000    -.6908275   -.3652357
          4  |  -.5312073   .0868477    -6.12   0.000    -.7044195   -.3579951
          5  |  -.2908041   .1220572    -2.38   0.020    -.5342396   -.0473686
          6  |  -.6093392   .0986764    -6.18   0.000     -.806143   -.4125354
         20  |    -.43624    .116132    -3.76   0.000     -.667858   -.2046221
         30  |  -.5575058   .0869059    -6.42   0.000    -.7308343   -.3841774
         31  |  -.5099161   .1035157    -4.93   0.000    -.7163716   -.3034606
         32  |  -.4494188   .0861122    -5.22   0.000    -.6211642   -.2776734
         33  |  -.5513874    .089149    -6.19   0.000    -.7291895   -.3735853
         34  |  -.4419521   .1691891    -2.61   0.011    -.7793892    -.104515
             |
       _cons |   .6293041   .0942991     6.67   0.000     .4412305    .8173777
------------------------------------------------------------------------------

. reg pos10s proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,  cl
> uster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0847
                                                Root MSE          =     .24104

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0180816   .0113111     1.60   0.114    -.0044778    .0406409
   stats_brw |   .0605543   .0414949     1.46   0.149    -.0222047    .1433133
   topic_brw |  -.0773814   .0445806    -1.74   0.087    -.1662946    .0115318
          t2 |  -.0312409   .0362802    -0.86   0.392    -.1035995    .0411178
          t3 |  -.0045632   .0287152    -0.16   0.874    -.0618339    .0527076
             |
     mdegree |
          2  |  -.4321454   .0557558    -7.75   0.000    -.5433469   -.3209439
          3  |  -.4368052   .0686963    -6.36   0.000    -.5738156   -.2997949
          4  |  -.3912643   .0674298    -5.80   0.000    -.5257488   -.2567797
          5  |  -.2013415   .1111639    -1.81   0.074     -.423051     .020368
          6  |  -.4545593   .0739797    -6.14   0.000    -.6021071   -.3070115
         20  |  -.3501222   .0936823    -3.74   0.000    -.5369656   -.1632787
         30  |   -.491845   .0783148    -6.28   0.000    -.6480391    -.335651
         31  |  -.3958243    .084118    -4.71   0.000    -.5635923   -.2280563
         32  |  -.4412966   .0625522    -7.05   0.000    -.5660531   -.3165401
         33  |  -.4658904   .0725129    -6.42   0.000    -.6105128   -.3212681
         34  |  -.2863886   .1616513    -1.77   0.081    -.6087919    .0360147
             |
       _cons |   .3941803   .0640537     6.15   0.000     .2664292    .5219314
------------------------------------------------------------------------------

. reg pos10s dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,  clus
> ter(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0799
                                                Root MSE          =     .24166

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0068918   .0272932     0.25   0.801    -.0475426    .0613263
   stats_brw |   .0676133   .0443308     1.53   0.132    -.0208017    .1560282
   topic_brw |  -.0865874   .0473646    -1.83   0.072    -.1810531    .0078784
          t2 |  -.0274946   .0348532    -0.79   0.433    -.0970072    .0420179
          t3 |  -.0037091   .0285025    -0.13   0.897    -.0605555    .0531373
             |
     mdegree |
          2  |  -.4234926   .0573002    -7.39   0.000    -.5377741    -.309211
          3  |  -.4023982   .0624226    -6.45   0.000    -.5268961   -.2779003
          4  |  -.3559195   .0618412    -5.76   0.000    -.4792578   -.2325811
          5  |  -.1911179   .1189053    -1.61   0.112    -.4282671    .0460312
          6  |  -.4234611   .0680695    -6.22   0.000    -.5592215   -.2877007
         20  |  -.3148999   .0868745    -3.62   0.001    -.4881657   -.1416341
         30  |  -.4304189   .0651798    -6.60   0.000    -.5604158   -.3004219
         31  |  -.3661434    .085308    -4.29   0.000    -.5362849   -.1960019
         32  |  -.4105237   .0581363    -7.06   0.000     -.526473   -.2945744
         33  |  -.4416403   .0710358    -6.22   0.000    -.5833167   -.2999639
         34  |  -.2538624   .1614223    -1.57   0.120    -.5758089    .0680842
             |
       _cons |   .4342254   .0682125     6.37   0.000     .2981798     .570271
------------------------------------------------------------------------------

. reg pos10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] 
> ,  cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0862
                                                Root MSE          =     .24093

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0769769   .0375159    -2.05   0.044       -.1518   -.0021538
      group3 |  -.0140215   .0323952    -0.43   0.666    -.0786317    .0505887
   stats_brw |   .0594238   .0411831     1.44   0.154    -.0227132    .1415609
   topic_brw |  -.0916663   .0457094    -2.01   0.049    -.1828309   -.0005017
          t2 |  -.0196788   .0325637    -0.60   0.548    -.0846249    .0452674
          t3 |  -.0006162   .0276741    -0.02   0.982    -.0558104     .054578
             |
     mdegree |
          2  |  -.4910446   .0672871    -7.30   0.000    -.6252444   -.3568447
          3  |  -.4378719   .0627975    -6.97   0.000    -.5631175   -.3126263
          4  |  -.3974145   .0626375    -6.34   0.000    -.5223411   -.2724879
          5  |  -.2284382   .1062112    -2.15   0.035    -.4402698   -.0166066
          6  |  -.4704396   .0696061    -6.76   0.000    -.6092647   -.3316146
         20  |  -.3607598   .0851423    -4.24   0.000    -.5305707   -.1909489
         30  |  -.4706526   .0644426    -7.30   0.000    -.5991794   -.3421257
         31  |  -.4018688   .0844396    -4.76   0.000    -.5702783   -.2334592
         32  |  -.4443108   .0617624    -7.19   0.000    -.5674921   -.3211295
         33  |  -.4223497   .0658291    -6.42   0.000    -.5536417   -.2910577
         34  |  -.3030976   .1708758    -1.77   0.080    -.6438987    .0377034
             |
       _cons |   .4912458   .0745152     6.59   0.000       .34263    .6398616
------------------------------------------------------------------------------

.         *LOGIT REGRESSIONS ON OUTLYING NEGATIVE & SIGNIFICANT COEFFICIENTS;
. quietly logit neg10 proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,
>   cluster(teamid);

. margins, dydx(proindex-topic_brw);

Average marginal effects                                 Number of obs = 1,205
Model VCE: Robust

Expression: Pr(neg10), predict()
dy/dx wrt:  proindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   -.052475   .0186094    -2.82   0.005    -.0889488   -.0160011
   stats_brw |  -.1472745   .0881232    -1.67   0.095    -.3199928    .0254437
   topic_brw |   .2423271    .083151     2.91   0.004     .0793542       .4053
------------------------------------------------------------------------------

. quietly logit neg10 dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  
> cluster(teamid);

. margins, dydx(dindex-topic_brw);

Average marginal effects                                 Number of obs = 1,205
Model VCE: Robust

Expression: Pr(neg10), predict()
dy/dx wrt:  dindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.1188672   .0402784    -2.95   0.003    -.1978114   -.0399229
   stats_brw |  -.1494026   .0883916    -1.69   0.091    -.3226469    .0238417
   topic_brw |    .244585   .0913154     2.68   0.007       .06561    .4235599
------------------------------------------------------------------------------

. quietly logit neg10 group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmod
> el] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,205
Model VCE: Robust

Expression: Pr(neg10), predict()
dy/dx wrt:  group1 group3 stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .1105919   .0672519     1.64   0.100    -.0212195    .2424033
      group3 |  -.0818854   .0408809    -2.00   0.045    -.1620106   -.0017602
   stats_brw |  -.1290768   .0806789    -1.60   0.110    -.2872046     .029051
   topic_brw |   .2446817   .0828575     2.95   0.003     .0822839    .4070795
------------------------------------------------------------------------------

. quietly logit neg10s proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] 
> ,  cluster(teamid);

. margins, dydx(proindex-topic_brw);

Average marginal effects                                 Number of obs = 1,153
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  proindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0518671   .0179624    -2.89   0.004    -.0870727   -.0166615
   stats_brw |   -.200501    .085632    -2.34   0.019    -.3683368   -.0326653
   topic_brw |   .2588906    .070405     3.68   0.000     .1208993     .396882
------------------------------------------------------------------------------

. quietly logit neg10s dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] , 
>  cluster(teamid);

. margins, dydx(dindex-topic_brw);

Average marginal effects                                 Number of obs = 1,153
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  dindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.1335123   .0357252    -3.74   0.000    -.2035324   -.0634922
   stats_brw |  -.2083054    .072999    -2.85   0.004    -.3513809   -.0652299
   topic_brw |   .2678802   .0672883     3.98   0.000     .1359976    .3997628
------------------------------------------------------------------------------

. quietly logit neg10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmo
> del] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,153
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  group1 group3 stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .0595959     .05411     1.10   0.271    -.0464578    .1656495
      group3 |  -.1136283   .0363617    -3.12   0.002     -.184896   -.0423607
   stats_brw |  -.1825809   .0668234    -2.73   0.006    -.3135524   -.0516095
   topic_brw |    .252844   .0602806     4.19   0.000     .1346962    .3709917
------------------------------------------------------------------------------

. *LOGIT REGRESSIONS ON OUTLYING POSITIVE & SIGNIFICANT COEFFICIENTS;
. quietly logit pos10 proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,
>   cluster(teamid);

. margins, dydx(proindex-topic_brw);

Average marginal effects                                 Number of obs = 1,189
Model VCE: Robust

Expression: Pr(pos10), predict()
dy/dx wrt:  proindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0258023   .0169581     1.52   0.128     -.007435    .0590396
   stats_brw |   .1616049   .0674999     2.39   0.017     .0293075    .2939023
   topic_brw |  -.2103009   .1093617    -1.92   0.054    -.4246459    .0040442
------------------------------------------------------------------------------

. quietly logit pos10 dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  
> cluster(teamid);

. margins, dydx(dindex-topic_brw);

Average marginal effects                                 Number of obs = 1,189
Model VCE: Robust

Expression: Pr(pos10), predict()
dy/dx wrt:  dindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0530123   .0383686     1.38   0.167    -.0221887    .1282134
   stats_brw |   .1617651   .0614654     2.63   0.008     .0412952     .282235
   topic_brw |  -.2172971   .1039093    -2.09   0.037    -.4209556   -.0136385
------------------------------------------------------------------------------

. quietly logit pos10 group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmod
> el] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,189
Model VCE: Robust

Expression: Pr(pos10), predict()
dy/dx wrt:  group1 group3 stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.1348935   .0672285    -2.01   0.045    -.2666589   -.0031281
      group3 |   .0307503   .0373635     0.82   0.411    -.0424808    .1039814
   stats_brw |   .1560443   .0632545     2.47   0.014     .0320679    .2800208
   topic_brw |  -.2191064   .1014626    -2.16   0.031    -.4179694   -.0202433
------------------------------------------------------------------------------

. quietly logit pos10s proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] 
> ,  cluster(teamid);

. margins, dydx(proindex-topic_brw);

Average marginal effects                                 Number of obs = 1,169
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  proindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0211168   .0176337     1.20   0.231    -.0134445    .0556782
   stats_brw |    .063183   .0560737     1.13   0.260    -.0467194    .1730855
   topic_brw |  -.1455733   .1146663    -1.27   0.204    -.3703151    .0791686
------------------------------------------------------------------------------

. quietly logit pos10s dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] , 
>  cluster(teamid);

. margins, dydx(dindex-topic_brw);

Average marginal effects                                 Number of obs = 1,169
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  dindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0035648   .0352246     0.10   0.919    -.0654741    .0726037
   stats_brw |   .0827755   .0523956     1.58   0.114     -.019918     .185469
   topic_brw |  -.1792323   .1202429    -1.49   0.136    -.4149041    .0564394
------------------------------------------------------------------------------

. quietly logit pos10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmo
> del] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,169
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  group1 group3 stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.1464252   .0802591    -1.82   0.068    -.3037302    .0108798
      group3 |  -.0099271   .0341868    -0.29   0.772    -.0769319    .0570778
   stats_brw |   .0600461   .0516271     1.16   0.245    -.0411412    .1612334
   topic_brw |  -.1587347   .1166492    -1.36   0.174    -.3873628    .0698935
------------------------------------------------------------------------------

. *LOGIT WEIGHTED REGRESSIONS ON OUTLYING NEGATIVE & SIGNIFICANT COEFFICIENTS;
. quietly logit neg10 proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmod
> el] ,  cluster(teamid);

. margins, dydx(proindex-topic_brw);

Average marginal effects                                 Number of obs = 1,205
Model VCE: Robust

Expression: Pr(neg10), predict()
dy/dx wrt:  proindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   -.057506   .0200805    -2.86   0.004    -.0968631   -.0181489
   stats_brw |  -.1480157   .0912567    -1.62   0.105    -.3268756    .0308442
   topic_brw |   .2504441   .0860778     2.91   0.004     .0817347    .4191534
------------------------------------------------------------------------------

. quietly logit neg10 dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel
> ] ,  cluster(teamid);

. margins, dydx(dindex-topic_brw);

Average marginal effects                                 Number of obs = 1,205
Model VCE: Robust

Expression: Pr(neg10), predict()
dy/dx wrt:  dindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.1271711   .0428516    -2.97   0.003    -.2111588   -.0431834
   stats_brw |  -.1544731   .0922047    -1.68   0.094    -.3351911    .0262448
   topic_brw |   .2544106   .0960523     2.65   0.008     .0661516    .4426695
------------------------------------------------------------------------------

. quietly logit neg10 group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore
> /nmodel] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,205
Model VCE: Robust

Expression: Pr(neg10), predict()
dy/dx wrt:  group1 group3 stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .1179729   .0726423     1.62   0.104    -.0244035    .2603492
      group3 |  -.0887944   .0421176    -2.11   0.035    -.1713434   -.0062455
   stats_brw |  -.1252922   .0813074    -1.54   0.123    -.2846518    .0340675
   topic_brw |    .249676   .0849016     2.94   0.003     .0832718    .4160801
------------------------------------------------------------------------------

. quietly logit neg10s proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmo
> del] ,  cluster(teamid);

. margins, dydx(proindex-topic_brw);

Average marginal effects                                 Number of obs = 1,153
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  proindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0577437   .0203165    -2.84   0.004    -.0975632   -.0179242
   stats_brw |  -.1984302   .0879009    -2.26   0.024    -.3707129   -.0261476
   topic_brw |   .2673047   .0738377     3.62   0.000     .1225855     .412024
------------------------------------------------------------------------------

. quietly logit neg10s dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmode
> l] ,  cluster(teamid);

. margins, dydx(dindex-topic_brw);

Average marginal effects                                 Number of obs = 1,153
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  dindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.1456271   .0384309    -3.79   0.000    -.2209503   -.0703039
   stats_brw |   -.213637   .0745397    -2.87   0.004    -.3597321    -.067542
   topic_brw |    .280813   .0719542     3.90   0.000     .1397853    .4218407
------------------------------------------------------------------------------

. quietly logit neg10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscor
> e/nmodel] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,153
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  group1 group3 stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .0639374   .0594101     1.08   0.282    -.0525042    .1803791
      group3 |  -.1242422   .0376377    -3.30   0.001    -.1980107   -.0504738
   stats_brw |  -.1812314   .0640076    -2.83   0.005     -.306684   -.0557787
   topic_brw |    .261217   .0617845     4.23   0.000     .1401216    .3823124
------------------------------------------------------------------------------

. *LOGIT WEIGHTED REGRESSIONS ON OUTLYING POSITIVE & SIGNIFICANT COEFFICIENTS;
. quietly logit pos10 proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmod
> el] ,  cluster(teamid);

. margins, dydx(proindex-topic_brw);

Average marginal effects                                 Number of obs = 1,189
Model VCE: Robust

Expression: Pr(pos10), predict()
dy/dx wrt:  proindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0239892   .0158024     1.52   0.129    -.0069829    .0549614
   stats_brw |    .157153   .0647166     2.43   0.015     .0303108    .2839951
   topic_brw |  -.2141919   .1066536    -2.01   0.045     -.423229   -.0051548
------------------------------------------------------------------------------

. quietly logit pos10 dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel
> ] ,  cluster(teamid);

. margins, dydx(dindex-topic_brw);

Average marginal effects                                 Number of obs = 1,189
Model VCE: Robust

Expression: Pr(pos10), predict()
dy/dx wrt:  dindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0484545   .0361978     1.34   0.181     -.022492     .119401
   stats_brw |   .1575302   .0595838     2.64   0.008     .0407482    .2743123
   topic_brw |  -.2180376   .1003825    -2.17   0.030    -.4147836   -.0212915
------------------------------------------------------------------------------

. quietly logit pos10 group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore
> /nmodel] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,189
Model VCE: Robust

Expression: Pr(pos10), predict()
dy/dx wrt:  group1 group3 stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.1259421   .0668629    -1.88   0.060     -.256991    .0051068
      group3 |   .0292135   .0358302     0.82   0.415    -.0410123    .0994394
   stats_brw |   .1500828   .0615099     2.44   0.015     .0295255      .27064
   topic_brw |  -.2181925   .0979742    -2.23   0.026    -.4102183   -.0261667
------------------------------------------------------------------------------

. quietly logit pos10s proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmo
> del] ,  cluster(teamid);

. margins, dydx(proindex-topic_brw);

Average marginal effects                                 Number of obs = 1,169
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  proindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0171983   .0164813     1.04   0.297    -.0151045    .0495011
   stats_brw |   .0699652   .0562261     1.24   0.213    -.0402359    .1801663
   topic_brw |  -.1533599   .1089685    -1.41   0.159    -.3669341    .0602144
------------------------------------------------------------------------------

. quietly logit pos10s dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmode
> l] ,  cluster(teamid);

. margins, dydx(dindex-topic_brw);

Average marginal effects                                 Number of obs = 1,169
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  dindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.0002956   .0341752    -0.01   0.993    -.0672779    .0666866
   stats_brw |   .0872463    .051744     1.69   0.092    -.0141701    .1886628
   topic_brw |   -.183604   .1131158    -1.62   0.105    -.4053068    .0380988
------------------------------------------------------------------------------

. quietly logit pos10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscor
> e/nmodel] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,169
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  group1 group3 stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.1458495   .0784701    -1.86   0.063     -.299648    .0079491
      group3 |  -.0121623   .0334774    -0.36   0.716    -.0777768    .0534521
   stats_brw |   .0638417   .0514931     1.24   0.215     -.037083    .1647664
   topic_brw |  -.1617708   .1104511    -1.46   0.143    -.3782509    .0547094
------------------------------------------------------------------------------

. ********************************************************************;
. *RELATIONSHIP BETWEEN QUALITY OF RESEARCH AND PRO-IMMIGRATION INDEX
> 
> *NOTE HUGE RELATIONSHIP BETWEEN TEAM SIZE AND QUALITY, NO HIGH-QUALITY RESEARCH WHEN
>  ONLY SINGLE AUTHOR;
. tabulate team_size model_cat;

           |            model_cat
 team_size |         1          2          3 |     Total
-----------+---------------------------------+----------
         1 |       100        177          0 |       277 
         2 |       183        197         19 |       399 
         3 |       134        168        275 |       577 
-----------+---------------------------------+----------
     Total |       417        542        294 |     1,253 

. *PERHAPS USE XDEGREE TO CONTROL FOR DEGREE;
. generate xdegree=mdegree if mdegree==20;
(1,154 missing values generated)

. replace xdegree=mdegree if mdegree==30;
(20 real changes made)

. replace xdegree=mdegree if mdegree==40;
(0 real changes made)

. replace xdegree=mdegree if mdegree==50;
(0 real changes made)

. replace xdegree=0 if xdegree==.;
(1,134 real changes made)

. generate lowquality=(belief_hypothesis=="Low");

. *FACTOR SCORE AS DEPENDENT VARIABLE;
. reg model_brw proindex     stats_brw topic_brw t2 t3 i.mdegree  [aw=1/nmodel] ,  clu
> ster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3106
                                                Root MSE          =     .09727

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
   model_brw | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0091554   .0107778    -0.85   0.399     -.030651    .0123402
   stats_brw |  -.0351369   .0387633    -0.91   0.368    -.1124478    .0421741
   topic_brw |   .1321575   .0523483     2.52   0.014     .0277521    .2365629
          t2 |  -.0084444   .0331136    -0.26   0.799    -.0744875    .0575986
          t3 |   .0068807   .0343893     0.20   0.842    -.0617066    .0754681
             |
     mdegree |
          2  |    .111798    .050551     2.21   0.030     .0109773    .2126188
          3  |   .1760226   .0649621     2.71   0.008     .0464599    .3055853
          4  |   .1578464   .0641426     2.46   0.016     .0299181    .2857747
          5  |    .206782   .0641119     3.23   0.002     .0789148    .3346492
          6  |   .0679806   .0622015     1.09   0.278    -.0560764    .1920376
         20  |   .1774274    .062985     2.82   0.006     .0518078     .303047
         30  |    .185704   .0747071     2.49   0.015     .0367054    .3347026
         31  |   .1971576   .0908891     2.17   0.033     .0158851    .3784302
         32  |   .3217981   .0708786     4.54   0.000     .1804351     .463161
         33  |   .0653328   .0769206     0.85   0.399    -.0880804    .2187461
         34  |   .3444036    .082057     4.20   0.000      .180746    .5080612
             |
       _cons |   .2932191   .0707197     4.15   0.000     .1521731    .4342651
------------------------------------------------------------------------------

. reg model_brw dindex     stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  clus
> ter(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3146
                                                Root MSE          =     .09699

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
   model_brw | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.0263348    .024966    -1.05   0.295     -.076128    .0234584
   stats_brw |  -.0333432   .0389511    -0.86   0.395    -.1110286    .0443422
   topic_brw |   .1306523   .0534963     2.44   0.017     .0239572    .2373474
          t2 |  -.0128828   .0334484    -0.39   0.701    -.0795936    .0538279
          t3 |   .0021555   .0341825     0.06   0.950    -.0660194    .0703304
             |
     mdegree |
          2  |   .1003269   .0510548     1.97   0.053    -.0014988    .2021526
          3  |   .1687273   .0644008     2.62   0.011      .040284    .2971705
          4  |   .1487008   .0621591     2.39   0.019     .0247285    .2726731
          5  |   .1995242   .0658474     3.03   0.003     .0681956    .3308527
          6  |   .0559531   .0632137     0.89   0.379    -.0701226    .1820288
         20  |   .1671548   .0628814     2.66   0.010     .0417417    .2925679
         30  |   .1737864   .0690219     2.52   0.014     .0361265    .3114463
         31  |   .1885722   .0914246     2.06   0.043     .0062315    .3709128
         32  |   .3143897   .0712244     4.41   0.000     .1723372    .4564423
         33  |   .0478981   .0774986     0.62   0.539    -.1066679    .2024642
         34  |   .3340639   .0838787     3.98   0.000      .166773    .5013547
             |
       _cons |   .2814591   .0628667     4.48   0.000     .1560754    .4068428
------------------------------------------------------------------------------

. reg model_brw group1 group3     stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] 
> ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3146
                                                Root MSE          =     .09703

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
   model_brw | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .0005325   .0388389     0.01   0.989    -.0769293    .0779943
      group3 |  -.0261846   .0278494    -0.94   0.350    -.0817285    .0293594
   stats_brw |  -.0333007   .0390785    -0.85   0.397    -.1112404     .044639
   topic_brw |   .1306942   .0539709     2.42   0.018     .0230527    .2383356
          t2 |  -.0129325   .0344585    -0.38   0.709    -.0816577    .0557928
          t3 |   .0021418   .0343517     0.06   0.950    -.0663705    .0706542
             |
     mdegree |
          2  |    .100812   .0625613     1.61   0.112    -.0239626    .2255867
          3  |   .1689881   .0638653     2.65   0.010     .0416128    .2963635
          4  |   .1489986   .0645558     2.31   0.024     .0202461    .2777512
          5  |   .1998003   .0669459     2.98   0.004     .0662809    .3333197
          6  |   .0562927   .0651751     0.86   0.391     -.073695    .1862804
         20  |   .1674844   .0664105     2.52   0.014     .0350328    .2999361
         30  |   .1740721   .0706111     2.47   0.016     .0332427    .3149014
         31  |   .1888324   .0914608     2.06   0.043     .0064195    .3712453
         32  |   .3146259   .0733083     4.29   0.000      .168417    .4608347
         33  |   .0477823   .0784368     0.61   0.544     -.108655    .2042196
         34  |   .3344122   .0863505     3.87   0.000     .1621915    .5066328
             |
       _cons |   .2810425   .0659417     4.26   0.000     .1495258    .4125591
------------------------------------------------------------------------------

. *QUALITY MODELS LOSE A LOT OF SINGLETON OBSERVATIONS IF WE USE LOGIT;
. *SO WILL DO LINEAR PROBABILITY MODEL INSTEAD;
. *OLS MODELS ON HIGH QUALITY;
. reg quality proindex     stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] , clust
> er(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3757
                                                Root MSE          =     .32072

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
     quality | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0330384   .0302999    -1.09   0.279    -.0934696    .0273928
   stats_brw |  -.1724301   .1192331    -1.45   0.153     -.410233    .0653727
   topic_brw |   .4256827   .2008235     2.12   0.038     .0251529    .8262124
          t2 |  -.0753996   .0610838    -1.23   0.221    -.1972274    .0464281
          t3 |   .1991776   .1234601     1.61   0.111    -.0470559    .4454111
             |
     mdegree |
          2  |   .2826456   .1549429     1.82   0.072    -.0263782    .5916695
          3  |   .2439352    .186558     1.31   0.195    -.1281431    .6160134
          4  |   .2596108   .1632245     1.59   0.116    -.0659303    .5851519
          5  |   .1723031   .1759259     0.98   0.331    -.1785701    .5231763
          6  |   .1320853   .2024708     0.65   0.516    -.2717301    .5359007
         20  |     .29964   .1908047     1.57   0.121    -.0809081     .680188
         30  |  -.0133835   .1798651    -0.07   0.941    -.3721132    .3453461
         31  |   .2686565   .2720298     0.99   0.327    -.2738899    .8112029
         32  |   .6806303   .2449973     2.78   0.007     .1919986    1.169262
         33  |  -.0609516   .1944213    -0.31   0.755    -.4487126    .3268094
         34  |   .9798498   .1901203     5.15   0.000     .6006669    1.359033
             |
       _cons |  -.0029252   .1863236    -0.02   0.988     -.374536    .3686856
------------------------------------------------------------------------------

. reg quality dindex     stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] , cluster
> (teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3910
                                                Root MSE          =     .31674

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
     quality | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.1355305   .0926589    -1.46   0.148    -.3203329    .0492718
   stats_brw |   -.156821   .1191358    -1.32   0.192    -.3944299    .0807879
   topic_brw |   .4093254   .1932047     2.12   0.038     .0239908    .7946601
          t2 |   -.096903   .0635877    -1.52   0.132    -.2237247    .0299187
          t3 |   .1747628   .1160599     1.51   0.137    -.0567113    .4062369
             |
     mdegree |
          2  |   .2291422   .1539543     1.49   0.141      -.07791    .5361944
          3  |   .2357716   .1826774     1.29   0.201    -.1285671    .6001102
          4  |   .2420068   .1574747     1.54   0.129    -.0720666    .5560802
          5  |   .1427904   .1767652     0.81   0.422    -.2097566    .4953374
          6  |   .0956278   .2103541     0.45   0.651    -.3239102    .5151659
         20  |   .2755127   .2014333     1.37   0.176    -.1262332    .6772587
         30  |  -.0231408   .1714069    -0.14   0.893    -.3650011    .3187195
         31  |   .2494311   .2601745     0.96   0.341    -.2694705    .7683328
         32  |   .6673231   .2518769     2.65   0.010     .1649705    1.169676
         33  |   -.133627   .2016848    -0.66   0.510    -.5358746    .2686206
         34  |   .9529325   .1932712     4.93   0.000     .5674652      1.3384
             |
       _cons |  -.0297957   .1700652    -0.18   0.861    -.3689799    .3093886
------------------------------------------------------------------------------

. reg quality group1 group3     stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] , 
> cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3920
                                                Root MSE          =     .31661

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
     quality | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0502385   .1989047    -0.25   0.801    -.4469414    .3464643
      group3 |  -.1497042   .1017063    -1.47   0.146     -.352551    .0531427
   stats_brw |  -.1608277   .1205679    -1.33   0.187    -.4012928    .0796373
   topic_brw |   .4053744    .192024     2.11   0.038     .0223946    .7883542
          t2 |   -.092219   .0659005    -1.40   0.166    -.2236534    .0392154
          t3 |   .1760523   .1161377     1.52   0.134     -.055577    .4076816
             |
     mdegree |
          2  |   .1833739   .2320029     0.79   0.432    -.2793413    .6460891
          3  |   .2111599    .209887     1.01   0.318    -.2074465    .6297663
          4  |   .2139104   .1920335     1.11   0.269    -.1690883    .5969091
          5  |   .1167377   .2009172     0.58   0.563     -.283979    .5174543
          6  |   .0635862   .2475873     0.26   0.798     -.430211    .5573835
         20  |   .2444145   .2395702     1.02   0.311    -.2333931    .7222222
         30  |  -.0500886   .2048631    -0.24   0.808    -.4586752     .358498
         31  |   .2248799   .2827704     0.80   0.429     -.339088    .7888477
         32  |   .6450474   .2877054     2.24   0.028     .0712371    1.218858
         33  |  -.1226974    .207696    -0.59   0.557     -.536934    .2915392
         34  |   .9200743   .2322032     3.96   0.000     .4569595    1.383189
             |
       _cons |   .0095129   .2277139     0.04   0.967    -.4446482    .4636739
------------------------------------------------------------------------------

. *LOGIT MODELS ON HIGH QUALITY;
. quietly logit quality proindex     stats_brw topic_brw t2 t3 i.mdegree   [iw=1/nmode
> l] ,  cluster(teamid);

. display e(r2_p);
.25304276

. margins, dydx(proindex-t3);

Average marginal effects                                   Number of obs = 880
Model VCE: Robust

Expression: Pr(quality), predict()
dy/dx wrt:  proindex stats_brw topic_brw t2 t3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0510731   .0508628    -1.00   0.315    -.1507624    .0486161
   stats_brw |  -.1981629   .1506076    -1.32   0.188    -.4933483    .0970225
   topic_brw |   .5311968   .1973533     2.69   0.007     .1443914    .9180021
          t2 |          0  (omitted)
          t3 |   .2385305   .1337357     1.78   0.074    -.0235866    .5006475
------------------------------------------------------------------------------

. quietly logit quality dindex     stats_brw topic_brw t2 t3 i.mdegree   [iw=1/nmodel]
>  ,  cluster(teamid);

. display e(r2_p);
.27185763

. margins, dydx(dindex-t3);

Average marginal effects                                   Number of obs = 880
Model VCE: Robust

Expression: Pr(quality), predict()
dy/dx wrt:  dindex stats_brw topic_brw t2 t3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.1370704   .0864165    -1.59   0.113    -.3064436    .0323029
   stats_brw |  -.1880626   .1552196    -1.21   0.226    -.4922874    .1161623
   topic_brw |   .5205767   .1919248     2.71   0.007     .1444111    .8967424
          t2 |          0  (omitted)
          t3 |   .2134899   .1176582     1.81   0.070     -.017116    .4440958
------------------------------------------------------------------------------

. quietly logit quality group1 group3     stats_brw topic_brw t2 t3 i.mdegree   [iw=1/
> nmodel] ,  cluster(teamid);

. display e(r2_p);
.27645739

. margins, dydx(group1-t3);

Average marginal effects                                   Number of obs = 880
Model VCE: Robust

Expression: Pr(quality), predict()
dy/dx wrt:  group1 group3 stats_brw topic_brw t2 t3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0841349   .1771107    -0.48   0.635    -.4312655    .2629957
      group3 |  -.1620268   .0968163    -1.67   0.094    -.3517832    .0277296
   stats_brw |  -.2021256   .1560507    -1.30   0.195    -.5079794    .1037282
   topic_brw |   .5199063   .1804692     2.88   0.004     .1661931    .8736195
          t2 |          0  (omitted)
          t3 |   .2223546   .1173979     1.89   0.058     -.007741    .4524503
------------------------------------------------------------------------------

. ********************************************************************;
. *RELATIONSHIP BETWEEN NEW MEASURE OF QUALITY OF RESEARCH AND PRO-IMMIGRATION INDEX;
. *NOTE THESE REGRESSIONS LOSE A FEW OBSERVATIONS BECAUSE PEER_MEAN IS NOT AVAILABLE F
> OR 38 OBSERVATIONS;
. summ quality quality2;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     quality |      1,253    .2346369    .4239409          0          1
    quality2 |      1,215    .2271605    .4191697          0          1

. *NOTE HUGE RELATIONSHIP BETWEEN TEAM SIZE AND QUALITY, NO HIGH-QUALITY RESEARCH WHEN
>  ONLY SINGLE AUTHOR;
. tabulate team_size quality;

           |        quality
 team_size |         0          1 |     Total
-----------+----------------------+----------
         1 |       277          0 |       277 
         2 |       380         19 |       399 
         3 |       302        275 |       577 
-----------+----------------------+----------
     Total |       959        294 |     1,253 

. tabulate team_size quality2;

           |       quality2
 team_size |         0          1 |     Total
-----------+----------------------+----------
         1 |       206         71 |       277 
         2 |       338         61 |       399 
         3 |       395        144 |       539 
-----------+----------------------+----------
     Total |       939        276 |     1,215 

. *WEIGHT ALSO BY PEER_N, NUMBER OF REVIEWERS THAT MODEL HAD;
. *NEW REFEREE SCORE MEASURE AS DEPENDENT VARIABLE;
. reg peer_mean proindex     stats_brw topic_brw t2 t3 i.mdegree  [aw=peer_n/nmodel] ,
>   cluster(teamid);
(sum of wgt is 647.0125)

Linear regression                               Number of obs     =      1,215
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2356
                                                Root MSE          =     .48485

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
   peer_mean | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0592254   .0398515    -1.49   0.142    -.1387067     .020256
   stats_brw |  -.4013378   .1332458    -3.01   0.004    -.6670881   -.1355875
   topic_brw |   .5817613   .2129877     2.73   0.008     .1569706    1.006552
          t2 |   .2110967    .168134     1.26   0.213    -.1242359    .5464294
          t3 |   .3750681    .179979     2.08   0.041     .0161113    .7340248
             |
     mdegree |
          2  |   2.124713   .1730552    12.28   0.000     1.779566    2.469861
          3  |   1.601415   .2470232     6.48   0.000     1.108743    2.094088
          4  |   1.765872   .2277979     7.75   0.000     1.311543    2.220201
          5  |   1.816526   .2281294     7.96   0.000     1.361536    2.271516
          6  |   1.594996   .2839732     5.62   0.000     1.028629    2.161363
         20  |   1.922445   .2438069     7.89   0.000     1.436188    2.408703
         30  |   1.947279   .2892347     6.73   0.000     1.370418    2.524139
         31  |   1.692067   .3909564     4.33   0.000     .9123294    2.471805
         32  |   1.497175   .2712588     5.52   0.000     .9561661    2.038183
         33  |   1.703293   .3164176     5.38   0.000     1.072218    2.334368
         34  |   2.044228   .3508049     5.83   0.000      1.34457    2.743886
             |
       _cons |   2.628698    .319095     8.24   0.000     1.992283    3.265112
------------------------------------------------------------------------------

. reg peer_mean dindex     stats_brw topic_brw t2 t3 i.mdegree   [aw=peer_n/nmodel] , 
>  cluster(teamid);
(sum of wgt is 647.0125)

Linear regression                               Number of obs     =      1,215
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3010
                                                Root MSE          =     .46365

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
   peer_mean | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.3649025   .1216823    -3.00   0.004    -.6075902   -.1222148
   stats_brw |  -.3750341   .1409614    -2.66   0.010    -.6561728   -.0938954
   topic_brw |   .5313798   .1962932     2.71   0.009     .1398853    .9228742
          t2 |   .1527901   .1713214     0.89   0.376    -.1888996    .4944799
          t3 |   .3091282   .1738153     1.78   0.080    -.0375354    .6557919
             |
     mdegree |
          2  |   2.028809   .1821142    11.14   0.000     1.665594    2.392025
          3  |   1.682354   .2541981     6.62   0.000     1.175372    2.189336
          4  |    1.81465   .2246313     8.08   0.000     1.366637    2.262663
          5  |   1.781942   .2218129     8.03   0.000      1.33955    2.224334
          6  |   1.593589   .2442029     6.53   0.000     1.106542    2.080636
         20  |   1.933418   .2478387     7.80   0.000     1.439119    2.427717
         30  |   2.060364   .2780872     7.41   0.000     1.505736    2.614991
         31  |   1.685872   .3701208     4.55   0.000     .9476891    2.424054
         32  |   1.606739    .284297     5.65   0.000     1.039727    2.173751
         33  |   1.583981   .3198603     4.95   0.000     .9460394    2.221922
         34  |   1.982415   .3150427     6.29   0.000     1.354083    2.610748
             |
       _cons |   2.593621    .283763     9.14   0.000     2.027673    3.159568
------------------------------------------------------------------------------

. reg peer_mean group1 group3     stats_brw topic_brw t2 t3 i.mdegree   [aw=peer_n/nmo
> del] ,  cluster(teamid);
(sum of wgt is 647.0125)

Linear regression                               Number of obs     =      1,215
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3337
                                                Root MSE          =     .45286

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
   peer_mean | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.3715957   .1426255    -2.61   0.011    -.6560534   -.0871381
      group3 |  -.5252382   .1354004    -3.88   0.000    -.7952857   -.2551907
   stats_brw |   -.367627   .1307868    -2.81   0.006     -.628473   -.1067811
   topic_brw |   .4444287   .1903535     2.33   0.022     .0647807    .8240767
          t2 |   .2107074   .1630394     1.29   0.200    -.1144644    .5358792
          t3 |    .283924   .1723567     1.65   0.104    -.0598306    .6276786
             |
     mdegree |
          2  |   1.639895   .2245365     7.30   0.000     1.192071    2.087719
          3  |   1.548495   .2425552     6.38   0.000     1.064734    2.032256
          4  |   1.630752   .2259392     7.22   0.000     1.180131    2.081374
          5  |   1.585907   .2230143     7.11   0.000     1.141119    2.030695
          6  |   1.359512   .2389462     5.69   0.000     .8829484    1.836075
         20  |    1.72253   .2606325     6.61   0.000     1.202715    2.242345
         30  |   1.940195   .2638635     7.35   0.000     1.413936    2.466455
         31  |   1.513975   .3490373     4.34   0.000     .8178421    2.210108
         32  |   1.493061   .2572748     5.80   0.000     .9799425    2.006179
         33  |   1.679392   .3119076     5.38   0.000     1.057312    2.301472
         34  |   1.735551   .2948879     5.89   0.000     1.147416    2.323686
             |
       _cons |   2.899164   .2859495    10.14   0.000     2.328855    3.469472
------------------------------------------------------------------------------

. *QUALITY MODELS LOSE A LOT OF SINGLETON OBSERVATIONS IF WE USE LOGIT;
. *SO WILL DO LINEAR PROBABILITY MODEL INSTEAD;
. *OLS MODELS ON HIGH quality2;
. reg quality2 proindex     stats_brw topic_brw t2 t3 i.mdegree   [aw=peer_n/nmodel] ,
>  cluster(teamid);
(sum of wgt is 647.0125)

Linear regression                               Number of obs     =      1,215
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2142
                                                Root MSE          =     .41252

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
    quality2 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0172861   .0449004    -0.38   0.701    -.1068371    .0722649
   stats_brw |  -.2676557   .1403527    -1.91   0.061    -.5475803    .0122689
   topic_brw |   .2384866   .1567621     1.52   0.133    -.0741656    .5511388
          t2 |   .1166761   .1678708     0.70   0.489    -.2181316    .4514839
          t3 |   .3047869   .1325235     2.30   0.024     .0404771    .5690967
             |
     mdegree |
          2  |   1.364175   .1707875     7.99   0.000     1.023551      1.7048
          3  |     .58513    .289578     2.02   0.047     .0075849    1.162675
          4  |   .6889166   .2329456     2.96   0.004     .2243213    1.153512
          5  |   .7548537   .2349384     3.21   0.002     .2862839    1.223424
          6  |   .4452162    .257459     1.73   0.088    -.0682696    .9587019
         20  |   .7221319   .3042824     2.37   0.020     .1152599    1.329004
         30  |   1.164441   .2474573     4.71   0.000     .6709026    1.657979
         31  |   .7177916    .385536     1.86   0.067    -.0511358    1.486719
         32  |   .4452262   .2520389     1.77   0.082    -.0574494    .9479019
         33  |   .2042966   .3126278     0.65   0.516    -.4192199     .827813
         34  |   .9584765   .3809197     2.52   0.014     .1987561    1.718197
             |
       _cons |  -.3944325   .3683752    -1.07   0.288    -1.129134    .3402687
------------------------------------------------------------------------------

. reg quality2 dindex     stats_brw topic_brw t2 t3 i.mdegree   [aw=peer_n/nmodel] , c
> luster(teamid);
(sum of wgt is 647.0125)

Linear regression                               Number of obs     =      1,215
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2574
                                                Root MSE          =     .40101

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
    quality2 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.2254801   .1248158    -1.81   0.075    -.4744174    .0234572
   stats_brw |  -.2591644    .151562    -1.71   0.092    -.5614453    .0431165
   topic_brw |   .2147713   .1486138     1.45   0.153    -.0816296    .5111723
          t2 |   .0798718   .1837973     0.43   0.665    -.2867005     .446444
          t3 |   .2709358   .1253454     2.16   0.034     .0209422    .5209293
             |
     mdegree |
          2  |   1.334333   .1896124     7.04   0.000     .9561631    1.712503
          3  |   .6840472   .3278038     2.09   0.041     .0302632    1.337831
          4  |   .7796378   .2690202     2.90   0.005      .243094    1.316182
          5  |   .7572553   .2535731     2.99   0.004     .2515197    1.262991
          6  |   .4972626   .2987061     1.66   0.100    -.0984879    1.093013
         20  |   .7786267   .3011858     2.59   0.012     .1779306    1.379323
         30  |    1.31201    .285857     4.59   0.000     .7418866    1.882134
         31  |   .7555573   .4055473     1.86   0.067    -.0532813    1.564396
         32  |   .5518792   .2788155     1.98   0.052    -.0042008    1.107959
         33  |   .1654906    .356016     0.46   0.643    -.5445609    .8755421
         34  |   .9645869   .3803514     2.54   0.013     .2059999    1.723174
             |
       _cons |  -.3856641    .331793    -1.16   0.249    -1.047404    .2760763
------------------------------------------------------------------------------

. reg quality2 group1 group3     stats_brw topic_brw t2 t3 i.mdegree   [aw=peer_n/nmod
> el] , cluster(teamid);
(sum of wgt is 647.0125)

Linear regression                               Number of obs     =      1,215
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3106
                                                Root MSE          =     .38656

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
    quality2 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.3974377   .1840696    -2.16   0.034    -.7645529   -.0303225
      group3 |  -.3969661    .137826    -2.88   0.005    -.6718514   -.1220808
   stats_brw |  -.2512423   .1421799    -1.77   0.082    -.5348112    .0323267
   topic_brw |   .1217734   .1500904     0.81   0.420    -.1775724    .4211192
          t2 |   .1418168   .1832233     0.77   0.442    -.2236106    .5072442
          t3 |   .2439787   .1264224     1.93   0.058    -.0081627    .4961202
             |
     mdegree |
          2  |   .9183727   .2442568     3.76   0.000     .4312178    1.405528
          3  |   .5408789   .3041937     1.78   0.080    -.0658164    1.147574
          4  |   .5829512   .2551041     2.29   0.025     .0741621     1.09174
          5  |    .547587   .2403093     2.28   0.026     .0683052    1.026869
          6  |    .246907   .3124993     0.79   0.432    -.3763533    .8701672
         20  |   .5530733   .2657403     2.08   0.041     .0230709    1.083076
         30  |   1.183485   .2559974     4.62   0.000     .6729142    1.694055
         31  |   .5717064   .3540849     1.61   0.111    -.1344937    1.277907
         32  |   .4302955   .2356291     1.83   0.072    -.0396519     .900243
         33  |    .267537    .355206     0.75   0.454     -.440899     .975973
         34  |   .7005548   .3285435     2.13   0.036     .0452955    1.355814
             |
       _cons |  -.0588727   .3099312    -0.19   0.850     -.677011    .5592656
------------------------------------------------------------------------------

. *LOGIT MODELS ON HIGH quality2;
. quietly logit quality2 proindex     stats_brw topic_brw t2 t3 i.mdegree   [iw=peer_n
> /nmodel] ,  cluster(teamid);

. display e(r2_p);
.12383581

.  margins, dydx(proindex-t3);

Average marginal effects                                 Number of obs = 1,119
Model VCE: Robust

Expression: Pr(quality2), predict()
dy/dx wrt:  proindex stats_brw topic_brw t2 t3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0092976    .046819    -0.20   0.843    -.1010612     .082466
   stats_brw |   -.253085   .1398406    -1.81   0.070    -.5271675    .0209974
   topic_brw |   .2501989   .1656482     1.51   0.131    -.0744655    .5748633
          t2 |   .1272594    .181234     0.70   0.483    -.2279526    .4824714
          t3 |   .2954747   .1251616     2.36   0.018     .0501626    .5407869
------------------------------------------------------------------------------

. quietly logit quality2 dindex     stats_brw topic_brw t2 t3 i.mdegree   [iw=peer_n/n
> model] ,  cluster(teamid);

. display e(r2_p);
.16452064

.  margins, dydx(dindex-t3);

Average marginal effects                                 Number of obs = 1,119
Model VCE: Robust

Expression: Pr(quality2), predict()
dy/dx wrt:  dindex stats_brw topic_brw t2 t3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.1973888   .0969294    -2.04   0.042     -.387367   -.0074107
   stats_brw |   -.229757   .1504591    -1.53   0.127    -.5246514    .0651375
   topic_brw |    .223525   .1542416     1.45   0.147    -.0787831     .525833
          t2 |   .1148073   .2020384     0.57   0.570    -.2811807    .5107954
          t3 |    .262701   .1258429     2.09   0.037     .0160535    .5093486
------------------------------------------------------------------------------

. quietly logit quality2 group1 group3     stats_brw topic_brw t2 t3 i.mdegree   [iw=p
> eer_n/nmodel] ,  cluster(teamid);

. display e(r2_p);
.21610158

.  margins, dydx(group1-t3);

Average marginal effects                                 Number of obs = 1,119
Model VCE: Robust

Expression: Pr(quality2), predict()
dy/dx wrt:  group1 group3 stats_brw topic_brw t2 t3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.3284638    .162273    -2.02   0.043    -.6465131   -.0104145
      group3 |  -.3168298   .1092123    -2.90   0.004     -.530882   -.1027775
   stats_brw |    -.25305   .1446082    -1.75   0.080    -.5364769    .0303769
   topic_brw |   .1683915   .1585151     1.06   0.288    -.1422924    .4790753
          t2 |   .1667198   .1943358     0.86   0.391    -.2141713     .547611
          t3 |   .2355458   .1169295     2.01   0.044     .0063682    .4647234
------------------------------------------------------------------------------

. ********************************************************************;
. *SAVE MODEL LEVEL DATA FOR GRAPHS;
. save /volumes/ddisk/mi/researcher/model.dta, replace;
file /volumes/ddisk/mi/researcher/model.dta saved

. *********************************************************************;
. *DESCRIPTIVE TABLE AT THE MODEL LEVEL;
. tabulate topic_knowledge, sum(topic_brw);

TOPIC_KNOWL |       Summary of topic_ipred
       EDGE |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |   .27234222   .39773482         390
        Low |  -.26715929   .02579929         378
        Mid |  -.10503227   .05089555         485
------------+------------------------------------
      Total |  -.03648316   .31296556       1,253

. tabulate statistics_skill, sum(stats_brw);

STATISTICS_ |       Summary of stats_ipred
      SKILL |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |   .73442269   .24230561         178
        Low |  -.51687865   .25222262         282
        Mid |  -.03007244   .17214468         793
------------+------------------------------------
      Total |  -.03102952   .42165622       1,253

. tabulate model_score, sum(model_brw);

            |        Summary of model_brw
MODEL_SCORE |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |   .59514352   .03268489         294
        Low |   .31438404   .03962311         417
        Mid |   .46895185   .04982655         542
------------+------------------------------------
      Total |   .44712071   .11429906       1,253

. generate highstats=(statistics_skill=="High");

. generate hightopic=(topic_knowledge=="High");

. generate highmodel=(model_score=="High");

. summ dindex group1 group2 group3;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      dindex |      1,253    .5706305    .4951838          0          1
      group1 |      1,253    .1069433    .3091646          0          1
      group2 |      1,253    .3224262    .4675917          0          1
      group3 |      1,253    .5706305    .4951838          0          1

. tabulate dindex group3;

           |        group3
    dindex |         0          1 |     Total
-----------+----------------------+----------
         0 |       538          0 |       538 
         1 |         0        715 |       715 
-----------+----------------------+----------
     Total |       538        715 |     1,253 

. summ ame neg10s pos10s proindex dindex p12 p34 p56 group1 group2 group3 pbelief  nmo
> del team_size
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej highstats-high
> model ;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |      1,253    .0007771    .1865197  -1.353765       2.47
      neg10s |      1,253    .0630487    .2431475          0          1
      pos10s |      1,253    .0526736    .2234702          0          1
    proindex |      1,253    4.462357    1.135022          1          6
      dindex |      1,253    .5706305    .4951838          0          1
-------------+---------------------------------------------------------
         p12 |      1,253    .0782123    .2255071          0          1
         p34 |      1,253    .3812184    .3933172          0          1
         p56 |      1,253    .5405693    .4084319          0          1
      group1 |      1,253    .1069433    .3091646          0          1
      group2 |      1,253    .3224262    .4675917          0          1
-------------+---------------------------------------------------------
      group3 |      1,253    .5706305    .4951838          0          1
     pbelief |      1,253    .5810056    .4018672          0          1
      nmodel |      1,253    39.14525    32.66706          1        112
   team_size |      1,253    2.239425    .7904039          1          3
   stats_brw |      1,253   -.0310295    .4216562  -1.352966   1.099596
-------------+---------------------------------------------------------
   topic_brw |      1,253   -.0364832    .3129656  -.3396846   1.210172
   model_brw |      1,253    .4471207    .1142991   .1488998   .7288508
   peer_mean |      1,215    4.203944    .5266504          2   5.666667
     quality |      1,253    .2346369    .4239409          0          1
    quality2 |      1,215    .2271605    .4191697          0          1
-------------+---------------------------------------------------------
        hrej |      1,253    .6799681    .4666747          0          1
   highstats |      1,253    .1420591    .3492501          0          1
   hightopic |      1,253     .311253    .4631909          0          1
   highmodel |      1,253    .2346369    .4239409          0          1

. summ ame neg10s pos10s proindex dindex p12 p34 p56 group1 group2 group3 pbelief  nmo
> del team_size
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej highstats-high
> model if index==1 ;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |        134   -.0188496    .0971865    -.40887     .42193
      neg10s |        134     .119403    .3254789          0          1
      pos10s |        134    .0373134    .1902399          0          1
    proindex |        134    2.422886    .9508947          1   3.666667
      dindex |        134           0           0          0          0
-------------+---------------------------------------------------------
         p12 |        134    .6318408    .3173319   .3333333          1
         p34 |        134    .2636816    .2488894          0   .6666667
         p56 |        134    .1044776    .1552098          0   .3333333
      group1 |        134           1           0          1          1
      group2 |        134           0           0          0          0
-------------+---------------------------------------------------------
      group3 |        134           0           0          0          0
     pbelief |        134    .7263682    .3266261          0          1
      nmodel |        134    18.83582     6.23499          2         24
   team_size |        134    2.283582    .9144779          1          3
   stats_brw |        134    -.189059    .5281624  -1.352966   .6680702
-------------+---------------------------------------------------------
   topic_brw |        134   -.0596654    .1766918  -.2844923    .233174
   model_brw |        134    .4336417    .1041899   .2631785   .5655868
   peer_mean |        134    4.221775     .463432   3.142857        5.2
     quality |        134    .1940299    .3969359          0          1
    quality2 |        134    .1641791     .371828          0          1
-------------+---------------------------------------------------------
        hrej |        134    .9402985     .237822          0          1
   highstats |        134    .0447761    .2075881          0          1
   hightopic |        134     .358209    .4812731          0          1
   highmodel |        134    .1940299    .3969359          0          1

. summ ame neg10s pos10s proindex dindex p12 p34 p56 group1 group2 group3 pbelief  nmo
> del team_size
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej highstats-high
> model if index==2;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |        404   -.0097988    .1233201  -1.353765   1.306339
      neg10s |        404    .0940594    .2922733          0          1
      pos10s |        404     .049505    .2171888          0          1
    proindex |        404    3.848185    .4948586          3   4.666667
      dindex |        404           0           0          0          0
-------------+---------------------------------------------------------
         p12 |        404           0           0          0          0
         p34 |        404     .869637    .1628664   .6666667          1
         p56 |        404     .130363    .1628665          0   .3333333
      group1 |        404           0           0          0          0
      group2 |        404           1           0          1          1
-------------+---------------------------------------------------------
      group3 |        404           0           0          0          0
     pbelief |        404    .3663366    .3599925          0          1
      nmodel |        404    50.71287    39.76166          2        112
   team_size |        404     2.50495    .7062115          1          3
   stats_brw |        404    -.147368    .3657803  -.9406251    .813791
-------------+---------------------------------------------------------
   topic_brw |        404   -.0967982     .228128    -.30488   .8381723
   model_brw |        404    .4987117     .109167   .3257702   .6065403
   peer_mean |        380    4.505764    .3088112   3.714286   5.666667
     quality |        404     .490099    .5005218          0          1
    quality2 |        380    .3842105    .4870493          0          1
-------------+---------------------------------------------------------
        hrej |        404    .7128713    .4529831          0          1
   highstats |        404    .1534653    .3608824          0          1
   hightopic |        404    .1980198    .3990013          0          1
   highmodel |        404     .490099    .5005218          0          1

. summ ame neg10s pos10s proindex dindex p12 p34 p56 group1 group2 group3 pbelief  nmo
> del team_size
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej highstats-high
> model if index==3;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |        715    .0104311    .2245698   -1.13019       2.47
      neg10s |        715     .034965    .1838199          0          1
      pos10s |        715    .0573427    .2326589          0          1
    proindex |        715    5.191608    .6524806          4          6
      dindex |        715           1           0          1          1
-------------+---------------------------------------------------------
         p12 |        715     .018648    .0766582          0   .3333333
         p34 |        715    .1272727    .2064037          0         .5
         p56 |        715    .8540793    .2091066         .5          1
      group1 |        715           0           0          0          0
      group2 |        715           0           0          0          0
-------------+---------------------------------------------------------
      group3 |        715           1           0          1          1
     pbelief |        715    .6750583    .3889316          0          1
      nmodel |        715    36.41538    28.47889          1         96
   team_size |        715    2.081119    .7699677          1          3
   stats_brw |        715    .0643225    .4035249  -.8630697   1.099596
-------------+---------------------------------------------------------
   topic_brw |        715    .0019416    .3645869  -.3396846   1.210172
   model_brw |        715    .4204961    .1091312   .1488998   .7288508
   peer_mean |        701    4.036924    .5577951          2       5.25
     quality |        715    .0979021    .2973903          0          1
    quality2 |        701    .1540656    .3612694          0          1
-------------+---------------------------------------------------------
        hrej |        715    .6125874    .4875002          0          1
   highstats |        715    .1538462    .3610538          0          1
   hightopic |        715    .3664336    .4821672          0          1
   highmodel |        715    .0979021    .2973903          0          1

. *SUMMARY STATS WEIGHTED BY THE INVERSE OF THE NUMBER OF MODELS;
. summ ame neg10s pos10s proindex dindex p12 p34 p56 group1 group2 group3 pbelief  nmo
> del team_size
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej highstats-high
> model  [aw=1/nmodel];

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
         ame |   1,253          71   -.0085083   .2038202  -1.353765       2.47
      neg10s |   1,253          71    .1026884   .3036726          0          1
      pos10s |   1,253          71     .069587   .2545512          0          1
    proindex |   1,253          71    4.300469    1.10691          1          6
      dindex |   1,253          71    .6197183   .4856498          0          1
-------------+-----------------------------------------------------------------
         p12 |   1,253          71    .0938967   .2514385          0          1
         p34 |   1,253          71    .3967136   .3830483          0          1
         p56 |   1,253          71    .5093897   .4005581          0          1
      group1 |   1,253          71    .1267606   .3328374          0          1
      group2 |   1,253          71    .2535211   .4352003          0          1
-------------+-----------------------------------------------------------------
      group3 |   1,253          71    .6197183   .4856498          0          1
     pbelief |   1,253          71    .5492958    .387144          0          1
      nmodel |   1,253          71    17.64789   19.48554          1        112
   team_size |   1,253          71    2.225352   .7545788          1          3
   stats_brw |   1,253          71   -.0143092   .4385116  -1.352966   1.099596
-------------+-----------------------------------------------------------------
   topic_brw |   1,253          71   -.0086646   .2867097  -.3396846   1.210172
   model_brw |   1,253          71    .4356287   .1163981   .1488998   .7288508
   peer_mean |   1,215      69.625    4.231731   .6211737          2   5.666667
     quality |   1,253          71    .2042254   .4032954          0          1
    quality2 |   1,215      69.625    .3105326   .4629022          0          1
-------------+-----------------------------------------------------------------
        hrej |   1,253          71    .6455399   .4785404          0          1
   highstats |   1,253          71    .1971831   .3980306          0          1
   hightopic |   1,253          71    .3239437   .4681657          0          1
   highmodel |   1,253          71    .2042254   .4032954          0          1

. summ ame neg10s pos10s proindex dindex p12 p34 p56 group1 group2 group3 pbelief  nmo
> del team_size
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej highstats-high
> model if index==1  [aw=1/nmodel];

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
         ame |     134           9   -.0444999   .1254703    -.40887     .42193
      neg10s |     134           9    .2283951   .4213737          0          1
      pos10s |     134           9    .0432099   .2040922          0          1
    proindex |     134           9     2.37037   .9256753          1   3.666667
      dindex |     134           9           0          0          0          0
-------------+-----------------------------------------------------------------
         p12 |     134           9    .6666667   .3154489   .3333333          1
         p34 |     134           9    .2592593   .2628741          0   .6666667
         p56 |     134           9    .0740741   .1390999          0   .3333333
      group1 |     134           9           1          0          1          1
      group2 |     134           9           0          0          0          0
-------------+-----------------------------------------------------------------
      group3 |     134           9           0          0          0          0
     pbelief |     134           9    .7037037   .3325124          0          1
      nmodel |     134           9    14.88889   7.694627          2         24
   team_size |     134           9    2.222222   .9196838          1          3
   stats_brw |     134           9   -.2616901   .5862244  -1.352966   .6680702
-------------+-----------------------------------------------------------------
   topic_brw |     134           9   -.0896879   .1534702  -.2844923    .233174
   model_brw |     134           9    .4317806   .1071579   .2631785   .5655868
   peer_mean |     134           9    4.249944   .5633377   3.142857        5.2
     quality |     134           9    .2222222   .4172997          0          1
    quality2 |     134           9    .2592593   .4398725          0          1
-------------+-----------------------------------------------------------------
        hrej |     134           9    .8518519   .3565798          0          1
   highstats |     134           9    .1111111   .3154489          0          1
   hightopic |     134           9    .2222222   .4172997          0          1
   highmodel |     134           9    .2222222   .4172997          0          1

. summ ame neg10s pos10s proindex dindex p12 p34 p56 group1 group2 group3 pbelief  nmo
> del team_size
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej highstats-high
> model if index==2 [aw=1/nmodel];

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
         ame |     404          18   -.0177386   .2451826  -1.353765   1.306339
      neg10s |     404          18    .1579034   .3651026          0          1
      pos10s |     404          18     .095205   .2938618          0          1
    proindex |     404          18    3.657407   .4253441          3   4.666667
      dindex |     404          18           0          0          0          0
-------------+-----------------------------------------------------------------
         p12 |     404          18           0          0          0          0
         p34 |     404          18    .9444444     .12438   .6666667          1
         p56 |     404          18    .0555556     .12438          0   .3333333
      group1 |     404          18           0          0          0          0
      group2 |     404          18           1          0          1          1
-------------+-----------------------------------------------------------------
      group3 |     404          18           0          0          0          0
     pbelief |     404          18    .4351852   .3778324          0          1
      nmodel |     404          18    22.44444    25.2199          2        112
   team_size |     404          18    2.222222   .7866484          1          3
   stats_brw |     404          18    .0272715   .4715925  -.9406251    .813791
-------------+-----------------------------------------------------------------
   topic_brw |     404          18    .0255589   .3120676    -.30488   .8381723
   model_brw |     404          18    .4599035   .0998817   .3257702   .6065403
   peer_mean |     380       17.25    4.649413   .4091028   3.714286   5.666667
     quality |     404          18    .3333333    .471989          0          1
    quality2 |     380       17.25    .5710145   .4955838          0          1
-------------+-----------------------------------------------------------------
        hrej |     404          18    .5925926   .4919611          0          1
   highstats |     404          18    .3333333    .471989          0          1
   hightopic |     404          18    .3888889   .4881025          0          1
   highmodel |     404          18    .3333333    .471989          0          1

. summ ame neg10s pos10s proindex dindex p12 p34 p56 group1 group2 group3 pbelief  nmo
> del team_size
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej highstats-high
> model if index==3 [aw=1/nmodel];

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
         ame |     715          44    .0026297    .197191   -1.13019       2.47
      neg10s |     715          44    .0543876   .2269397          0          1
      pos10s |     715          44    .0645022   .2458173          0          1
    proindex |     715          44    4.958333   .6035758          4          6
      dindex |     715          44           1          0          1          1
-------------+-----------------------------------------------------------------
         p12 |     715          44    .0151515   .0694816          0   .3333333
         p34 |     715          44    .2007576   .2265139          0         .5
         p56 |     715          44    .7840909   .2237055         .5          1
      group1 |     715          44           0          0          0          0
      group2 |     715          44           0          0          0          0
-------------+-----------------------------------------------------------------
      group3 |     715          44           1          0          1          1
     pbelief |     715          44    .5643939   .3882473          0          1
      nmodel |     715          44       16.25   18.11481          1         96
   team_size |     715          44    2.227273   .7032021          1          3
   stats_brw |     715          44    .0192812   .3679032  -.8630697   1.099596
-------------+-----------------------------------------------------------------
   topic_brw |     715          44   -.0060922   .2937827  -.3396846   1.210172
   model_brw |     715          44    .4264852   .1230286   .1488998   .7288508
   peer_mean |     701      43.375    4.061842    .623991          2       5.25
     quality |     715          44    .1477273   .3550778          0          1
    quality2 |     701      43.375    .2175793   .4128943          0          1
-------------+-----------------------------------------------------------------
        hrej |     715          44        .625   .4844618          0          1
   highstats |     715          44    .1590909   .3660169          0          1
   hightopic |     715          44    .3181818   .4660965          0          1
   highmodel |     715          44    .1477273   .3550778          0          1

. **************************************************************'
> 
> *DESCRIPTIVE TABLE AT THE TEAM LEVEL BY COLLAPSING FROM THE MODEL LEVEL DATA;
. *THERE SEEMS TO BE AN INCONSISTENCY WITH THE TOPIC_KNOWLEDGE VARIABLE IN THE TEAM LE
> VEL DATA;
. *VERY FEW TEAMS ARE CLASSIFIED AS "HIGH" AS COMPARED TO THE MODEL LEVEL DATA;
. *SIMPLEST WAY TO SHOW IT IS TO DO A TABULATE MODEL_BRW TOPIC_KNOWLEDGE IN BOTH DATA 
> SETS;
. collapse (mean) ame proindex dindex group1 group2 group3 p12 p34 p56 pbelief  nmodel
>  team_size
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej highstats-high
> model index, by(teamid);

. summ ame proindex dindex p12 p34 p56 group1 group2 group3 pbelief  nmodel team_size 
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej highstats-high
> model ;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |         71   -.0085083    .0806706   -.267857   .3595625
    proindex |         71    4.300469    1.114344          1          6
      dindex |         71    .6197183    .4889112          0          1
         p12 |         71    .0938967    .2531271          0          1
         p34 |         71    .3967136    .3856207          0          1
-------------+---------------------------------------------------------
         p56 |         71    .5093897     .403248          0          1
      group1 |         71    .1267606    .3350726          0          1
      group2 |         71    .2535211    .4381229          0          1
      group3 |         71    .6197183    .4889112          0          1
     pbelief |         71    .5492958    .3897439          0          1
-------------+---------------------------------------------------------
      nmodel |         71    17.64789    19.61639          1        112
   team_size |         71    2.225352    .7596462          1          3
   stats_brw |         71   -.0143092    .4414565  -1.352966   1.099596
   topic_brw |         71   -.0086646    .2886352  -.3396846   1.210172
   model_brw |         71    .4356287    .1153529   .1488998   .6939181
-------------+---------------------------------------------------------
   peer_mean |         71    4.236243    .6076129          2   5.666667
     quality |         71    .2042254    .3833822          0          1
    quality2 |         71    .3159624    .4473417          0          1
        hrej |         71    .6455399    .4206284          0          1
   highstats |         71    .1971831    .4007036          0          1
-------------+---------------------------------------------------------
   hightopic |         71    .3239437    .4713097          0          1
   highmodel |         71    .2042254    .3833822          0          1

. summ ame proindex dindex p12 p34 p56 group1 group2 group3 pbelief  nmodel team_size 
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej highstats-high
> model if index==1;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |          9   -.0444999     .089032   -.257955   .0435525
    proindex |          9     2.37037    .9781565          1   3.666667
      dindex |          9           0           0          0          0
         p12 |          9    .6666667    .3333333   .3333333          1
         p34 |          9    .2592593    .2777778          0   .6666667
-------------+---------------------------------------------------------
         p56 |          9    .0740741    .1469862          0   .3333333
      group1 |          9           1           0          1          1
      group2 |          9           0           0          0          0
      group3 |          9           0           0          0          0
     pbelief |          9    .7037037    .3513642          0          1
-------------+---------------------------------------------------------
      nmodel |          9    14.88889    8.130874          2         24
   team_size |          9    2.222222    .9718253          1          3
   stats_brw |          9   -.2616901    .6194605  -1.352966   .6680702
   topic_brw |          9   -.0896879    .1621712  -.2844923    .233174
   model_brw |          9    .4317806     .108451   .2864059   .5655868
-------------+---------------------------------------------------------
   peer_mean |          9    4.249944    .5784541   3.142857        5.2
     quality |          9    .2222222    .4409586          0          1
    quality2 |          9    .2592593    .4339028          0          1
        hrej |          9    .8518519    .3379313          0          1
   highstats |          9    .1111111    .3333333          0          1
-------------+---------------------------------------------------------
   hightopic |          9    .2222222    .4409586          0          1
   highmodel |          9    .2222222    .4409586          0          1

. summ ame proindex dindex p12 p34 p56 group1 group2 group3 pbelief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej highstats-high
> model if index==2 ;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |         18   -.0177386    .0614432   -.178776   .1311667
    proindex |         18    3.657407    .4371335          3   4.666667
      dindex |         18           0           0          0          0
         p12 |         18           0           0          0          0
         p34 |         18    .9444444    .1278275   .6666667          1
-------------+---------------------------------------------------------
         p56 |         18    .0555556    .1278275          0   .3333333
      group1 |         18           0           0          0          0
      group2 |         18           1           0          1          1
      group3 |         18           0           0          0          0
     pbelief |         18    .4351852    .3883049          0          1
-------------+---------------------------------------------------------
      nmodel |         18    22.44444    25.91893          2        112
   team_size |         18    2.222222    .8084521          1          3
   stats_brw |         18    .0272715    .4846637  -.9406251    .813791
   topic_brw |         18    .0255589    .3207173    -.30488   .8381723
   model_brw |         18    .4599035    .1022613   .3257702   .6065403
-------------+---------------------------------------------------------
   peer_mean |         18    4.657441    .3945461   4.142857   5.666667
     quality |         18    .3333333    .4850713          0          1
    quality2 |         18    .5888889    .4921608          0          1
        hrej |         18    .5925926    .4131112          0          1
   highstats |         18    .3333333    .4850713          0          1
-------------+---------------------------------------------------------
   hightopic |         18    .3888889    .5016313          0          1
   highmodel |         18    .3333333    .4850713          0          1

. summ ame proindex dindex p12 p34 p56 group1 group2 group3 pbelief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej highstats-high
> model if index==3;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |         44    .0026297    .0848115   -.267857   .3595625
    proindex |         44    4.958333    .6101266          4          6
      dindex |         44           1           0          1          1
         p12 |         44    .0151515    .0702357          0   .3333333
         p34 |         44    .2007576    .2289724          0         .5
-------------+---------------------------------------------------------
         p56 |         44    .7840909    .2261335         .5          1
      group1 |         44           0           0          0          0
      group2 |         44           0           0          0          0
      group3 |         44           1           0          1          1
     pbelief |         44    .5643939    .3924611          0          1
-------------+---------------------------------------------------------
      nmodel |         44       16.25    18.31142          1         96
   team_size |         44    2.227273    .7108343          1          3
   stats_brw |         44    .0192812    .3718962  -.8630697   1.099596
   topic_brw |         44   -.0060922    .2969712  -.3396846   1.210172
   model_brw |         44    .4264852    .1224891   .1488998   .6939181
-------------+---------------------------------------------------------
   peer_mean |         44    4.061132    .6095383          2       5.25
     quality |         44    .1477273    .3158515          0          1
    quality2 |         44    .2159091    .3909994          0          1
        hrej |         44        .625     .434502          0          1
   highstats |         44    .1590909    .3699894          0          1
-------------+---------------------------------------------------------
   hightopic |         44    .3181818    .4711553          0          1
   highmodel |         44    .1477273    .3158515          0          1

. log close;
      name:  <unnamed>
       log:  /volumes/ddisk/mi/researcher/reg_model.log
  log type:  text
 closed on:  21 Sep 2024, 14:01:50
--------------------------------------------------------------------------------------
