-------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /users/ddisk/mi/researcher/reg_predict.log
  log type:  text
 opened on:   9 Oct 2024, 09:34:37

. clear matrix;

. clear mata;

. *USES THE MODEL LEVEL DATA CREATED IN REG_MODEL.DO;
. use "/users/Ddisk/MI/Researcher/model.dta", clear;

. encode dv, gen(dvv);

. drop if ame==.;
(0 observations deleted)

. *DEFINES "SET" AS THE SET OF VARIABLES USED TO SUMMARIZE SPECIFICATION DECISIONS;
. global set scale stock flow  level_cyear allavailable w1996 w2006 w2016;

. *GETS LINEAR PREDICTION OF THE SET;
. *LINEAR PREDICTION IS USELESS AS IT DOESN'T REALLY TAKE ACCOUNT OF INTERACTIONS;
. regress ame $set [aw=model_brw];
(sum of wgt is 560.2422434389591)

      Source |       SS           df       MS      Number of obs   =     1,253
-------------+----------------------------------   F(8, 1244)      =      3.86
       Model |  1.03166787         8  .128958483   Prob > F        =    0.0002
    Residual |  41.6064026     1,244  .033445661   R-squared       =    0.0242
-------------+----------------------------------   Adj R-squared   =    0.0179
       Total |  42.6380705     1,252  .034055967   Root MSE        =    .18288

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       scale |  -.0145209   .0143024    -1.02   0.310    -.0425804    .0135386
       stock |  -.0342599   .0281946    -1.22   0.225    -.0895741    .0210544
        flow |  -.0346967   .0279189    -1.24   0.214    -.0894701    .0200767
 level_cyear |   .0293463   .0141063     2.08   0.038     .0016715    .0570212
allavailable |  -.0144867    .012632    -1.15   0.252     -.039269    .0102957
       w1996 |  -.0346319   .0136314    -2.54   0.011     -.061375   -.0078889
       w2006 |   .0325202   .0227849     1.43   0.154    -.0121808    .0772212
       w2016 |  -.0488368   .0119133    -4.10   0.000    -.0722092   -.0254644
       _cons |    .061073   .0373058     1.64   0.102    -.0121162    .1342622
------------------------------------------------------------------------------

. predict pame;
(option xb assumed; fitted values)

. *THE COLLAPSE BY $SET WEIGHTED BY THE REFEREE SCORE MODEL_BRW PRODUCES SIMILAR RESU
> LTS;
. *THE VARIABLE MAME IS THE MEAN AME BY SPECIFICATION;
. *THE VARIABLE MEANSCORE IS THE MEAN REFEREE SCORE FOR EACH OF THE 58 SPECIFICATIONS
> ;
. collapse (mean) mame=ame pame meanscore=model_brw meanpeer=pscore, 
>         by($set);

. *THE VARIABLE SPEC GIVES THE NUMBER OF THE SPECIFICATION, THERE ARE 58;
. generate spec=_n;

. summ mame spec;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        mame |         58   -.0001524    .1076728    -.37979   .4533333
        spec |         58        29.5    16.88688          1         58

. save /users/ddisk/data/junkame.dta, replace;
file /users/ddisk/data/junkame.dta saved

. *MERGE MAME WITH THE DATA SET;
. use "/users/Ddisk/MI/Researcher/model.dta";

. encode dv, gen(dvv);

. global set scale stock flow  level_cyear allavailable w1996 w2006 w2016;

.         sort $set;

. merge $set using /users/ddisk/data/junkame.dta;
(you are using old merge syntax; see [D] merge for new syntax)
variables scale stock flow level_cyear allavailable w1996 w2006 w2016 do not
    uniquely identify observations in the master data

. *NOTE THAT MODEL_BRW IS THE WRONG SCORE FOR THE 58 MIXED SPECIFICATION;
. *SO WILL USE MEANSCORE INSTEAD;
. *NOTE DIFFERENCE IN R-SQUARED BETWEEN AME AND LINEAR SET OF SPECIFICATION PREDICTIO
> NS;
. *AND AME AND FULL INTERACTION MODEL;
. reg ame $set;

      Source |       SS           df       MS      Number of obs   =     1,253
-------------+----------------------------------   F(8, 1244)      =      4.40
       Model |  1.19752787         8  .149690984   Prob > F        =    0.0000
    Residual |  42.3590465     1,244   .03405068   R-squared       =    0.0275
-------------+----------------------------------   Adj R-squared   =    0.0212
       Total |  43.5565743     1,252  .034789596   Root MSE        =    .18453

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       scale |   -.010397   .0145524    -0.71   0.475    -.0389469    .0181529
       stock |  -.0373823   .0299044    -1.25   0.212    -.0960509    .0212863
        flow |  -.0348237   .0296142    -1.18   0.240    -.0929231    .0232756
 level_cyear |   .0367591   .0149243     2.46   0.014     .0074795    .0660387
allavailable |  -.0225861   .0132256    -1.71   0.088     -.048533    .0033608
       w1996 |  -.0420884   .0147094    -2.86   0.004    -.0709464   -.0132304
       w2006 |   .0382246   .0235446     1.62   0.105    -.0079669    .0844161
       w2016 |  -.0499874   .0115562    -4.33   0.000    -.0726592   -.0273155
       _cons |   .0671895   .0390879     1.72   0.086    -.0094959    .1438749
------------------------------------------------------------------------------

. areg ame, absorb(spec);

Linear regression, absorbing indicators             Number of obs     =  1,253
Absorbed variable: spec                             No. of categories =     58
                                                    F(0, 1195)        =      .
                                                    Prob > F          =      .
                                                    R-squared         = 0.1481
                                                    Adj R-squared     = 0.1075
                                                    Root MSE          = 0.1762

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |   .0007771    .004978     0.16   0.876    -.0089896    .0105437
------------------------------------------------------------------------------
F test of absorbed indicators: F(57, 1195) = 3.645            Prob > F = 0.000

. *MEANS OF REGRESSORS USED TO SUMMARIZE SPEFICATIONS BY INDEX;
. *THIS CREATES DESCRIPTIVE TABLE OF DIFFERENT SPECIFICATIONS USED BY DIFFERENT BROUP
> S;
. tabulate index,  sum(scale);

            |          Summary of Scale
      index |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |   .10447761    .3070269         134
          2 |   .12871287    .3352971         404
          3 |   .18041958   .38480574         715
------------+------------------------------------
      Total |    .1556265   .36264562       1,253

. tabulate index, sum(stock);

            |          Summary of Stock
      index |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |   .58208955   .49506599         134
          2 |   .46534653   .49941616         404
          3 |    .4965035   .50033778         715
------------+------------------------------------
      Total |   .49561053   .50018037       1,253

. tabulate index, sum(flow);

            |           Summary of Flow
      index |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |   .41044776   .49376087         134
          2 |   .53217822   .49958217         404
          3 |   .44615385   .49744012         715
------------+------------------------------------
      Total |   .47007183   .49930278       1,253

. tabulate index, sum(level_cyear);

            |       Summary of level_cyear
      index |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |   .13432836   .34228434         134
          2 |   .08415842   .27796948         404
          3 |    .2013986   .40132589         715
------------+------------------------------------
      Total |   .15642458   .36340243       1,253

. tabulate index, sum(allavailable);

            |       Summary of allavailable
      index |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |   .23880597   .42795377         134
          2 |   .56435644   .49645576         404
          3 |   .23356643   .42339565         715
------------+------------------------------------
      Total |   .34078212   .47416147       1,253

. tabulate index, sum(w1996);

            |          Summary of w1996
      index |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |   .91044776   .28661065         134
          2 |   .53465347   .49941616         404
          3 |   .86573427   .34117627         715
------------+------------------------------------
      Total |   .76376696   .42493659       1,253

. tabulate index, sum(w2006);

            |          Summary of w2006
      index |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |           1           0         134
          2 |   .94059406     .236676         404
          3 |   .93846154    .2404836         715
------------+------------------------------------
      Total |   .94573025   .22663967       1,253

. tabulate index, sum(w2016);

            |          Summary of w2016
      index |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |   .73134328   .44492424         134
          2 |   .74752475   .43497105         404
          3 |   .56083916   .49663221         715
------------+------------------------------------
      Total |   .63926576   .48040528       1,253

. *REGRESSIONS ON PREDICTED AME;
. reg mame proindex     stats_brw topic_brw   t2 t3 i.mdegree  [aw=1/nmodel],  cluste
> r(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1068
                                                Root MSE          =     .06699

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
        mame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0082933   .0042554     1.95   0.055    -.0001937    .0167804
   stats_brw |   .0496808   .0328702     1.51   0.135    -.0158768    .1152384
   topic_brw |  -.0555866    .036114    -1.54   0.128    -.1276137    .0164405
          t2 |   .0226603    .009982     2.27   0.026     .0027517    .0425688
          t3 |    .008275   .0164239     0.50   0.616    -.0244813    .0410314
             |
     mdegree |
          2  |  -.0805511   .0432945    -1.86   0.067    -.1668993    .0057971
          3  |  -.0886881   .0423114    -2.10   0.040    -.1730755   -.0043006
          4  |  -.0941094    .044757    -2.10   0.039    -.1833744   -.0048443
          5  |  -.0444912   .0503937    -0.88   0.380    -.1449982    .0560157
          6  |  -.1196217   .0478743    -2.50   0.015    -.2151041   -.0241394
         20  |  -.0924509   .0563796    -1.64   0.106    -.2048964    .0199947
         30  |  -.0827731   .0426278    -1.94   0.056    -.1677915    .0022454
         31  |  -.0822876   .0467696    -1.76   0.083    -.1755667    .0109914
         32  |   -.094361   .0420311    -2.25   0.028    -.1781894   -.0105326
         33  |  -.0884507   .0502956    -1.76   0.083    -.1887621    .0118607
         34  |  -.1172652   .0531681    -2.21   0.031    -.2233056   -.0112248
         35  |   -.076935   .0355039    -2.17   0.034    -.1477452   -.0061248
             |
       _cons |   .0342113   .0378487     0.90   0.369    -.0412757    .1096982
------------------------------------------------------------------------------

. reg mame dindex     stats_brw topic_brw   t2 t3 i.mdegree   [aw=1/nmodel],  cluster
> (teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1171
                                                Root MSE          =     .06661

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
        mame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0249639   .0115241     2.17   0.034     .0019798     .047948
   stats_brw |   .0480503   .0308595     1.56   0.124     -.013497    .1095976
   topic_brw |   -.054008   .0333707    -1.62   0.110    -.1205637    .0125477
          t2 |   .0185251   .0089231     2.08   0.042     .0007286    .0363216
          t3 |   .0085971   .0156291     0.55   0.584    -.0225741    .0397682
             |
     mdegree |
          2  |  -.0701326   .0403337    -1.74   0.086    -.1505757    .0103105
          3  |  -.0829208   .0430863    -1.92   0.058    -.1688537     .003012
          4  |  -.0865679   .0456383    -1.90   0.062    -.1775905    .0044548
          5  |  -.0381866   .0487612    -0.78   0.436    -.1354376    .0590645
          6  |   -.109316   .0455819    -2.40   0.019    -.2002261   -.0184058
         20  |  -.0859332   .0596451    -1.44   0.154    -.2048917    .0330253
         30  |  -.0731841   .0463073    -1.58   0.119    -.1655411    .0191729
         31  |  -.0751753   .0480928    -1.56   0.123    -.1710935    .0207429
         32  |  -.0882879   .0426986    -2.07   0.042    -.1734476   -.0031282
         33  |  -.0727707   .0477564    -1.52   0.132    -.1680178    .0224765
         34  |  -.1085503   .0520747    -2.08   0.041    -.2124101   -.0046905
         35  |  -.0620428   .0342786    -1.81   0.075    -.1304093    .0063236
             |
       _cons |   .0489217   .0354143     1.38   0.172    -.0217098    .1195532
------------------------------------------------------------------------------

. reg mame group1 group3     stats_brw topic_brw   t2 t3 i.mdegree   [aw=1/nmodel],  
> cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1419
                                                Root MSE          =     .06569

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
        mame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0439889   .0237049    -1.86   0.068    -.0912669    .0032891
      group3 |   .0120228    .010458     1.15   0.254     -.008835    .0328805
   stats_brw |   .0444469   .0295108     1.51   0.137    -.0144106    .1033043
   topic_brw |  -.0575368   .0332454    -1.73   0.088    -.1238426     .008769
          t2 |   .0144644   .0094566     1.53   0.131    -.0043961     .033325
          t3 |   .0055907   .0162599     0.34   0.732    -.0268387    .0380201
             |
     mdegree |
          2  |  -.1100987   .0464697    -2.37   0.021    -.2027797   -.0174178
          3  |  -.1039305    .043911    -2.37   0.021    -.1915083   -.0163527
          4  |  -.1106848   .0470338    -2.35   0.021    -.2044907   -.0168789
          5  |  -.0607248   .0506607    -1.20   0.235    -.1617645    .0403149
          6  |  -.1369298    .048522    -2.82   0.006    -.2337039   -.0401557
         20  |  -.1108542   .0562073    -1.97   0.053    -.2229562    .0012478
         30  |  -.0960836   .0473132    -2.03   0.046    -.1904469   -.0017203
         31  |   -.096217   .0491486    -1.96   0.054    -.1942408    .0018069
         32  |  -.1073792   .0420261    -2.56   0.013    -.1911977   -.0235608
         33  |  -.0629944   .0468224    -1.35   0.183    -.1563788      .03039
         34  |  -.1368625   .0548231    -2.50   0.015    -.2462037   -.0275212
         35  |  -.0992978   .0385809    -2.57   0.012     -.176245   -.0223505
             |
       _cons |   .0872983   .0422437     2.07   0.042     .0030459    .1715508
------------------------------------------------------------------------------

. reg mame proindex     stats_brw topic_brw   t2 t3 i.mdegree  [aw=meanpeer/nmodel], 
>  cluster(teamid);
(sum of wgt is 299.6499427551315)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1154
                                                Root MSE          =     .06573

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
        mame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0091704   .0043794     2.09   0.040     .0004359    .0179049
   stats_brw |   .0538404   .0331388     1.62   0.109    -.0122528    .1199336
   topic_brw |  -.0571971   .0360469    -1.59   0.117    -.1290905    .0146962
          t2 |   .0223079   .0101115     2.21   0.031     .0021412    .0424746
          t3 |   .0051897   .0174005     0.30   0.766    -.0295145    .0398939
             |
     mdegree |
          2  |  -.0866511   .0442485    -1.96   0.054     -.174902    .0015999
          3  |  -.0973058   .0450048    -2.16   0.034    -.1870651   -.0075466
          4  |  -.1012309    .046902    -2.16   0.034    -.1947741   -.0076878
          5  |  -.0505335   .0502737    -1.01   0.318    -.1508012    .0497342
          6  |  -.1275411   .0505885    -2.52   0.014    -.2284366   -.0266456
         20  |  -.1045654   .0567133    -1.84   0.069    -.2176765    .0085457
         30  |  -.0890461   .0443102    -2.01   0.048    -.1774201   -.0006721
         31  |  -.0885396   .0475826    -1.86   0.067      -.18344    .0063608
         32  |  -.0975953   .0427031    -2.29   0.025     -.182764   -.0124267
         33  |  -.0930857   .0507212    -1.84   0.071    -.1942458    .0080745
         34  |  -.1217736   .0536448    -2.27   0.026    -.2287647   -.0147825
         35  |  -.0791202   .0358245    -2.21   0.030    -.1505698   -.0076705
             |
       _cons |   .0377487   .0369337     1.02   0.310    -.0359132    .1114106
------------------------------------------------------------------------------

. reg mame dindex     stats_brw topic_brw   t2 t3 i.mdegree  [aw=meanpeer/nmodel],  c
> luster(teamid);
(sum of wgt is 299.6499427551315)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1269
                                                Root MSE          =      .0653

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
        mame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0267389   .0121271     2.20   0.031     .0025522    .0509256
   stats_brw |   .0522823   .0312854     1.67   0.099    -.0101145    .1146792
   topic_brw |  -.0554734   .0335539    -1.65   0.103    -.1223945    .0114477
          t2 |   .0179745   .0090315     1.99   0.050    -.0000382    .0359872
          t3 |   .0058182   .0164884     0.35   0.725    -.0270668    .0387033
             |
     mdegree |
          2  |  -.0754292   .0408186    -1.85   0.069    -.1568393    .0059809
          3  |  -.0908359   .0447323    -2.03   0.046    -.1800517   -.0016202
          4  |  -.0924813   .0466754    -1.98   0.051    -.1855724    .0006097
          5  |  -.0444762   .0483151    -0.92   0.360    -.1408377    .0518852
          6  |   -.116472   .0472866    -2.46   0.016    -.2107821   -.0221619
         20  |  -.0976096   .0591587    -1.65   0.103    -.2155978    .0203787
         30  |  -.0781484   .0465635    -1.68   0.098    -.1710163    .0147196
         31  |  -.0808883   .0482255    -1.68   0.098     -.177071    .0152945
         32  |  -.0911731   .0426609    -2.14   0.036    -.1762575   -.0060886
         33  |  -.0764071   .0475041    -1.61   0.112     -.171151    .0183368
         34  |  -.1123111   .0518563    -2.17   0.034    -.2157353   -.0088869
         35  |  -.0631546   .0339955    -1.86   0.067    -.1309565    .0046473
             |
       _cons |   .0543414   .0360841     1.51   0.137    -.0176261     .126309
------------------------------------------------------------------------------

. reg mame group1 group3     stats_brw topic_brw   t2 t3 i.mdegree  [aw=meanpeer/nmod
> el],  cluster(teamid);
(sum of wgt is 299.6499427551315)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1576
                                                Root MSE          =     .06417

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
        mame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0474615    .026128    -1.82   0.074    -.0995722    .0046491
      group3 |   .0126501   .0099912     1.27   0.210    -.0072768    .0325769
   stats_brw |   .0479252   .0295257     1.62   0.109    -.0109621    .1068124
   topic_brw |  -.0590708   .0335124    -1.76   0.082    -.1259092    .0077677
          t2 |   .0132642   .0095807     1.38   0.171    -.0058439    .0323722
          t3 |   .0024887   .0170032     0.15   0.884    -.0314231    .0364005
             |
     mdegree |
          2  |  -.1179623   .0492716    -2.39   0.019    -.2162313   -.0196932
          3  |  -.1126601   .0463723    -2.43   0.018    -.2051468   -.0201734
          4  |  -.1177635   .0492511    -2.39   0.019    -.2159918   -.0195352
          5  |  -.0671763   .0513704    -1.31   0.195    -.1696312    .0352786
          6  |  -.1451775   .0515351    -2.82   0.006     -.247961    -.042394
         20  |  -.1229304   .0570684    -2.15   0.035    -.2367498    -.009111
         30  |   -.102106   .0485557    -2.10   0.039    -.1989473   -.0052647
         31  |  -.1025043   .0502074    -2.04   0.045    -.2026398   -.0023688
         32  |  -.1111252   .0425979    -2.61   0.011     -.196084   -.0261665
         33  |  -.0650779   .0462074    -1.41   0.163    -.1572357    .0270799
         34  |  -.1420634   .0557755    -2.55   0.013    -.2533042   -.0308226
         35  |  -.1028414   .0397187    -2.59   0.012    -.1820579   -.0236249
             |
       _cons |   .0951567    .045291     2.10   0.039     .0048266    .1854868
------------------------------------------------------------------------------

. *REGRESSIONS ON "RESIDUAL" OF AME AFTER TAKING ACCOUNT OF ENDOGENOUS SPECIFICATION 
> SELECTION;
. gen residual=ame-mame;

. reg residual proindex     stats_brw topic_brw   t2 t3 i.mdegree   [aw=1/nmodel],  c
> luster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0407
                                                Root MSE          =     .19006

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
    residual | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0036598   .0034764     1.05   0.296    -.0032736    .0105932
   stats_brw |   .0408364   .0179687     2.27   0.026     .0049989    .0766738
   topic_brw |  -.0738542    .030249    -2.44   0.017    -.1341838   -.0135246
          t2 |  -.0128949   .0139203    -0.93   0.357    -.0406581    .0148683
          t3 |   .0052314    .016343     0.32   0.750    -.0273638    .0378266
             |
     mdegree |
          2  |  -.1007456   .0235027    -4.29   0.000    -.1476202   -.0538711
          3  |   -.094264   .0229672    -4.10   0.000    -.1400706   -.0484574
          4  |  -.0900571   .0238981    -3.77   0.000    -.1377204   -.0423939
          5  |  -.0895824   .0406268    -2.21   0.031      -.17061   -.0085548
          6  |  -.0864463   .0294601    -2.93   0.005    -.1452025     -.02769
         20  |  -.0872207   .0299666    -2.91   0.005    -.1469873   -.0274542
         30  |  -.3761981   .0272093   -13.83   0.000    -.4304654   -.3219308
         31  |  -.0968681   .0317588    -3.05   0.003     -.160209   -.0335272
         32  |  -.0960378   .0268313    -3.58   0.001     -.149551   -.0425245
         33  |  -.0950978   .0293239    -3.24   0.002    -.1535825   -.0366131
         34  |  -.1542302   .0628472    -2.45   0.017    -.2795751   -.0288853
         35  |  -.0739514   .0229638    -3.22   0.002    -.1197513   -.0281515
             |
       _cons |   .0808719   .0225953     3.58   0.001     .0358071    .1259367
------------------------------------------------------------------------------

. reg residual dindex     stats_brw topic_brw   t2 t3 i.mdegree   [aw=1/nmodel],  clu
> ster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0419
                                                Root MSE          =     .18994

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
    residual | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0174982   .0097947     1.79   0.078    -.0020368    .0370331
   stats_brw |   .0387502   .0167289     2.32   0.023     .0053855     .072115
   topic_brw |  -.0714418   .0304187    -2.35   0.022      -.13211   -.0107736
          t2 |   -.015584   .0138864    -1.12   0.266    -.0432795    .0121115
          t3 |    .005678   .0162385     0.35   0.728    -.0267086    .0380647
             |
     mdegree |
          2  |  -.0943289   .0224238    -4.21   0.000    -.1390519    -.049606
          3  |  -.0947603   .0223058    -4.25   0.000    -.1392478   -.0502728
          4  |  -.0893193   .0237438    -3.76   0.000    -.1366748   -.0419639
          5  |  -.0864095   .0410247    -2.11   0.039    -.1682306   -.0045885
          6  |  -.0831659    .031363    -2.65   0.010    -.1457175   -.0206144
         20  |  -.0873675   .0288423    -3.03   0.003    -.1448917   -.0298432
         30  |  -.3774037   .0269563   -14.00   0.000    -.4311664    -.323641
         31  |   -.095745   .0309754    -3.09   0.003    -.1575236   -.0339665
         32  |  -.0956122   .0254312    -3.76   0.000    -.1463331   -.0448913
         33  |  -.0867648   .0282809    -3.07   0.003    -.1431693   -.0303603
         34  |  -.1521913   .0579109    -2.63   0.011     -.267691   -.0366916
         35  |  -.0665537   .0224153    -2.97   0.004    -.1112597   -.0218477
             |
       _cons |   .0858727   .0186521     4.60   0.000     .0486723    .1230732
------------------------------------------------------------------------------

. reg residual group1 group3     stats_brw topic_brw   t2 t3 i.mdegree   [aw=1/nmodel
> ],  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0420
                                                Root MSE          =     .19001

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
    residual | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0085631   .0141619    -0.60   0.547    -.0368081     .019682
      group3 |    .014979   .0119403     1.25   0.214    -.0088352    .0387931
   stats_brw |   .0380488   .0168251     2.26   0.027     .0044921    .0716055
   topic_brw |  -.0721288   .0305672    -2.36   0.021    -.1330931   -.0111644
          t2 |  -.0163745   .0137252    -1.19   0.237    -.0437486    .0109996
          t3 |   .0050928   .0157757     0.32   0.748    -.0263708    .0365564
             |
     mdegree |
          2  |  -.1021089   .0258654    -3.95   0.000    -.1536958   -.0505221
          3  |  -.0988501   .0227933    -4.34   0.000    -.1443099   -.0533903
          4  |   -.094014   .0241287    -3.90   0.000    -.1421371   -.0458909
          5  |  -.0907969   .0384384    -2.36   0.021    -.1674599   -.0141339
          6  |  -.0885414   .0309957    -2.86   0.006    -.1503603   -.0267225
         20  |  -.0922187   .0294318    -3.13   0.003    -.1509185   -.0335188
         30  |  -.3818614   .0278846   -13.69   0.000    -.4374754   -.3262474
         31  |  -.0998411   .0323277    -3.09   0.003    -.1643166   -.0353656
         32  |  -.0993286   .0265003    -3.75   0.000    -.1521818   -.0464754
         33  |  -.0848617   .0281739    -3.01   0.004    -.1410529   -.0286705
         34  |  -.1577027   .0597783    -2.64   0.010    -.2769267   -.0384787
         35  |  -.0738059   .0272955    -2.70   0.009    -.1282451   -.0193667
             |
       _cons |   .0933433   .0215812     4.33   0.000     .0503009    .1363857
------------------------------------------------------------------------------

. reg residual proindex     stats_brw topic_brw   t2 t3 i.mdegree  [aw=meanpeer/nmode
> l],  cluster(teamid);
(sum of wgt is 299.6499427551315)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0400
                                                Root MSE          =     .18899

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
    residual | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0037971   .0034095     1.11   0.269    -.0030029    .0105971
   stats_brw |   .0426997   .0180602     2.36   0.021     .0066799    .0787195
   topic_brw |  -.0777773   .0309804    -2.51   0.014    -.1395657    -.015989
          t2 |  -.0123994    .013879    -0.89   0.375    -.0400801    .0152814
          t3 |   .0055961   .0157352     0.36   0.723    -.0257868    .0369789
             |
     mdegree |
          2  |  -.1034932   .0236788    -4.37   0.000     -.150719   -.0562674
          3  |   -.094562   .0229421    -4.12   0.000    -.1403187   -.0488053
          4  |  -.0946189   .0240636    -3.93   0.000    -.1426123   -.0466256
          5  |  -.0895617   .0398645    -2.25   0.028     -.169069   -.0100543
          6  |  -.0889698   .0298998    -2.98   0.004     -.148603   -.0293366
         20  |  -.0877087   .0298259    -2.94   0.004    -.1471947   -.0282228
         30  |  -.3780223   .0270006   -14.00   0.000    -.4318733   -.3241714
         31  |  -.1004877   .0313202    -3.21   0.002    -.1629539   -.0380215
         32  |  -.0977258   .0267547    -3.65   0.000    -.1510864   -.0443652
         33  |  -.0975647   .0291538    -3.35   0.001    -.1557102   -.0394193
         34  |  -.1582938    .063486    -2.49   0.015    -.2849127   -.0316749
         35  |  -.0759261   .0227381    -3.34   0.001    -.1212757   -.0305764
             |
       _cons |   .0822991   .0225411     3.65   0.000     .0373423    .1272558
------------------------------------------------------------------------------

. reg residual dindex     stats_brw topic_brw   t2 t3 i.mdegree  [aw=meanpeer/nmodel]
> ,  cluster(teamid);
(sum of wgt is 299.6499427551315)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0413
                                                Root MSE          =     .18886

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
    residual | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0176859   .0096022     1.84   0.070     -.001465    .0368368
   stats_brw |   .0408687   .0169336     2.41   0.018     .0070958    .0746417
   topic_brw |  -.0754987   .0312413    -2.42   0.018    -.1378075     -.01319
          t2 |  -.0149412   .0138431    -1.08   0.284    -.0425504    .0126681
          t3 |   .0063101   .0155728     0.41   0.687    -.0247489    .0373691
             |
     mdegree |
          2  |  -.0972609   .0227549    -4.27   0.000    -.1426441   -.0518778
          3  |   -.095251   .0222394    -4.28   0.000    -.1396061   -.0508958
          4  |  -.0938512   .0239326    -3.92   0.000    -.1415832   -.0461191
          5  |  -.0870534   .0405366    -2.15   0.035    -.1679011   -.0062057
          6  |  -.0860905   .0320711    -2.68   0.009    -.1500544   -.0221266
         20  |  -.0884462   .0292114    -3.03   0.003    -.1467064    -.030186
         30  |  -.3794224   .0266646   -14.23   0.000    -.4326034   -.3262415
         31  |  -.0996309   .0305214    -3.26   0.002    -.1605039   -.0387579
         32  |  -.0977761   .0252844    -3.87   0.000    -.1482042    -.047348
         33  |   -.089643   .0282418    -3.17   0.002    -.1459694   -.0333166
         34  |  -.1566324   .0585159    -2.68   0.009    -.2733387   -.0399261
         35  |  -.0687953   .0222263    -3.10   0.003    -.1131242   -.0244664
             |
       _cons |   .0878919   .0187629     4.68   0.000     .0504703    .1253134
------------------------------------------------------------------------------

. reg residual group1 group3     stats_brw topic_brw   t2 t3 i.mdegree  [aw=meanpeer/
> nmodel],  cluster(teamid);
(sum of wgt is 299.6499427551315)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0414
                                                Root MSE          =     .18893

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
    residual | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0088097   .0141074    -0.62   0.534     -.036946    .0193266
      group3 |   .0150707   .0116568     1.29   0.200     -.008178    .0383195
   stats_brw |     .04006   .0169733     2.36   0.021     .0062078    .0739122
   topic_brw |  -.0761665   .0313489    -2.43   0.018    -.1386898   -.0136431
          t2 |  -.0158155   .0136871    -1.16   0.252    -.0431136    .0114826
          t3 |   .0056921   .0150789     0.38   0.707    -.0243819     .035766
             |
     mdegree |
          2  |  -.1051558   .0261159    -4.03   0.000    -.1572424   -.0530692
          3  |  -.0993019   .0227215    -4.37   0.000    -.1446185   -.0539853
          4  |   -.098544   .0242554    -4.06   0.000    -.1469199    -.050168
          5  |   -.091267   .0380137    -2.40   0.019    -.1670829    -.015451
          6  |  -.0914187   .0316299    -2.89   0.005    -.1545027   -.0283348
         20  |  -.0931462   .0297172    -3.13   0.003    -.1524152   -.0338771
         30  |  -.3838694   .0275661   -13.93   0.000    -.4388483   -.3288905
         31  |  -.1036432   .0320117    -3.24   0.002    -.1674885   -.0397979
         32  |  -.1014796   .0262554    -3.87   0.000    -.1538444   -.0491148
         33  |  -.0875401   .0281057    -3.11   0.003    -.1435951   -.0314851
         34  |   -.162155   .0603749    -2.69   0.009    -.2825688   -.0417411
         35  |  -.0761619   .0269548    -2.83   0.006    -.1299214   -.0224023
             |
       _cons |   .0954679   .0216234     4.42   0.000     .0523413    .1385944
------------------------------------------------------------------------------

. *THIS PRODUCES THE GRAPH SHOWING DISTRIBUTION DIFFERENCES IN PREDICTED AME ACROSS T
> EAMS;
. *twoway (kdensity mame if index==1 [fw=1], kernel(ep) lcolor(red) fcolor(red%2) lwi
> dth(medium) bwidth(.03) )
>         (kdensity mame if index==2 [fw=1],kernel(ep) lcolor(green) fcolor(green%20)
>  lwidth(medium) bwidth(.03) ) 
>         (kdensity mame if index==3 [fw=1], kernel(ep) lcolor(blue) fcolor(blue%2) l
> width(medium) bwidth(.03)) ,
>         legend(pos(6) rows(1)) legend(order(1 "Anti-immigrant teams" 2 "Moderate te
> ams" 3 "Pro-immigrant teams"))
>         saving(/users/ddisk/mi/researcher/hist_pred_ame.gph, replace);
. *THIS SAVES THE GRAPH;
. *twoway (kdensity mame if index==1 [fw=1], kernel(ep) lcolor(red) fcolor(red%2) lwi
> dth(medium) bwidth(.03) )
>         (kdensity mame if index==2 [fw=1],kernel(ep) lcolor(green) fcolor(green%20)
>  lwidth(medium) bwidth(.03) ) 
>         (kdensity mame if index==3 [fw=1], kernel(ep) lcolor(blue) fcolor(blue%2) l
> width(medium) bwidth(.03)) ,
>         legend(pos(6) rows(1)) legend(order(1 "Anti-immigrant teams" 2 "Moderate te
> ams" 3 "Pro-immigrant teams"))
>         saving(/users/ddisk/mi/researcher/hist_pred_ame.gph, replace);
. collapse (mean) ame mame meanpeer meanscore, by(spec);

. log close;
      name:  <unnamed>
       log:  /users/ddisk/mi/researcher/reg_predict.log
  log type:  text
 closed on:   9 Oct 2024, 09:34:38
-------------------------------------------------------------------------------------
