--------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /volumes/ddisk/mi/researcher/reg_predict.log
  log type:  text
 opened on:  25 Sep 2024, 13:24:48

. clear matrix;

. clear mata;

. *USES THE MODEL LEVEL DATA CREATED IN REG_MODEL.DO;
. use "/Volumes/Ddisk/MI/Researcher/model.dta", clear;

. encode dv, gen(dvv);

. drop if ame==.;
(0 observations deleted)

. *DEFINES "SET" AS THE SET OF VARIABLES USED TO SUMMARIZE SPECIFICATION DECISIONS;
. global set scale stock flow  level_cyear allavailable w1996 w2006 w2016;

. *GETS LINEAR PREDICTION OF THE SET;
. *LINEAR PREDICTION IS USELESS AS IT DOESN'T REALLY TAKE ACCOUNT OF INTERACTIONS;
. regress ame $set [aw=model_brw];
(sum of wgt is 560.2422434389591)

      Source |       SS           df       MS      Number of obs   =     1,253
-------------+----------------------------------   F(8, 1244)      =      3.86
       Model |  1.03166787         8  .128958483   Prob > F        =    0.0002
    Residual |  41.6064026     1,244  .033445661   R-squared       =    0.0242
-------------+----------------------------------   Adj R-squared   =    0.0179
       Total |  42.6380705     1,252  .034055967   Root MSE        =    .18288

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       scale |  -.0145209   .0143024    -1.02   0.310    -.0425804    .0135386
       stock |  -.0342599   .0281946    -1.22   0.225    -.0895741    .0210544
        flow |  -.0346967   .0279189    -1.24   0.214    -.0894701    .0200767
 level_cyear |   .0293463   .0141063     2.08   0.038     .0016715    .0570212
allavailable |  -.0144867    .012632    -1.15   0.252     -.039269    .0102957
       w1996 |  -.0346319   .0136314    -2.54   0.011     -.061375   -.0078889
       w2006 |   .0325202   .0227849     1.43   0.154    -.0121808    .0772212
       w2016 |  -.0488368   .0119133    -4.10   0.000    -.0722092   -.0254644
       _cons |    .061073   .0373058     1.64   0.102    -.0121162    .1342622
------------------------------------------------------------------------------

. predict pame;
(option xb assumed; fitted values)

. *THE COLLAPSE BY $SET WEIGHTED BY THE REFEREE SCORE MODEL_BRW PRODUCES SIMILAR RESUL
> TS;
. *THE VARIABLE MAME IS THE MEAN AME BY SPECIFICATION;
. *THE VARIABLE MEANSCORE IS THE MEAN REFEREE SCORE FOR EACH OF THE 58 SPECIFICATIONS;
. collapse (mean) mame=ame pame meanscore=model_brw meanpeer=pscore, 
>         by($set);

. *THE VARIABLE SPEC GIVES THE NUMBER OF THE SPECIFICATION, THERE ARE 58;
. generate spec=_n;

. summ mame spec;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        mame |         58   -.0001524    .1076728    -.37979   .4533333
        spec |         58        29.5    16.88688          1         58

. save /volumes/ddisk/data/junkame.dta, replace;
file /volumes/ddisk/data/junkame.dta saved

. *MERGE MAME WITH THE DATA SET;
. use "/Volumes/Ddisk/MI/Researcher/model.dta";

. encode dv, gen(dvv);

. global set scale stock flow  level_cyear allavailable w1996 w2006 w2016;

.         sort $set;

. merge $set using /volumes/ddisk/data/junkame.dta;
(you are using old merge syntax; see [D] merge for new syntax)
variables scale stock flow level_cyear allavailable w1996 w2006 w2016 do not
    uniquely identify observations in the master data

. *NOTE THAT MODEL_BRW IS THE WRONG SCORE FOR THE 58 MIXED SPECIFICATION;
. *SO WILL USE MEANSCORE INSTEAD;
. *NOTE DIFFERENCE IN R-SQUARED BETWEEN AME AND LINEAR SET OF SPECIFICATION PREDICTION
> S;
. *AND AME AND FULL INTERACTION MODEL;
. reg ame $set;

      Source |       SS           df       MS      Number of obs   =     1,253
-------------+----------------------------------   F(8, 1244)      =      4.40
       Model |  1.19752787         8  .149690984   Prob > F        =    0.0000
    Residual |  42.3590465     1,244   .03405068   R-squared       =    0.0275
-------------+----------------------------------   Adj R-squared   =    0.0212
       Total |  43.5565743     1,252  .034789596   Root MSE        =    .18453

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       scale |   -.010397   .0145524    -0.71   0.475    -.0389469    .0181529
       stock |  -.0373823   .0299044    -1.25   0.212    -.0960509    .0212863
        flow |  -.0348237   .0296142    -1.18   0.240    -.0929231    .0232756
 level_cyear |   .0367591   .0149243     2.46   0.014     .0074795    .0660387
allavailable |  -.0225861   .0132256    -1.71   0.088     -.048533    .0033608
       w1996 |  -.0420884   .0147094    -2.86   0.004    -.0709464   -.0132304
       w2006 |   .0382246   .0235446     1.62   0.105    -.0079669    .0844161
       w2016 |  -.0499874   .0115562    -4.33   0.000    -.0726592   -.0273155
       _cons |   .0671895   .0390879     1.72   0.086    -.0094959    .1438749
------------------------------------------------------------------------------

. areg ame, absorb(spec);

Linear regression, absorbing indicators             Number of obs     =  1,253
Absorbed variable: spec                             No. of categories =     58
                                                    F(0, 1195)        =      .
                                                    Prob > F          =      .
                                                    R-squared         = 0.1481
                                                    Adj R-squared     = 0.1075
                                                    Root MSE          = 0.1762

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |   .0007771    .004978     0.16   0.876    -.0089896    .0105437
------------------------------------------------------------------------------
F test of absorbed indicators: F(57, 1195) = 3.645            Prob > F = 0.000

. *MEANS OF REGRESSORS USED TO SUMMARIZE SPEFICATIONS BY INDEX;
. *THIS CREATES DESCRIPTIVE TABLE OF DIFFERENT SPECIFICATIONS USED BY DIFFERENT BROUPS
> ;
. tabulate index,  sum(scale);

            |          Summary of Scale
      index |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |   .10447761    .3070269         134
          2 |   .12871287    .3352971         404
          3 |   .18041958   .38480574         715
------------+------------------------------------
      Total |    .1556265   .36264562       1,253

. tabulate index, sum(stock);

            |          Summary of Stock
      index |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |   .58208955   .49506599         134
          2 |   .46534653   .49941616         404
          3 |    .4965035   .50033778         715
------------+------------------------------------
      Total |   .49561053   .50018037       1,253

. tabulate index, sum(flow);

            |           Summary of Flow
      index |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |   .41044776   .49376087         134
          2 |   .53217822   .49958217         404
          3 |   .44615385   .49744012         715
------------+------------------------------------
      Total |   .47007183   .49930278       1,253

. tabulate index, sum(level_cyear);

            |       Summary of level_cyear
      index |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |   .13432836   .34228434         134
          2 |   .08415842   .27796948         404
          3 |    .2013986   .40132589         715
------------+------------------------------------
      Total |   .15642458   .36340243       1,253

. tabulate index, sum(allavailable);

            |       Summary of allavailable
      index |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |   .23880597   .42795377         134
          2 |   .56435644   .49645576         404
          3 |   .23356643   .42339565         715
------------+------------------------------------
      Total |   .34078212   .47416147       1,253

. tabulate index, sum(w1996);

            |          Summary of w1996
      index |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |   .91044776   .28661065         134
          2 |   .53465347   .49941616         404
          3 |   .86573427   .34117627         715
------------+------------------------------------
      Total |   .76376696   .42493659       1,253

. tabulate index, sum(w2006);

            |          Summary of w2006
      index |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |           1           0         134
          2 |   .94059406     .236676         404
          3 |   .93846154    .2404836         715
------------+------------------------------------
      Total |   .94573025   .22663967       1,253

. tabulate index, sum(w2016);

            |          Summary of w2016
      index |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |   .73134328   .44492424         134
          2 |   .74752475   .43497105         404
          3 |   .56083916   .49663221         715
------------+------------------------------------
      Total |   .63926576   .48040528       1,253

. *REGRESSIONS ON PREDICTED AME;
. reg mame proindex     stats_brw topic_brw   t2 t3 i.mdegree  [aw=1/nmodel],  cluster
> (teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1068
                                                Root MSE          =     .06696

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
        mame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0082824   .0041628     1.99   0.051      -.00002    .0165849
   stats_brw |   .0496642   .0326605     1.52   0.133    -.0154753    .1148036
   topic_brw |  -.0555859     .03609    -1.54   0.128    -.1275652    .0163935
          t2 |  -.0226561   .0099535    -2.28   0.026    -.0425078   -.0028044
          t3 |  -.0143831   .0166275    -0.87   0.390    -.0475456    .0187793
             |
     mdegree |
          2  |  -.0805201   .0428944    -1.88   0.065    -.1660702    .0050301
          3  |   -.088635   .0415764    -2.13   0.037    -.1715565   -.0057135
          4  |  -.0940582   .0440722    -2.13   0.036    -.1819574    -.006159
          5  |  -.0444534   .0499411    -0.89   0.376    -.1440577    .0551509
          6  |  -.1195669   .0471415    -2.54   0.013    -.2135877   -.0255461
         20  |  -.0922142   .0510284    -1.81   0.075    -.1939872    .0095587
         30  |   -.082707   .0417715    -1.98   0.052    -.1660176    .0006036
         31  |  -.0822381   .0461844    -1.78   0.079      -.17435    .0098738
         32  |   -.094318   .0415553    -2.27   0.026    -.1771975   -.0114385
         33  |   -.088404   .0497395    -1.78   0.080    -.1876063    .0107983
         34  |  -.1172125   .0525613    -2.23   0.029    -.2220427   -.0123824
             |
       _cons |   .0568669   .0420656     1.35   0.181    -.0270302     .140764
------------------------------------------------------------------------------

. reg mame dindex     stats_brw topic_brw   t2 t3 i.mdegree   [aw=1/nmodel],  cluster(
> teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1166
                                                Root MSE          =      .0666

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
        mame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0243069   .0103406     2.35   0.022     .0036832    .0449307
   stats_brw |   .0479325   .0306101     1.57   0.122    -.0131175    .1089825
   topic_brw |  -.0540938   .0334253    -1.62   0.110    -.1207584    .0125708
          t2 |  -.0185754   .0089252    -2.08   0.041    -.0363762   -.0007747
          t3 |  -.0100206   .0156859    -0.64   0.525    -.0413051    .0212639
             |
     mdegree |
          2  |  -.0699982   .0400415    -1.75   0.085    -.1498586    .0098621
          3  |   -.082252   .0418492    -1.97   0.053    -.1657175    .0012135
          4  |  -.0859684   .0445485    -1.93   0.058    -.1748176    .0028807
          5  |   -.037848   .0482009    -0.79   0.435    -.1339817    .0582857
          6  |  -.1087691   .0446004    -2.44   0.017    -.1977219   -.0198164
         20  |  -.0830756   .0522904    -1.59   0.117    -.1873654    .0212143
         30  |  -.0723226   .0448898    -1.61   0.112    -.1618525    .0172073
         31  |  -.0746116   .0472033    -1.58   0.118    -.1687556    .0195325
         32  |  -.0877763   .0419247    -2.09   0.040    -.1713926   -.0041601
         33  |  -.0725153   .0473146    -1.53   0.130    -.1668813    .0218508
         34  |  -.1079827   .0512118    -2.11   0.039    -.2101214   -.0058441
             |
       _cons |   .0673198   .0389692     1.73   0.088    -.0104018    .1450414
------------------------------------------------------------------------------

. reg mame group1 group3     stats_brw topic_brw   t2 t3 i.mdegree   [aw=1/nmodel],  c
> luster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1418
                                                Root MSE          =     .06566

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
        mame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0441096   .0233166    -1.89   0.063     -.090613    .0023938
      group3 |   .0118625   .0088588     1.34   0.185    -.0058059    .0295308
   stats_brw |   .0444146   .0292706     1.52   0.134    -.0139638     .102793
   topic_brw |  -.0575628   .0333577    -1.73   0.089    -.1240927     .008967
          t2 |  -.0144629    .009448    -1.53   0.130    -.0333064    .0043806
          t3 |  -.0088884   .0146204    -0.61   0.545    -.0380479     .020271
             |
     mdegree |
          2  |  -.1101829   .0467713    -2.36   0.021    -.2034653   -.0169005
          3  |  -.1038611   .0435023    -2.39   0.020    -.1906237   -.0170986
          4  |  -.1106371   .0467498    -2.37   0.021    -.2038767   -.0173975
          5  |  -.0607223   .0506285    -1.20   0.234    -.1616978    .0402531
          6  |  -.1369017   .0483631    -2.83   0.006    -.2333588   -.0404447
         20  |  -.1103799   .0514605    -2.14   0.035    -.2130145   -.0077452
         30  |  -.0959828   .0467499    -2.05   0.044    -.1892225   -.0027431
         31  |  -.0961676   .0488812    -1.97   0.053    -.1936581    .0013229
         32  |  -.1073344   .0417815    -2.57   0.012     -.190665   -.0240039
         33  |   -.062919     .04632    -1.36   0.179    -.1553015    .0294634
         34  |  -.1368324   .0546716    -2.50   0.015    -.2458715   -.0277932
             |
       _cons |   .1018328   .0438729     2.32   0.023      .014331    .1893346
------------------------------------------------------------------------------

. reg mame proindex     stats_brw topic_brw   t2 t3 i.mdegree  [aw=meanpeer/nmodel],  
> cluster(teamid);
(sum of wgt is 299.6499427551315)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1152
                                                Root MSE          =     .06571

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
        mame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0090833   .0042703     2.13   0.037     .0005664    .0176002
   stats_brw |   .0536676   .0328187     1.64   0.106    -.0117873    .1191225
   topic_brw |  -.0571422   .0359529    -1.59   0.116    -.1288481    .0145637
          t2 |  -.0222698   .0100595    -2.21   0.030    -.0423329   -.0022067
          t3 |  -.0170986   .0181139    -0.94   0.348    -.0532256    .0190284
             |
     mdegree |
          2  |  -.0863495   .0436866    -1.98   0.052    -.1734797    .0007806
          3  |  -.0968415   .0441156    -2.20   0.031    -.1848273   -.0088557
          4  |  -.1007745   .0460284    -2.19   0.032    -.1925753   -.0089737
          5  |  -.0501839   .0496603    -1.01   0.316    -.1492284    .0488605
          6  |  -.1270549   .0496855    -2.56   0.013    -.2261494   -.0279604
         20  |  -.1026655   .0511299    -2.01   0.049    -.2046409   -.0006901
         30  |  -.0884769   .0432564    -2.05   0.045    -.1747492   -.0022046
         31  |  -.0880999   .0468218    -1.88   0.064     -.181483    .0052831
         32  |  -.0972123    .042077    -2.31   0.024    -.1811322   -.0132924
         33  |  -.0926598   .0499769    -1.85   0.068    -.1923355    .0070159
         34  |  -.1212998   .0528531    -2.30   0.025     -.226712   -.0158876
             |
       _cons |   .0599703     .04135     1.45   0.151    -.0224996    .1424403
------------------------------------------------------------------------------

. reg mame dindex     stats_brw topic_brw   t2 t3 i.mdegree  [aw=meanpeer/nmodel],  cl
> uster(teamid);
(sum of wgt is 299.6499427551315)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1257
                                                Root MSE          =     .06532

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
        mame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0256396   .0109384     2.34   0.022     .0038236    .0474556
   stats_brw |   .0519515   .0309025     1.68   0.097    -.0096815    .1135845
   topic_brw |  -.0554775    .033524    -1.65   0.102    -.1223391     .011384
          t2 |  -.0180323   .0089929    -2.01   0.049    -.0359681   -.0000965
          t3 |  -.0123077   .0169493    -0.73   0.470     -.046112    .0214966
             |
     mdegree |
          2  |  -.0750291   .0403544    -1.86   0.067    -.1555135    .0054552
          3  |  -.0895664   .0433049    -2.07   0.042    -.1759352   -.0031976
          4  |  -.0913226   .0453611    -2.01   0.048    -.1817925   -.0008527
          5  |  -.0437188   .0475629    -0.92   0.361    -.1385799    .0511424
          6  |    -.11537   .0461047    -2.50   0.015     -.207323    -.023417
         20  |  -.0926117   .0514966    -1.80   0.076    -.1953185     .010095
         30  |  -.0765463   .0449027    -1.70   0.093    -.1661019    .0130093
         31  |  -.0797822   .0471146    -1.69   0.095    -.1737493    .0141849
         32  |  -.0901571   .0416985    -2.16   0.034    -.1733221   -.0069922
         33  |  -.0757809   .0468593    -1.62   0.110    -.1692389    .0176771
         34  |  -.1111648   .0507751    -2.19   0.032    -.2124326    -.009897
             |
       _cons |   .0719253   .0396502     1.81   0.074    -.0071545     .151005
------------------------------------------------------------------------------

. reg mame group1 group3     stats_brw topic_brw   t2 t3 i.mdegree  [aw=meanpeer/nmode
> l],  cluster(teamid);
(sum of wgt is 299.6499427551315)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1573
                                                Root MSE          =     .06415

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
        mame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0479064   .0258487    -1.85   0.068    -.0994599    .0036471
      group3 |   .0120649   .0083998     1.44   0.155    -.0046879    .0288177
   stats_brw |    .047748   .0291451     1.64   0.106    -.0103802    .1058761
   topic_brw |  -.0591062   .0335578    -1.76   0.083     -.126035    .0078226
          t2 |  -.0132439   .0095531    -1.39   0.170    -.0322968    .0058091
          t3 |   -.010825   .0153022    -0.71   0.482    -.0413443    .0196943
             |
     mdegree |
          2  |   -.118196   .0495304    -2.39   0.020    -.2169813   -.0194107
          3  |  -.1123413   .0458597    -2.45   0.017    -.2038055    -.020877
          4  |  -.1175228   .0488465    -2.41   0.019     -.214944   -.0201016
          5  |  -.0670768    .051225    -1.31   0.195    -.1692418    .0350882
          6  |  -.1449923   .0512818    -2.83   0.006    -.2472706    -.042714
         20  |  -.1211075   .0522538    -2.32   0.023    -.2253245   -.0168906
         30  |  -.1016701   .0478604    -2.12   0.037    -.1971247   -.0062156
         31  |  -.1022509   .0498212    -2.05   0.044    -.2016161   -.0028857
         32  |  -.1108934   .0422348    -2.63   0.011     -.195128   -.0266589
         33  |  -.0647136   .0454953    -1.42   0.159    -.1554511    .0260239
         34  |  -.1418697   .0555443    -2.55   0.013    -.2526494     -.03109
             |
       _cons |   .1085982   .0463463     2.34   0.022     .0161634    .2010331
------------------------------------------------------------------------------

. *REGRESSIONS ON "RESIDUAL" OF AME AFTER TAKING ACCOUNT OF ENDOGENOUS SPECIFICATION S
> ELECTION;
. gen residual=ame-mame;

. reg residual proindex     stats_brw topic_brw   t2 t3 i.mdegree   [aw=1/nmodel],  cl
> uster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0404
                                                Root MSE          =     .19002

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
    residual | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0033569   .0034816     0.96   0.338    -.0035869    .0103007
   stats_brw |   .0403754   .0180878     2.23   0.029     .0043004    .0764503
   topic_brw |  -.0738339    .030329    -2.43   0.017    -.1343232   -.0133446
          t2 |   .0130107   .0138917     0.94   0.352    -.0146955    .0407169
          t3 |   .0181847   .0171063     1.06   0.291    -.0159327    .0523021
             |
     mdegree |
          2  |  -.0998827   .0236538    -4.22   0.000    -.1470586   -.0527068
          3  |  -.0927904   .0230916    -4.02   0.000    -.1388452   -.0467357
          4  |  -.0886371   .0240242    -3.69   0.000    -.1365517   -.0407224
          5  |  -.0885312   .0406374    -2.18   0.033    -.1695799   -.0074825
          6  |  -.0849226   .0296017    -2.87   0.005    -.1439614   -.0258838
         20  |  -.0806488   .0285346    -2.83   0.006    -.1375594   -.0237383
         30  |   -.374364   .0272709   -13.73   0.000     -.428754    -.319974
         31  |  -.0954923   .0318334    -3.00   0.004    -.1589821   -.0320025
         32  |  -.0948431   .0268573    -3.53   0.001    -.1484083   -.0412779
         33  |  -.0938006   .0294226    -3.19   0.002    -.1524822    -.035119
         34  |  -.1527675   .0629734    -2.43   0.018     -.278364   -.0271709
             |
       _cons |   .0678475   .0262654     2.58   0.012     .0154628    .1202321
------------------------------------------------------------------------------

. reg residual dindex     stats_brw topic_brw   t2 t3 i.mdegree   [aw=1/nmodel],  clus
> ter(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0414
                                                Root MSE          =     .18992

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
    residual | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0155183   .0095775     1.62   0.110    -.0035834      .03462
   stats_brw |   .0383951   .0169476     2.27   0.027     .0045942     .072196
   topic_brw |  -.0717005   .0304564    -2.35   0.021    -.1324438   -.0109572
          t2 |   .0154323   .0137955     1.12   0.267    -.0120818    .0429465
          t3 |   .0209831   .0167685     1.25   0.215    -.0124605    .0544268
             |
     mdegree |
          2  |  -.0939239   .0226902    -4.14   0.000    -.1391781   -.0486697
          3  |  -.0927447   .0224956    -4.12   0.000    -.1376108   -.0478787
          4  |  -.0875129   .0239118    -3.66   0.000    -.1352036   -.0398222
          5  |  -.0853892   .0409939    -2.08   0.041     -.167149   -.0036294
          6  |   -.081518    .031238    -2.61   0.011    -.1438202   -.0192159
         20  |  -.0787559    .027908    -2.82   0.006    -.1344165   -.0230952
         30  |  -.3748074   .0269962   -13.88   0.000    -.4286495   -.3209653
         31  |  -.0940462   .0312171    -3.01   0.004    -.1563068   -.0317856
         32  |  -.0940704   .0255975    -3.67   0.000    -.1451231   -.0430178
         33  |  -.0859952   .0284691    -3.02   0.004    -.1427751   -.0292153
         34  |  -.1504811   .0586406    -2.57   0.012    -.2674361   -.0335262
             |
       _cons |   .0699059   .0230845     3.03   0.003     .0238653    .1159466
------------------------------------------------------------------------------

. reg residual group1 group3     stats_brw topic_brw   t2 t3 i.mdegree   [aw=1/nmodel]
> ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0415
                                                Root MSE          =     .18998

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
    residual | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0103574   .0140179    -0.74   0.462    -.0383151    .0176004
      group3 |   .0125962   .0115308     1.09   0.278    -.0104013    .0355937
   stats_brw |   .0375691   .0170476     2.20   0.031     .0035687    .0715695
   topic_brw |   -.072515    .030581    -2.37   0.020    -.1335069   -.0115232
          t2 |    .016398   .0136152     1.20   0.232    -.0107566    .0435526
          t3 |    .021249   .0166772     1.27   0.207    -.0120126    .0545106
             |
     mdegree |
          2  |  -.1033597   .0259043    -3.99   0.000    -.1550242   -.0516952
          3  |  -.0978188   .0229658    -4.26   0.000    -.1436225    -.052015
          4  |  -.0933054    .024262    -3.85   0.000    -.1416944   -.0449163
          5  |  -.0907603   .0383548    -2.37   0.021    -.1672565   -.0142642
          6  |  -.0881238    .030787    -2.86   0.006    -.1495265   -.0267212
         20  |  -.0851672   .0285621    -2.98   0.004    -.1421326   -.0282018
         30  |  -.3803631   .0279392   -13.61   0.000    -.4360861     -.32464
         31  |  -.0991078   .0326032    -3.04   0.003    -.1641327   -.0340828
         32  |  -.0986629   .0265913    -3.71   0.000    -.1516976   -.0456281
         33  |  -.0837419   .0284056    -2.95   0.004    -.1403951   -.0270887
         34  |  -.1572553   .0606242    -2.59   0.012    -.2781665   -.0363441
             |
       _cons |   .0780099   .0252916     3.08   0.003     .0275675    .1284524
------------------------------------------------------------------------------

. reg residual proindex     stats_brw topic_brw   t2 t3 i.mdegree  [aw=meanpeer/nmodel
> ],  cluster(teamid);
(sum of wgt is 299.6499427551315)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0397
                                                Root MSE          =     .18894

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
    residual | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0034858    .003418     1.02   0.311    -.0033313    .0103028
   stats_brw |   .0420817   .0181467     2.32   0.023     .0058893    .0782741
   topic_brw |  -.0775808   .0310565    -2.50   0.015     -.139521   -.0156406
          t2 |   .0125355    .013848     0.91   0.368    -.0150835    .0401545
          t3 |   .0180655   .0169914     1.06   0.291    -.0158228    .0519539
             |
     mdegree |
          2  |  -.1024149   .0237867    -4.31   0.000    -.1498559   -.0549738
          3  |  -.0929015   .0230166    -4.04   0.000    -.1388066   -.0469964
          4  |  -.0929867   .0241383    -3.85   0.000    -.1411291   -.0448443
          5  |  -.0883117   .0398578    -2.22   0.030    -.1678055   -.0088179
          6  |  -.0872314   .0299875    -2.91   0.005    -.1470395   -.0274232
         20  |  -.0809145   .0280378    -2.89   0.005    -.1368343   -.0249948
         30  |  -.3759869   .0270349   -13.91   0.000    -.4299063   -.3220674
         31  |  -.0989154   .0313537    -3.15   0.002    -.1614483   -.0363825
         32  |  -.0963561    .026742    -3.60   0.001    -.1496913   -.0430209
         33  |  -.0960418   .0292073    -3.29   0.002     -.154294   -.0377896
         34  |  -.1565995   .0635954    -2.46   0.016    -.2834366   -.0297623
             |
       _cons |   .0695912   .0262278     2.65   0.010     .0172815    .1219009
------------------------------------------------------------------------------

. reg residual dindex     stats_brw topic_brw   t2 t3 i.mdegree  [aw=meanpeer/nmodel],
>   cluster(teamid);
(sum of wgt is 299.6499427551315)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0407
                                                Root MSE          =     .18884

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
    residual | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0156694   .0093753     1.67   0.099    -.0030291    .0343679
   stats_brw |   .0402619   .0171218     2.35   0.022     .0061135    .0744103
   topic_brw |  -.0755064   .0312814    -2.41   0.018    -.1378953   -.0131175
          t2 |   .0148352   .0137487     1.08   0.284    -.0125857    .0422561
          t3 |   .0209735   .0164969     1.27   0.208    -.0119284    .0538755
             |
     mdegree |
          2  |  -.0965271   .0229856    -4.20   0.000    -.1423704   -.0506838
          3  |  -.0929223   .0223643    -4.15   0.000    -.1375265    -.048318
          4  |  -.0917257   .0240222    -3.82   0.000    -.1396364   -.0438151
          5  |  -.0856641    .040475    -2.12   0.038     -.166389   -.0049392
          6  |  -.0840692   .0318599    -2.64   0.010    -.1476119   -.0205266
         20  |  -.0792788   .0278198    -2.85   0.006    -.1347636    -.023794
         30  |  -.3764838   .0266498   -14.13   0.000     -.429635   -.3233325
         31  |   -.097602   .0307003    -3.18   0.002    -.1588318   -.0363723
         32  |  -.0959126   .0254087    -3.77   0.000    -.1465886   -.0452365
         33  |  -.0884943   .0283849    -3.12   0.003    -.1451061   -.0318825
         34  |  -.1545298   .0592368    -2.61   0.011    -.2726739   -.0363856
             |
       _cons |   .0722341   .0233591     3.09   0.003     .0256458    .1188223
------------------------------------------------------------------------------

. reg residual group1 group3     stats_brw topic_brw   t2 t3 i.mdegree  [aw=meanpeer/n
> model],  cluster(teamid);
(sum of wgt is 299.6499427551315)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0409
                                                Root MSE          =     .18889

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
    residual | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0106481   .0139496    -0.76   0.448    -.0384696    .0171734
      group3 |   .0126522    .011226     1.13   0.264    -.0097375    .0350418
   stats_brw |   .0393276    .017148     2.29   0.025      .005127    .0735282
   topic_brw |  -.0763129   .0313641    -2.43   0.018    -.1388666   -.0137593
          t2 |   .0158995   .0135671     1.17   0.245    -.0111593    .0429583
          t3 |   .0213031   .0164181     1.30   0.199    -.0114418    .0540479
             |
     mdegree |
          2  |  -.1061218   .0261557    -4.06   0.000    -.1582876   -.0539559
          3  |  -.0979844   .0228429    -4.29   0.000    -.1435432   -.0524256
          4  |  -.0975492    .024331    -4.01   0.000    -.1460758   -.0490226
          5  |  -.0908559   .0378855    -2.40   0.019    -.1664161   -.0152956
          6  |  -.0906534   .0313487    -2.89   0.005    -.1531763   -.0281304
         20  |  -.0856125   .0284586    -3.01   0.004    -.1423714   -.0288536
         30  |   -.382068   .0275884   -13.85   0.000    -.4370914   -.3270446
         31  |  -.1025962   .0322632    -3.18   0.002    -.1669431   -.0382492
         32  |  -.1005216   .0263223    -3.82   0.000    -.1530199   -.0480234
         33  |  -.0860344   .0282766    -3.04   0.003    -.1424304   -.0296384
         34  |  -.1613545   .0612291    -2.64   0.010    -.2834721    -.039237
             |
       _cons |   .0803853   .0253921     3.17   0.002     .0297424    .1310283
------------------------------------------------------------------------------

. *THIS PRODUCES THE GRAPH SHOWING DISTRIBUTION DIFFERENCES IN PREDICTED AME ACROSS TE
> AMS;
. *twoway (kdensity mame if index==1 [fw=1], kernel(ep) lcolor(red) fcolor(red%2) lwid
> th(medium) bwidth(.03) )
>         (kdensity mame if index==2 [fw=1],kernel(ep) lcolor(green) fcolor(green%20) 
> lwidth(medium) bwidth(.03) ) 
>         (kdensity mame if index==3 [fw=1], kernel(ep) lcolor(blue) fcolor(blue%2) lw
> idth(medium) bwidth(.03)) ,
>         legend(pos(6) rows(1)) legend(order(1 "Anti-immigrant teams" 2 "Moderate tea
> ms" 3 "Pro-immigrant teams"))
>         saving(/volumes/ddisk/mi/researcher/hist_pred_ame.gph, replace);
. *THIS SAVES THE GRAPH;
. *twoway (kdensity mame if index==1 [fw=1], kernel(ep) lcolor(red) fcolor(red%2) lwid
> th(medium) bwidth(.03) )
>         (kdensity mame if index==2 [fw=1],kernel(ep) lcolor(green) fcolor(green%20) 
> lwidth(medium) bwidth(.03) ) 
>         (kdensity mame if index==3 [fw=1], kernel(ep) lcolor(blue) fcolor(blue%2) lw
> idth(medium) bwidth(.03)) ,
>         legend(pos(6) rows(1)) legend(order(1 "Anti-immigrant teams" 2 "Moderate tea
> ms" 3 "Pro-immigrant teams"))
>         saving(/volumes/ddisk/mi/researcher/hist_pred_ame.gph, replace);
. log close;
      name:  <unnamed>
       log:  /volumes/ddisk/mi/researcher/reg_predict.log
  log type:  text
 closed on:  25 Sep 2024, 13:24:48
--------------------------------------------------------------------------------------
