--------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /volumes/ddisk/mi/researcher/reg_model.log
  log type:  text
 opened on:  10 Oct 2024, 09:17:47

. clear matrix;

. clear mata;

. *USING SIMPLER AND FINAL SPECIFICATION FOR DEGREE INTERACTIONS;
. *THE DATA IN CRI.CSV IS MODEL-LEVEL DATA;
. *THE DATA IN CRI_TEAM.CSV IS TEAM-LEVEL DATA;
. *TEAM LEVEL DATA CONTAINS MORE THAN ONE OBSERVATION PER TEAM FOR A FEW TEAMS, DUE TO
>  STOCK-FLOW DISTINCTION;
. *THIS PROGRAM USES THE MODEL LEVEL DATA;
. /*
> *DEFINITION OF KEY VARIABLES CONSTRUCTED BY BREZNAU-RINKE-WUTTKE (BRW) TEAM;
> - `belief_ipred` - Belief that Hypothesis is true       (that immigration reduces su
> pport), 
>         team average of predicted factor scores
> - `pro_immigrant` - Support laws to better integrate immigrants, team average, singl
> e question
> - `topic_ipred` - Knowledge and experience with the topic of immigration and welfare
>  state preferences, 
>         team average of predicted factor scores
> - `stats_ipred` - Knowledge and experience with quantiative statistical analysis, 
>         team average of predicted factor scores
> - `total_score` - Average score of each model from subjective voting amongst partici
> pants, 
>         each participant reviewed 3 to 4 models
> 
> SOURCE: 04_CRI_MAIN_ANALYSES.RMD
> Listing of variables used in construction of factor scores begins in line 262
> */
> 
> 
> 
> 
> 
> use /volumes/ddisk/mi/researcher/cri.dta, clear;

. generate teamid=u_teamid;

. destring teamid, force replace;
teamid already numeric; no replace

. unique teamid;
Number of unique values of teamid is  73
Number of records is  1309

. rename BELIEF_HYPOTHESIS belief_hypothesis;

. rename TOPIC_KNOWLEDGE topic_knowledge;

. rename STATISTICS_SKILL statistics_skill;

. rename MODEL_SCORE model_score;

. rename AME ame;

. rename DV dv;

. rename Jobs jobs;

. rename Unemp unemp;

. rename IncDiff incdiff;

. rename OldAge oldage;

. rename House house;

. rename Health health;

. rename Scale scale;

. rename Stock stock;

. rename Flow flow;

. rename ChangeFlow changeflow;

. rename belief_H1_11 belief_h1_11;

. rename belief_H1_12 belief_h1_12;

. rename belief_H1_13 belief_h1_13;

. rename Hresult hresult;

. rename Hsupport hsupport;

. rename Hreject hreject;

. rename Hrej hrej;

. rename Hsup hsup;

. rename Hnotest hnotest;

. rename Hmixed hmixed;

. *DROPS TEAMS WITH MISSING ID;
. drop if teamid==.;
(0 observations deleted)

. *DROPS THE BASELINE BRADY-FINNIGAN RESULTS;
. drop if teamid==0;
(48 observations deleted)

. unique teamid;
Number of unique values of teamid is  72
Number of records is  1261

. *SIMPLIFY DATA SET BY DROPPING IRRELEVANT VARIABLES;
. *drop AU-VE;
. *drop emigration_ivC-fbXleftright;
. *AVERAGE MARGINAL EFFECT VARIABLE;
. *START WITH 1253 MODELS WITH NON-MISSING AME;
. destring ame, replace force;
ame: contains nonnumeric characters; replaced as double
(8 missing values generated)

. drop if ame==.;
(8 observations deleted)

. summ ame;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |      1,253    .0007771    .1865197  -1.353765       2.47

. *TEAM 1 DOES NOT REPORT AN AME, SO WILL BE DELETED;
. list teamid if ame==.;

. drop if teamid==1;
(0 observations deleted)

. unique teamid;
Number of unique values of teamid is  71
Number of records is  1253

. *NUMBER OF MODELS PER TEAM;
. egen nmodel=count(ame), by(teamid);

. tabulate nmodel;

     nmodel |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          2        0.16        0.16
          2 |         10        0.80        0.96
          3 |          9        0.72        1.68
          4 |         20        1.60        3.27
          6 |         30        2.39        5.67
          8 |         40        3.19        8.86
         10 |         20        1.60       10.45
         12 |        216       17.24       27.69
         14 |         14        1.12       28.81
         16 |         64        5.11       33.92
         18 |         18        1.44       35.36
         20 |         40        3.19       38.55
         24 |        144       11.49       50.04
         32 |         64        5.11       55.15
         36 |        108        8.62       63.77
         48 |        192       15.32       79.09
         54 |         54        4.31       83.40
         96 |         96        7.66       91.06
        112 |        112        8.94      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. *TEAM SIZE;
. *TEAM 93 HAS TEAM SIZE MISCODED;
. replace team_size=3 if teamid==93;
(20 real changes made)

. tabulate team_size;

  team_size |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        277       22.11       22.11
          2 |        379       30.25       52.35
          3 |        597       47.65      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. generate t2=(team_size==2);

. generate t3=(team_size==3);

. unique teamid if team_size==1;
Number of unique values of teamid is  14
Number of records is  277

. unique teamid if team_size==2;
Number of unique values of teamid is  26
Number of records is  379

. unique teamid if team_size==3;
Number of unique values of teamid is  31
Number of records is  597

. *PERCENT MEN IN TEAM;
. destring v_1101, force gen(v1101);
v_1101: contains nonnumeric characters; v1101 generated as byte
(126 missing values generated)

. destring v_1102, force gen(v1102);
v_1102: contains nonnumeric characters; v1102 generated as byte
(704 missing values generated)

. destring v_1103, force gen(v1103);
v_1103: contains nonnumeric characters; v1103 generated as byte
(301 missing values generated)

. tabulate v1101, missing;

     v_1101 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        839       66.96       66.96
          2 |        288       22.98       89.94
          . |        126       10.06      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. tabulate v1102, missing;

     v_1102 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        275       21.95       21.95
          2 |        274       21.87       43.81
          . |        704       56.19      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. tabulate v1103, missing;

     v_1103 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        498       39.74       39.74
          2 |        454       36.23       75.98
          . |        301       24.02      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. *TEAM 27 IS MISSING GENDER;
. list team_size backgr_degree1 backgr_degree2 backgr_degree3 if teamid==27;

      +-------------------------------------------+
      | team_s~e   backg~e1   backg~e2   backg~e3 |
      |-------------------------------------------|
 206. |        1          4         NA         NA |
 207. |        1          4         NA         NA |
 208. |        1          4         NA         NA |
 209. |        1          4         NA         NA |
 210. |        1          4         NA         NA |
      |-------------------------------------------|
 211. |        1          4         NA         NA |
 212. |        1          4         NA         NA |
 213. |        1          4         NA         NA |
 214. |        1          4         NA         NA |
 215. |        1          4         NA         NA |
      |-------------------------------------------|
 216. |        1          4         NA         NA |
 217. |        1          4         NA         NA |
      +-------------------------------------------+

. list v1101 v1102 v1103 if teamid==27;

      +-----------------------+
      | v1101   v1102   v1103 |
      |-----------------------|
 206. |     .       .       . |
 207. |     .       .       . |
 208. |     .       .       . |
 209. |     .       .       . |
 210. |     .       .       . |
      |-----------------------|
 211. |     .       .       . |
 212. |     .       .       . |
 213. |     .       .       . |
 214. |     .       .       . |
 215. |     .       .       . |
      |-----------------------|
 216. |     .       .       . |
 217. |     .       .       . |
      +-----------------------+

. *WILL USE HOT DECK IMPUTATION TO FILL IN THE GENDER OF THAT OBSERVATION;
. *TEAM 27 IS A ONE PERSON TEAM WITH A DEGREE IN FIELD 4;
. *TEAM LEVEL DATA SHOWS THAT 3 OTHER TEAMS (83, 87, 96) WITH SAME CHARACTERISTICS;
. *THOSE 3 TEAMS ARE 2 MEN AND ONE WOMEN;
. *WILL ASSIGN PMALE = .67 FOR TEAM 27;
. generate nmale=(v1101==1) + (v1102==1) + (v1103==1);

. generate team=(v1101~=.) + (v1102~=.) + (v1103~=.);

. generate pmale=nmale/team;
(12 missing values generated)

. replace pmale=.6666667 if teamid==27;
(12 real changes made)

. tabulate pmale;

      pmale |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        218       17.40       17.40
   .3333333 |        251       20.03       37.43
         .5 |         99        7.90       45.33
   .6666667 |        111        8.86       54.19
          1 |        574       45.81      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. *T-STATISTIC OF ESTIMATED AME AND IMPLIED STANDARD ERROR AT MODEL LEVEL;
. destring z, force replace;
z: contains nonnumeric characters; replaced as double
(1 missing value generated)

. generate oldz=z;
(1 missing value generated)

. replace z=abs(z);
(686 real changes made)

. gen std=abs(ame/z);
(3 missing values generated)

. summ ame z;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |      1,253    .0007771    .1865197  -1.353765       2.47
           z |      1,252    2.132401    3.242033          0   49.35065

. *FIELD OF HIGHEST DEGREE OF TEAM;
. tabulate backgr_degree1;

backgr_degr |
        ee1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         12        0.96        0.96
          2 |         90        7.18        8.14
          3 |        691       55.15       63.29
          4 |        330       26.34       89.62
          5 |         58        4.63       94.25
          6 |         36        2.87       97.13
          7 |         16        1.28       98.40
         NA |         20        1.60      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. destring backgr_degree1, force gen(degree1);
backgr_degree1: contains nonnumeric characters; degree1 generated as byte
(20 missing values generated)

. destring backgr_degree2, force gen(degree2);
backgr_degree2: contains nonnumeric characters; degree2 generated as byte
(676 missing values generated)

. destring backgr_degree3, force gen(degree3);
backgr_degree3: contains nonnumeric characters; degree3 generated as byte
(289 missing values generated)

. tabulate backgr_degree1 degree1;

backgr_deg |                     backgr_degree1
      ree1 |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
         1 |        12          0          0          0          0 |        12 
         2 |         0         90          0          0          0 |        90 
         3 |         0          0        691          0          0 |       691 
         4 |         0          0          0        330          0 |       330 
         5 |         0          0          0          0         58 |        58 
         6 |         0          0          0          0          0 |        36 
         7 |         0          0          0          0          0 |        16 
-----------+-------------------------------------------------------+----------
     Total |        12         90        691        330         58 |     1,233 


backgr_deg |    backgr_degree1
      ree1 |         6          7 |     Total
-----------+----------------------+----------
         1 |         0          0 |        12 
         2 |         0          0 |        90 
         3 |         0          0 |       691 
         4 |         0          0 |       330 
         5 |         0          0 |        58 
         6 |        36          0 |        36 
         7 |         0         16 |        16 
-----------+----------------------+----------
     Total |        36         16 |     1,233 

. summ degree1 degree2 degree3;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     degree1 |      1,233    3.408759    .9336709          1          7
     degree2 |        577    3.102253    .9023186          1          5
     degree3 |        964    3.525934    .8064844          3          6

. generate d1=degree1;
(20 missing values generated)

. generate d2=degree2;
(676 missing values generated)

. generate d3=degree3;
(289 missing values generated)

. replace d1=0 if d1==.;
(20 real changes made)

. replace d2=0 if d2==.;
(676 real changes made)

. replace d3=0 if d3==.;
(289 real changes made)

. generate counter=d1*100 + d2*10 + d3;

. generate counter2=team_size*1000 + counter;

. summ d1-d3 counter counter2;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
          d1 |      1,253     3.35435    1.020034          0          7
          d2 |      1,253    1.428571    1.663568          0          5
          d3 |      1,253     2.71269    1.645637          0          6
     counter |      1,253    352.4334    102.8099          5        703
    counter2 |      1,253     2607.82    798.5261       1100       3654

. tabulate counter2;

   counter2 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1100 |         12        0.96        0.96
       1200 |         24        1.92        2.87
       1300 |         71        5.67        8.54
       1400 |        132       10.53       19.07
       1500 |         26        2.08       21.15
       1600 |         12        0.96       22.11
       2204 |         48        3.83       25.94
       2303 |        182       14.53       40.46
       2306 |          9        0.72       41.18
       2400 |         12        0.96       42.14
       2404 |         88        7.02       49.16
       2504 |          6        0.48       49.64
       2505 |         14        1.12       50.76
       2606 |          4        0.32       51.08
       2703 |         16        1.28       52.35
       3005 |         20        1.60       53.95
       3244 |         18        1.44       55.39
       3323 |         32        2.55       57.94
       3333 |        284       22.67       80.61
       3336 |         36        2.87       83.48
       3343 |         53        4.23       87.71
       3344 |         24        1.92       89.62
       3414 |         48        3.83       93.46
       3433 |         22        1.76       95.21
       3443 |         12        0.96       96.17
       3444 |         16        1.28       97.45
       3555 |         12        0.96       98.40
       3654 |         20        1.60      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. *SIZE OF TEAM THAT PROVIDES A DEGREE, NOT EQUAL TO TEAM_SIZE BECAUSE OF MISSING INFO
> ;
. replace team=(degree1~=.) + (degree2~=.) + (degree3~=.);
(162 real changes made)

. *THESE ARE THE EXCLUSIVE DISCIPLINES;
. generate mdegree=1 if counter2==1100;
(1,241 missing values generated)

. replace mdegree=2 if counter2==1200;
(24 real changes made)

. replace mdegree=3 if counter2==1300 | counter2==2303 | counter2==3333;
(537 real changes made)

. replace mdegree=4 if counter2==1400 | counter2==2400 | counter2==2404 | counter2==34
> 44;
(248 real changes made)

. replace mdegree=5 if counter2==1500 | counter2==2505 | counter2==3555;
(52 real changes made)

. replace mdegree=6 if counter2==1600 | counter2==2606;
(16 real changes made)

. *ALL MIXED DEGREES FOR ACTUAL TEAM SIZE 2;
. replace mdegree=20 if (team==2 & mdegree==.) ;
(79 real changes made)

. tabulate counter2 if mdegree==20;

   counter2 |      Freq.     Percent        Cum.
------------+-----------------------------------
       2204 |         48       60.76       60.76
       2306 |          9       11.39       72.15
       2504 |          6        7.59       79.75
       2703 |         16       20.25      100.00
------------+-----------------------------------
      Total |         79      100.00

. *NOW BREAK UP TEAM SIZE 3 INTO 4 CATEGORIES;
. replace mdegree=31 if (counter2==3323 | counter2==3336
>         | counter2==3343);
(121 real changes made)

. replace mdegree=32 if (counter2==3244 
>         | counter2==3414 | counter2==3443);
(78 real changes made)

. *THE FOLLOWING 2 CATEGORIES USE DIFFERENT LEAD AUTHOR IN SOCIO OR POLI SCI TO CLASSI
> FY;
. *ALSO SEPARATES OUT STRANGE TEAM WITH 3 DISTINCT FIELDS;
. replace mdegree=33 if (counter2==3344 );
(24 real changes made)

. replace mdegree=34 if (counter2==3433);
(22 real changes made)

. replace mdegree=35 if (counter2==3654);
(20 real changes made)

. tabulate counter2 if team==3 & mdegree==.;
no observations

. tabulate counter2 if team_size==3 & mdegree==.;

   counter2 |      Freq.     Percent        Cum.
------------+-----------------------------------
       3005 |         20      100.00      100.00
------------+-----------------------------------
      Total |         20      100.00

. replace mdegree=30 if team_size==3 & mdegree==.;
(20 real changes made)

. tabulate counter2 if mdegree==30, missing;

   counter2 |      Freq.     Percent        Cum.
------------+-----------------------------------
       3005 |         20      100.00      100.00
------------+-----------------------------------
      Total |         20      100.00

. tabulate counter2, sum(mdegree);

            |         Summary of mdegree
   counter2 |        Mean   Std. dev.       Freq.
------------+------------------------------------
       1100 |           1           0          12
       1200 |           2           0          24
       1300 |           3           0          71
       1400 |           4           0         132
       1500 |           5           0          26
       1600 |           6           0          12
       2204 |          20           0          48
       2303 |           3           0         182
       2306 |          20           0           9
       2400 |           4           0          12
       2404 |           4           0          88
       2504 |          20           0           6
       2505 |           5           0          14
       2606 |           6           0           4
       2703 |          20           0          16
       3005 |          30           0          20
       3244 |          32           0          18
       3323 |          31           0          32
       3333 |           3           0         284
       3336 |          31           0          36
       3343 |          31           0          53
       3344 |          33           0          24
       3414 |          32           0          48
       3433 |          34           0          22
       3443 |          32           0          12
       3444 |           4           0          16
       3555 |           5           0          12
       3654 |          35           0          20
------------+------------------------------------
      Total |   10.922586   12.093865       1,253

. *PRO-IMMIGRATION INDEX USES THE VARIABLE MEASURING THE GENERAL ATTITUDE TOWARDS IMMI
> GRATION, ATTITUDE_IMMIGRATION_11;
. *A VARIABLE COLLECTED IN THE FIRST WAVE QUESTIONNAIRE;
. *THE VARIABLE pro_immigrant in lower case IS THE MEAN OF THE INDEX WITHIN A TEAM;
. *THE PRO_IMMIGRANT VARIABLE IN UPPER CASE ONLY HAS 3 VALUES AS COMPARED TO MORE THAN
>  6 FOR THE pro_immigrant VARIABLE;
. *HIGHER VALUES OF PRO_IMMIGRANT INDICATE THAT IMMIGRATION LAWS SHOULD BE RELAXED, MO
> RE IMMIGRATION;
. *NOTE THAT ATTITUDE_IMMIGRATION_11 IS IN REVERSE ORDER;
. tabulate pro_immigrant attitude_immigration_11 if team_size==1;

                 |                attitude_immigration_11
   pro_immigrant |         1          2          3          4          5 |     Total
-----------------+-------------------------------------------------------+----------
               1 |         0          0          0          0          0 |        30 
               2 |         0          0          0          0         12 |        12 
               3 |         0          0          0         36          0 |        36 
               4 |         0          0         14          0          0 |        14 
               5 |         0         62          0          0          0 |        62 
               6 |       123          0          0          0          0 |       123 
-----------------+-------------------------------------------------------+----------
           Total |       123         62         14         36         12 |       277 


                 | attitude_i
                 | mmigration
                 |    _11
   pro_immigrant |         6 |     Total
-----------------+-----------+----------
               1 |        30 |        30 
               2 |         0 |        12 
               3 |         0 |        36 
               4 |         0 |        14 
               5 |         0 |        62 
               6 |         0 |       123 
-----------------+-----------+----------
           Total |        30 |       277 

. rename PRO_IMMIGRANT pro;

. generate proindex=pro_immigrant;

. destring proindex, force replace;
proindex: all characters numeric; replaced as double

. tabulate proindex pro, missing;

           |          PRO_IMMIGRANT
  proindex |      High        Low        Mid |     Total
-----------+---------------------------------+----------
         1 |         0         30          0 |        30 
         2 |         0         24          0 |        24 
  2.333333 |         0         12          0 |        12 
  2.666667 |         0         24          0 |        24 
         3 |         0         48          0 |        48 
  3.333333 |         0          0         20 |        20 
       3.5 |         0          0         80 |        80 
  3.666667 |         0          0        128 |       128 
         4 |         0          0         74 |        74 
  4.333333 |         0          0        160 |       160 
       4.5 |         0          0         98 |        98 
  4.666667 |        52          0          0 |        52 
         5 |       144          0          0 |       144 
  5.333333 |        28          0          0 |        28 
       5.5 |       122          0          0 |       122 
  5.666667 |        18          0          0 |        18 
         6 |       191          0          0 |       191 
-----------+---------------------------------+----------
     Total |       555        138        560 |     1,253 

. *CREATING PINDEX, PERCENT OF TEAM WITH PRO-IMMIGRATION IDEOLOGY;
. *SIMPLY COUNT NUMBER OF AUTHORS WITH CORRECT CODE IN ATTITUDE VARIABLE, AND DIVIDE B
> Y TEAM SIZE;
. destring attitude_immigration_11, force gen(att1);
attitude_immigration_11: contains nonnumeric characters; att1 generated as byte
(74 missing values generated)

. destring attitude_immigration_12, force gen(att2);
attitude_immigration_12: contains nonnumeric characters; att2 generated as byte
(684 missing values generated)

. destring attitude_immigration_13, force gen(att3);
attitude_immigration_13: contains nonnumeric characters; att3 generated as byte
(289 missing values generated)

. *REVERSE ORDER OF THE ATTITUDE IMMIGRATION VARIABLES TO MAKE THEM CONSISTENT WITH PR
> OINDEX;
. replace att1=7-att1;
(1,179 real changes made)

. replace att2=7-att2;
(569 real changes made)

. replace att3=7-att3;
(964 real changes made)

. *NOT ALL MEMBERS IN TEAM RESPONDED TO THE ATTITUDE_IMMIGRATION VARIABLES;
. *WILL USE ACTUAL NUMBER WHO RESPONDED TO DEFINE INDEX BELOW;
. replace team=(att1~=.) + (att2~=.) + (att3~=.);
(62 real changes made)

. generate npro=(att1>4 & att1~=.) + (att2>4 & att2~=.) + (att3>4 & att3~=.);

. tabulate npro;

       npro |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        338       26.98       26.98
          1 |        545       43.50       70.47
          2 |        312       24.90       95.37
          3 |         58        4.63      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. generate pindex=(npro/team);

. *DINDEX IS THE VARIABLE THAT MEASURES IF AT LEAST HALF OF THE TEAM IS PRO-IMMIGRANT;
. generate dindex=(pindex>=.5);

. summ npro pindex dindex;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        npro |      1,253    1.071828    .8362473          0          3
      pindex |      1,253    .5405693    .4084319          0          1
      dindex |      1,253    .5706305    .4951838          0          1

. generate npro1=(att1==1) + (att2==1) + (att3==1);

. generate npro2=(att1==2) + (att2==2) + (att3==2);

. generate npro3=(att1==3) + (att2==3) + (att3==3);

. generate npro4=(att1==4) + (att2==4) + (att3==4);

. generate npro5=(att1==5) + (att2==5) + (att3==5);

. generate npro6=(att1==6) + (att2==6) + (att3==6);

. *THE Px VARIABLES GIVE % OF TEAM THAT IS IN EACH OF THE CODES;
. generate p1=npro1/team;

. generate p2=npro2/team;

. generate p3=npro3/team;

. generate p4=npro4/team;

. generate p5=npro5/team;

. generate p6=npro6/team;

. *P12 P34 P56 GIVE % OF TEAM THAT IS 1,2 OR 3,4, OR 5,6;
. generate p12=p1+p2;

. generate p34=p3+p4;

. generate p56=p5+p6;

. *NOW DEFINING THE THREE TYPES OF TEAMS USED IN PAPER;
. *GROUP 1, AT LEAST 1 PERSON IN TEAM IS ANTI-IMMIGRATION;
. *GROUP 3, MORE THAN HALF OF TEAM IS PRO-IMMIGRATION, SAME AS DINDEX VARIABLE;
. *GROUP 2, THE MODERATE MIDDLE;
. *BUT THERE IS AN OVERLAP OF 2 TEAMS BETWEEN GROUPS 1 AND 3, BOTH TEAMS HAVE 3 PERSON
> S;
. *IN THESE TEAMS, 1 PERSON IS A 2 BUT BOTH OF THE OTHER PEOPLE ARE 5 OR 6;
. *WILL CLASSIFY THEM AS PRO-IMMIGRATION GROUP SINCE MAJORITY IS PRO-IMMIGRATION;
. generate group1=(p12>0);

. generate group3=(pindex>=.5);

. tabulate group3 dindex;

           |        dindex
    group3 |         0          1 |     Total
-----------+----------------------+----------
         0 |       538          0 |       538 
         1 |         0        715 |       715 
-----------+----------------------+----------
     Total |       538        715 |     1,253 

. tabulate group1 group3;

           |        group3
    group1 |         0          1 |     Total
-----------+----------------------+----------
         0 |       404        675 |     1,079 
         1 |       134         40 |       174 
-----------+----------------------+----------
     Total |       538        715 |     1,253 

. list teamid att1 att2 att3 if group1==1 & group3==1;

      +-----------------------------+
      | teamid   att1   att2   att3 |
      |-----------------------------|
 640. |     61      5      2      6 |
 641. |     61      5      2      6 |
 642. |     61      5      2      6 |
 643. |     61      5      2      6 |
 644. |     61      5      2      6 |
      |-----------------------------|
 645. |     61      5      2      6 |
 646. |     61      5      2      6 |
 647. |     61      5      2      6 |
 648. |     61      5      2      6 |
 649. |     61      5      2      6 |
      |-----------------------------|
 650. |     61      5      2      6 |
 651. |     61      5      2      6 |
 652. |     61      5      2      6 |
 653. |     61      5      2      6 |
 654. |     61      5      2      6 |
      |-----------------------------|
 655. |     61      5      2      6 |
 656. |     61      5      2      6 |
 657. |     61      5      2      6 |
 658. |     61      5      2      6 |
 659. |     61      5      2      6 |
      |-----------------------------|
 660. |     61      5      2      6 |
 661. |     61      5      2      6 |
 662. |     61      5      2      6 |
 663. |     61      5      2      6 |
 680. |     64      5      2      5 |
      |-----------------------------|
 681. |     64      5      2      5 |
 682. |     64      5      2      5 |
 683. |     64      5      2      5 |
 684. |     64      5      2      5 |
 685. |     64      5      2      5 |
      |-----------------------------|
 686. |     64      5      2      5 |
 687. |     64      5      2      5 |
 688. |     64      5      2      5 |
 689. |     64      5      2      5 |
 690. |     64      5      2      5 |
      |-----------------------------|
 691. |     64      5      2      5 |
 692. |     64      5      2      5 |
 693. |     64      5      2      5 |
 694. |     64      5      2      5 |
 695. |     64      5      2      5 |
      +-----------------------------+

. unique teamid if group1==1 & group3==1;
Number of unique values of teamid is  2
Number of records is  40

. replace group3=1 if group1==1 & group3==1;
(0 real changes made)

. replace group1=0 if group1==1 & group3==1;
(40 real changes made)

. generate group2=(group1==0 & group3==0);

. generate index=1*group1 +2*group2 + 3*group3;

. tabulate index;

      index |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        134       10.69       10.69
          2 |        404       32.24       42.94
          3 |        715       57.06      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. *TOPIC KNOWLEDGE;
. tabulate topic_knowledge, missing;

TOPIC_KNOWL |
       EDGE |      Freq.     Percent        Cum.
------------+-----------------------------------
       High |        390       31.13       31.13
        Low |        366       29.21       60.34
        Mid |        485       38.71       99.04
         NA |         12        0.96      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. *MISSING DATA FOR THIS VARIABLE AND IT ALL BELONGS TO TEAM 27;
. *MOREOVER TOPIC_KNOWLEDGE FOR TEAM 27 IN TEAM LEVEL DATA IS ALSO MISSING;
. *WILL USE A HOT DECK PROCEDURE TO IMPUTE BASED ON MDEGREE, TEAM SIZE, AND PMALE;
. tabulate teamid if topic_knowledge=="NA";

     teamid |      Freq.     Percent        Cum.
------------+-----------------------------------
         27 |         12      100.00      100.00
------------+-----------------------------------
      Total |         12      100.00

. summ mdegree  if teamid==27;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     mdegree |         12           4           0          4          4

. tabulate topic_knowledge if mdegree==40 & team_size==1 & pmale==0;
no observations

. tabulate topic_ipred if mdegree==40 & team_size==1 & pmale==0;
no observations

. replace topic_knowledge="Low" if teamid==27;
(12 real changes made)

. replace topic_ipred="-0.253722245526001" if teamid==27;
(12 real changes made)

. tabulate topic_knowledge, missing;

TOPIC_KNOWL |
       EDGE |      Freq.     Percent        Cum.
------------+-----------------------------------
       High |        390       31.13       31.13
        Low |        378       30.17       61.29
        Mid |        485       38.71      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. *TOPIC_CAT CONVERTS TOPIC_KNOWLEDGE INTO NUMERIC, NOTE CODE 4 IS NA;
. generate topic_cat=1*(topic_knowledge=="Low") + 2*(topic_knowledge=="Mid") 
>         + 3*(topic_knowledge=="High");

. *TOPIC VARIABLE IN BRW COMES FROM A FACTOR ANALYSIS PREDICTION;
. destring topic_ipred, force gen(topic_brw);
topic_ipred: all characters numeric; topic_brw generated as double

. tabulate topic_brw topic_knowledge, missing;

topic_ipre |         TOPIC_KNOWLEDGE
         d |      High        Low        Mid |     Total
-----------+---------------------------------+----------
 -.3396846 |         0          8          0 |         8 
 -.3125983 |         0         32          0 |        32 
   -.30488 |         0         24          0 |        24 
 -.2948698 |         0         12          0 |        12 
 -.2924661 |         0         12          0 |        12 
 -.2844923 |         0         12          0 |        12 
 -.2842492 |         0         16          0 |        16 
 -.2567398 |         0        112          0 |       112 
 -.2537222 |         0        108          0 |       108 
 -.2501658 |         0          6          0 |         6 
 -.2323944 |         0         24          0 |        24 
 -.2252685 |         0         12          0 |        12 
 -.2088186 |         0          0         12 |        12 
 -.2032106 |         0          0         12 |        12 
 -.1750503 |         0          0          2 |         2 
 -.1700541 |         0          0         48 |        48 
 -.1684909 |         0          0          6 |         6 
 -.1681252 |         0          0          4 |         4 
  -.159743 |         0          0         24 |        24 
  -.152279 |         0          0          3 |         3 
 -.1431925 |         0          0          2 |         2 
 -.1379568 |         0          0          2 |         2 
 -.1322295 |         0          0         32 |        32 
 -.1180402 |         0          0         48 |        48 
 -.1180365 |         0          0         12 |        12 
 -.1160367 |         0          0         20 |        20 
 -.1126539 |         0          0          6 |         6 
 -.1081857 |         0          0         18 |        18 
 -.1060163 |         0          0         10 |        10 
 -.1056993 |         0          0         12 |        12 
 -.0988388 |         0          0          3 |         3 
 -.0964761 |         0          0         36 |        36 
 -.0910359 |         0          0         12 |        12 
 -.0861576 |         0          0          1 |         1 
 -.0766422 |         0          0         12 |        12 
 -.0724543 |         0          0          8 |         8 
 -.0630017 |         0          0         36 |        36 
 -.0605945 |         0          0         16 |        16 
 -.0572294 |         0          0         12 |        12 
 -.0528801 |         0          0         10 |        10 
 -.0390203 |         0          0         12 |        12 
 -.0355067 |         0          0          8 |         8 
 -.0346285 |         0          0          2 |         2 
 -.0198385 |         0          0          6 |         6 
 -.0190452 |         0          0         12 |        12 
 -.0120221 |         0          0         20 |        20 
 -.0084401 |         0          0          6 |         6 
  .0020823 |        24          0          0 |        24 
  .0121719 |        54          0          0 |        54 
  .0199861 |         8          0          0 |         8 
  .0227601 |        14          0          0 |        14 
  .0236555 |        16          0          0 |        16 
  .0544597 |        48          0          0 |        48 
  .0605255 |        12          0          0 |        12 
  .0693577 |        24          0          0 |        24 
  .0731461 |         4          0          0 |         4 
   .084274 |        16          0          0 |        16 
  .0897856 |        12          0          0 |        12 
  .1259155 |         2          0          0 |         2 
  .1959201 |        12          0          0 |        12 
  .2198415 |        36          0          0 |        36 
   .233174 |        24          0          0 |        24 
  .2384678 |         4          0          0 |         4 
  .2590647 |         4          0          0 |         4 
  .3775455 |         1          0          0 |         1 
  .6968864 |        12          0          0 |        12 
  .7740507 |         8          0          0 |         8 
  .8162819 |         3          0          0 |         3 
  .8381723 |         4          0          0 |         4 
  1.210172 |        48          0          0 |        48 
-----------+---------------------------------+----------
     Total |       390        378        485 |     1,253 

. summ topic_brw;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   topic_brw |      1,253   -.0364832    .3129656  -.3396846   1.210172

. *STATS INFO IS MISSING FOR TEAM 27, BUT TEAM 27 DATA IS NOT AVAILABLE IN TEAM DATA;
. *WILL USE HOT DECK PROCEDURE;
. tabulate statistics_skill if mdegree==40 & team_size==1 & pmale==0;
no observations

. tabulate stats_ipred if mdegree==40 & team_size==1 & pmale==0;
no observations

. replace statistics_skill="Mid" if teamid==27;
(12 real changes made)

. replace stats_ipred="0.102538885683808" if teamid==27;
(12 real changes made)

. generate stats_cat=1*(statistics_skill=="Low") + 2*(statistics_skill=="Mid") 
>         + 3*(statistics_skill=="High");

. *STATISTICS VARIABLE IN BRW COMES FROM A FACTOR ANALYSIS PREDICTION;
. destring stats_ipred, force gen(stats_brw);
stats_ipred: all characters numeric; stats_brw generated as double

. tabulate teamid if stats_brw==.;
no observations

. replace stats_brw=0.649019158901927 if teamid==8;
(0 real changes made)

. tabulate statistics_skill, sum(stats_brw);

STATISTICS_ |       Summary of stats_ipred
      SKILL |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |   .73442269   .24230561         178
        Low |  -.51687865   .25222262         282
        Mid |  -.03007244   .17214468         793
------------+------------------------------------
      Total |  -.03102952   .42165622       1,253

. *REFEREE DATA;
. *MODEL SCORE AND DUMMY VARIABLE INDICATING HIGH QUALITY RESEARCH;
. tabulate model_score, missing;

MODEL_SCORE |      Freq.     Percent        Cum.
------------+-----------------------------------
       High |        294       23.46       23.46
        Low |        417       33.28       56.74
        Mid |        542       43.26      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. generate model_cat=1*(model_score=="Low") + 2*(model_score=="Mid") 
>         + 3*(model_score=="High");

.         *MODEL SCORE VARIABLE IN BRW COMES FROM A FACTOR ANALYSIS PREDICTION;
. generate model_brw=total_score;

. destring model_brw, force replace;
model_brw already numeric; no replace

. summ model_brw model_cat;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   model_brw |      1,253    .4471207    .1142991   .1488998   .7288508
   model_cat |      1,253    1.901836    .7471596          1          3

. *GENERATE HIGH QUALITY RESEARCH VARIABLE;
. *NOTE THAT QUALITY THRESHOLD IS DEFINED IN BRW STUDY;
. generate quality=(model_cat==3);

. *NOTE THAT SINGLE AUTHORS DO NOT PRODUCE VALUABLE RESEARCH;
. tabulate model_score team_size;

MODEL_SCOR |            team_size
         E |         1          2          3 |     Total
-----------+---------------------------------+----------
      High |         0         19        275 |       294 
       Low |       100        183        134 |       417 
       Mid |       177        177        188 |       542 
-----------+---------------------------------+----------
     Total |       277        379        597 |     1,253 

. *MERGING IN ALTERNATIVE REFEREE SCORE;
. sort id;

. merge id using /volumes/ddisk/mi/researcher/cri_new_peer_scores.dta;
(you are using old merge syntax; see [D] merge for new syntax)

. drop _merge;

. drop if ame==.;
(8 observations deleted)

. tabulate peer_mean;

  peer_mean |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |          7        0.58        0.58
        2.3 |          4        0.33        0.91
        2.6 |          4        0.33        1.23
          3 |         48        3.95        5.19
   3.142857 |         12        0.99        6.17
   3.285714 |         32        2.63        8.81
        3.4 |          8        0.66        9.47
        3.5 |         28        2.30       11.77
   3.666667 |          4        0.33       12.10
   3.692308 |          4        0.33       12.43
        3.7 |          2        0.16       12.59
   3.714286 |         12        0.99       13.58
        3.8 |          8        0.66       14.24
   3.833333 |         54        4.44       18.68
   3.843137 |         24        1.98       20.66
   3.888889 |          6        0.49       21.15
        3.9 |         12        0.99       22.14
       3.92 |         24        1.98       24.12
   3.952381 |          6        0.49       24.61
          4 |         20        1.65       26.26
   4.033333 |         24        1.98       28.23
   4.076923 |         16        1.32       29.55
   4.111111 |         16        1.32       30.86
   4.142857 |        130       10.70       41.56
   4.153846 |          2        0.16       41.73
   4.166667 |         24        1.98       43.70
   4.173077 |          2        0.16       43.87
   4.181818 |          4        0.33       44.20
        4.2 |         12        0.99       45.19
   4.222222 |         29        2.39       47.57
   4.285714 |         16        1.32       48.89
   4.304348 |          4        0.33       49.22
   4.333333 |        124       10.21       59.42
        4.4 |         42        3.46       62.88
   4.428571 |         91        7.49       70.37
   4.454545 |          1        0.08       70.45
   4.461538 |         12        0.99       71.44
   4.473684 |          1        0.08       71.52
   4.481481 |          2        0.16       71.69
   4.484848 |          1        0.08       71.77
        4.5 |         67        5.51       77.28
   4.521739 |          3        0.25       77.53
       4.55 |          1        0.08       77.61
   4.555556 |          1        0.08       77.70
     4.5625 |          1        0.08       77.78
   4.571429 |          4        0.33       78.11
        4.6 |         14        1.15       79.26
   4.636364 |         48        3.95       83.21
   4.666667 |         92        7.57       90.78
   4.756757 |         12        0.99       91.77
        4.8 |         12        0.99       92.76
   4.842105 |          8        0.66       93.42
   4.888889 |          8        0.66       94.07
       4.92 |         20        1.65       95.72
          5 |         26        2.14       97.86
        5.2 |          2        0.16       98.02
       5.25 |         12        0.99       99.01
   5.428571 |          8        0.66       99.67
   5.666667 |          4        0.33      100.00
------------+-----------------------------------
      Total |      1,215      100.00

. summ peer_mean, detail;

                          peer_mean
-------------------------------------------------------------
      Percentiles      Smallest
 1%          2.6              2
 5%            3              2
10%          3.5              2       Obs               1,215
25%            4              2       Sum of wgt.       1,215

50%     4.333333                      Mean           4.203944
                        Largest       Std. dev.      .5266504
75%          4.5       5.666667
90%     4.666667       5.666667       Variance       .2773606
95%         4.92       5.666667       Skewness      -.9818616
99%         5.25       5.666667       Kurtosis       5.123153

. generate quality2=(peer_mean>4.5);

. replace quality2=. if peer_mean==.;
(38 real changes made, 38 to missing)

. *IMPUTING MISSING VALUES OF PEER_MEAN USING MODEL_SCORE AND SPECIFICATION CHARATERIS
> TICS;
. global design jobs-health logit ols stock flow changeflow w1985-w2016 orig13 eeurope
>  allavailable 
>         twowayfe level_cyear mlm_fe mlm_re anynonlin;

.         summ peer_mean model_score;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   peer_mean |      1,215    4.203944    .5266504          2   5.666667
 model_score |          0

. generate pscore=peer_mean;
(38 missing values generated)

. regress peer_mean model_brw $design;
note: flow omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   =     1,215
-------------+----------------------------------   F(24, 1190)     =     34.05
       Model |  137.086953        24  5.71195637   Prob > F        =    0.0000
    Residual |  199.628857     1,190  .167755342   R-squared       =    0.4071
-------------+----------------------------------   Adj R-squared   =    0.3952
       Total |   336.71581     1,214  .277360634   Root MSE        =    .40958

------------------------------------------------------------------------------
   peer_mean | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   model_brw |   2.064219    .309029     6.68   0.000     1.457916    2.670521
        jobs |   .0402603   .0275441     1.46   0.144    -.0137801    .0943008
       unemp |   .0152979    .027794     0.55   0.582    -.0392329    .0698287
     incdiff |   .0217294   .0277998     0.78   0.435    -.0328126    .0762714
      oldage |   .0175151   .0275287     0.64   0.525    -.0364952    .0715254
       house |   .0337241   .0327091     1.03   0.303    -.0304498     .097898
      health |   .0694766   .0321217     2.16   0.031     .0064552     .132498
       logit |   .0045312   .0350218     0.13   0.897    -.0641801    .0732425
         ols |  -.4394082   .0690574    -6.36   0.000    -.5748961   -.3039203
       stock |  -.0049934   .0248678    -0.20   0.841    -.0537829    .0437962
        flow |          0  (omitted)
  changeflow |   .1076898   .0834466     1.29   0.197     -.056029    .2714086
       w1985 |   .3891232   .1279061     3.04   0.002     .1381766    .6400699
       w1990 |  -.5689784   .1249991    -4.55   0.000    -.8142216   -.3237352
       w1996 |   .4485643   .0430398    10.42   0.000      .364122    .5330066
       w2006 |   .6075289   .0648645     9.37   0.000     .4802673    .7347905
       w2016 |   .1748775   .0326295     5.36   0.000     .1108597    .2388954
      orig13 |    .137428   .0355999     3.86   0.000     .0675826    .2072735
     eeurope |   .0095592   .0610186     0.16   0.876    -.1101568    .1292753
allavailable |   .2074884   .0507655     4.09   0.000     .1078885    .3070883
    twowayfe |   .5312994   .0617502     8.60   0.000     .4101479    .6524509
 level_cyear |  -.3346596   .0437875    -7.64   0.000    -.4205689   -.2487503
      mlm_fe |   .1761109   .1100412     1.60   0.110    -.0397855    .3920073
      mlm_re |   .3369553   .0749657     4.49   0.000     .1898758    .4840349
   anynonlin |   .2283694   .0490613     4.65   0.000     .1321131    .3246257
       _cons |    1.74456   .1476256    11.82   0.000     1.454924    2.034195
------------------------------------------------------------------------------

. predict phat;
(option xb assumed; fitted values)

. replace pscore=phat if peer_mean==.;
(38 real changes made)

. summ pscore peer_mean model_brw;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      pscore |      1,253    4.190467      .52501          2   5.666667
   peer_mean |      1,215    4.203944    .5266504          2   5.666667
   model_brw |      1,253    .4471207    .1142991   .1488998   .7288508

. corr pscore model_brw;
(obs=1,253)

             |   pscore model_~w
-------------+------------------
      pscore |   1.0000
   model_brw |   0.2007   1.0000


. *BELIEF HYPOTHESIS HAS USUAL PROBLEM WITH MISSING DATA FOR TEAM 27;
. *WILL AGAIN USE HOT DECK PROCEDURE;
. tabulate belief_hypothesis if teamid==27;

BELIEF_HYPO |
     THESIS |      Freq.     Percent        Cum.
------------+-----------------------------------
         NA |         12      100.00      100.00
------------+-----------------------------------
      Total |         12      100.00

. tabulate belief_ipred if teamid==27;

      belief_ipred |      Freq.     Percent        Cum.
-------------------+-----------------------------------
                NA |         12      100.00      100.00
-------------------+-----------------------------------
             Total |         12      100.00

. tabulate belief_hypothesis if mdegree==40 & team_size==1 & pmale==0;
no observations

. replace belief_hypothesis="Low" if teamid==27;
(12 real changes made)

. replace belief_ipred="-1.13508799270782" if teamid==27;
(12 real changes made)

. tabulate belief_hypothesis, missing;

BELIEF_HYPO |
     THESIS |      Freq.     Percent        Cum.
------------+-----------------------------------
       High |        186       14.84       14.84
        Low |        230       18.36       33.20
        Mid |        837       66.80      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. generate belief_cat=1*(belief_hypothesis=="Low") + 2*(belief_hypothesis=="Mid") 
>         + 3*(belief_hypothesis=="High");

. tabulate belief_hypothesis belief_cat, missing;

BELIEF_HYP |            belief_cat
   OTHESIS |         1          2          3 |     Total
-----------+---------------------------------+----------
      High |         0          0        186 |       186 
       Low |       230          0          0 |       230 
       Mid |         0        837          0 |       837 
-----------+---------------------------------+----------
     Total |       230        837        186 |     1,253 

. *THERE IS PROBABLY A MISCODING OF WHAT "HIGH BELIEF" MEANS IN DATA SET;
. *USING TEAM LEVEL DATA AND RESHAPING IT LEADS TO 159 PARTICIPANTS;
. *DOING TABULATION OF THE BELIEF_H1_Hx VARIABLES LEADS TO DISTRIBUTION OF BELIEF;
. *SIMILAR TO THAT IN APPENDIX QUESTIONNAIRE, P. 84, WHERE 1 MEANS BELIEF IMM STRONGLY
>  REDUCES SOCIAL POLICY SUPPORT;
. *ALTERNATIVE MEASURE OF BELIEF HYPOTHESIS USING INDIVIDUAL TEAM MEMBER BELIEFS;
. *SEE 002_CRI_DATA_PREP.RMD, LINE 356;
. *SUGGESTS CODING CHANGED FROM QUESTIONNAIRE AND HIGHER VALUES OF BELIEF_H1_11 SHOULD
>  INDICATE MORE BELIEF IN HYPOTHESIS;
. *BUT DISTRIBUTION OF VARIABLE COMPARED TO APPENDIX SUGGESTS THAT 1 IS STRONGLY REDUC
> ES, AND 4 IS SOMEWHAT INCREASES;
. *NOTE HIGH VALUE OF BELIEF_1_AVG MEANS *WEAKER* BELIEF IN HYPOTHESIS IMMIGRATION RED
> UCES SOCIAL SUPPORT;
. *NOTE THAT BELIEF_1_AVG AND BELIEF_H1_11 ARE THE SAME FOR SINGLE PERSON TEAMS;
. tabulate belief_1_avg belief_hypothesis;

                 |        BELIEF_HYPOTHESIS
    belief_1_avg |      High        Low        Mid |     Total
-----------------+---------------------------------+----------
               1 |         0         96          0 |        96 
1.66666666666667 |         0         16          0 |        16 
               2 |         0        106        272 |       378 
2.33333333333333 |         0          0        183 |       183 
             2.5 |         0          0        126 |       126 
2.66666666666667 |         0          0        111 |       111 
               3 |       160         12        141 |       313 
3.33333333333333 |        12          0          0 |        12 
             3.5 |        14          0          4 |        18 
-----------------+---------------------------------+----------
           Total |       186        230        837 |     1,253 

. tabulate belief_1_avg;

    belief_1_avg |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               1 |         96        7.66        7.66
1.66666666666667 |         16        1.28        8.94
               2 |        378       30.17       39.11
2.33333333333333 |        183       14.60       53.71
             2.5 |        126       10.06       63.77
2.66666666666667 |        111        8.86       72.63
               3 |        313       24.98       97.61
3.33333333333333 |         12        0.96       98.56
             3.5 |         18        1.44      100.00
-----------------+-----------------------------------
           Total |      1,253      100.00

. tabulate belief_1_avg belief_h1_11 if team_size==1;

                 |           belief_H1_11
    belief_1_avg |         1          2          3 |     Total
-----------------+---------------------------------+----------
               1 |        96          0          0 |        96 
               2 |         0         59          0 |        59 
               3 |         0          0        122 |       122 
-----------------+---------------------------------+----------
           Total |        96         59        122 |       277 

. destring belief_h1_11, force replace;
belief_h1_11: contains nonnumeric characters; replaced as byte
(20 missing values generated)

. destring belief_h1_12, force replace;
belief_h1_12: contains nonnumeric characters; replaced as byte
(676 missing values generated)

. destring belief_h1_13, force replace;
belief_h1_13: contains nonnumeric characters; replaced as byte
(289 missing values generated)

. tabulate belief_h1_11, missing;

belief_H1_1 |
          1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        112        8.94        8.94
          2 |        702       56.03       64.96
          3 |        383       30.57       95.53
          4 |         36        2.87       98.40
          . |         20        1.60      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. tabulate belief_h1_12, missing;

belief_H1_1 |
          2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |        251       20.03       20.03
          3 |        326       26.02       46.05
          . |        676       53.95      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. tabulate belief_h1_13, missing;

belief_H1_1 |
          3 |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |        550       43.89       43.89
          3 |        384       30.65       74.54
          4 |         30        2.39       76.94
          . |        289       23.06      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. *NBELIEF IS NUMBER IN TEAM THAT BELIEVES HYPOTHESIS IMMIGRATION REDUCES SUPPORT;
. *DBELIEF EQUALS 1 IF MORE THAN HALF THE TEAM BELIEVES IMMIGRATION REDUCES SUPPORT;
. *IF IMMIGRATION REDUCES SUPPORT IT WOULD MEAN THAT THE AME IS NEGATIVE;
. *USE CORRECT MEASURE OF TEAM SIZE TO DEFINE PBELIEF;
. *THE ORIGINAL BELIEF INDICES ONLY HAVE 4 POTENTIAL VALUES SO CANNOT DIFFERENTIATE LO
> WER AND UPPER ENDS;
. generate nbelief=(belief_h1_11<=2 & belief_h1_11~=.) 
>         + (belief_h1_12<=2 & belief_h1_12~=.) + (belief_h1_13<=2 & belief_h1_13~=.);

. replace team=(belief_h1_11~=.) + (belief_h1_12~=.) + (belief_h1_13~=.);
(62 real changes made)

. *generate nbelief=(belief_h1_11<2) + (belief_h1_12<2) + (belief_h1_13<2);
. generate pbelief=nbelief/team;

. tabulate pbelief;

    pbelief |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        319       25.46       25.46
   .3333333 |         99        7.90       33.36
         .5 |        150       11.97       45.33
   .6666667 |        195       15.56       60.89
          1 |        490       39.11      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. destring belief_ipred, force replace;
belief_ipred: all characters numeric; replaced as double

. *FIXES CODING ISSUE IN BELIEF_IPRED;
. generate belief_brw=-belief_ipred;

. *GENERATE DUMMY VARIABLES FOR STATS, TOPIC, AND BELIEF;
. *NOTE THAT CODING OF BELIEF IS IN REVERSE;
. generate hstats=(statistics_skill=="High");

. generate htopic=(topic_knowledge=="High");

. generate hbelief=(belief_hypothesis=="Low");

. *******************************************;
. *TYPE OF DEPENDENT VARIABLE USED;
. encode dv, generate(dep);

. tabulate dv, sum(dep);

            |            Summary of DV
         DV |        Mean   Std. dev.       Freq.
------------+------------------------------------
     Health |           1           0         123
      House |           2           0         123
    IncDiff |           3           0         203
       Jobs |           4           0         203
     OldAge |           5           0         203
    Scale_4 |           6           0          33
    Scale_5 |           7           0          12
    Scale_6 |           8           0         114
Scale_Desrv |           9           0          18
 Scale_Univ |          10           0          18
      Unemp |          11           0         203
------------+------------------------------------
      Total |   5.2466081   3.2429326       1,253

. tabulate scale;

      Scale |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,058       84.44       84.44
          1 |        195       15.56      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. tabulate dv scale;

            |         Scale
         DV |         0          1 |     Total
------------+----------------------+----------
     Health |       123          0 |       123 
      House |       123          0 |       123 
    IncDiff |       203          0 |       203 
       Jobs |       203          0 |       203 
     OldAge |       203          0 |       203 
    Scale_4 |         0         33 |        33 
    Scale_5 |         0         12 |        12 
    Scale_6 |         0        114 |       114 
Scale_Desrv |         0         18 |        18 
 Scale_Univ |         0         18 |        18 
      Unemp |       203          0 |       203 
------------+----------------------+----------
      Total |     1,058        195 |     1,253 

.  ***************************************************************************;
. *ALL REGRESSIONS WILL BE WEIGHTED BY 1/NMODEL SO THEY ARE NUMERICALLY EQUIVALENT TO 
> TEAM LEVEL REGRESSIONS;
. *WILL LEAVE OUT PMALE FROM ALL REGRESSIONS;
. *WILL INCLUDE TEAM_SIZE IN THE REFEREE SCORE, QUALITY REGRESSIONS;
. reg ame  proindex    stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  cluster(
> teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0617
                                                Root MSE          =     .19878

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0119531    .005623     2.13   0.037     .0007384    .0231678
   stats_brw |   .0905171   .0420421     2.15   0.035     .0066669    .1743674
   topic_brw |  -.1294408   .0531996    -2.43   0.018    -.2355441   -.0233375
          t2 |   .0097654   .0153738     0.64   0.527    -.0208966    .0404274
          t3 |   .0135064   .0239116     0.56   0.574    -.0341838    .0611966
             |
     mdegree |
          2  |  -.1812968   .0549041    -3.30   0.002    -.2907995   -.0717941
          3  |   -.182952   .0507762    -3.60   0.001    -.2842221    -.081682
          4  |  -.1841665   .0546071    -3.37   0.001     -.293077    -.075256
          5  |  -.1340736   .0645838    -2.08   0.042     -.262882   -.0052653
          6  |   -.206068   .0560292    -3.68   0.000    -.3178147   -.0943213
         20  |  -.1796716   .0548879    -3.27   0.002    -.2891421   -.0702011
         30  |  -.4589712   .0538023    -8.53   0.000    -.5662764   -.3516659
         31  |  -.1791557   .0631335    -2.84   0.006    -.3050716   -.0532398
         32  |  -.1903988   .0564444    -3.37   0.001    -.3029736    -.077824
         33  |  -.1835485   .0650618    -2.82   0.006    -.3133102   -.0537868
         34  |  -.2714954   .0972368    -2.79   0.007    -.4654281   -.0775627
         35  |  -.1508864   .0467581    -3.23   0.002    -.2441426   -.0576303
             |
       _cons |   .1150831   .0498397     2.31   0.024     .0156809    .2144853
------------------------------------------------------------------------------

. reg ame  dindex    stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  cluster(te
> amid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0665
                                                Root MSE          =     .19827

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0424621   .0152979     2.78   0.007     .0119514    .0729728
   stats_brw |   .0868006   .0389237     2.23   0.029     .0091697    .1644315
   topic_brw |  -.1254498   .0508529    -2.47   0.016    -.2268727   -.0240269
          t2 |   .0029411    .015247     0.19   0.848     -.027468    .0333502
          t3 |   .0142751   .0229933     0.62   0.537    -.0315835    .0601337
             |
     mdegree |
          2  |  -.1644616   .0512965    -3.21   0.002    -.2667691    -.062154
          3  |  -.1776811   .0514728    -3.45   0.001    -.2803404   -.0750218
          4  |  -.1758872   .0558046    -3.15   0.002     -.287186   -.0645883
          5  |  -.1245961   .0622058    -2.00   0.049    -.2486616   -.0005306
          6  |  -.1924819   .0560261    -3.44   0.001    -.3042224   -.0807413
         20  |  -.1733007   .0590411    -2.94   0.005    -.2910544   -.0555469
         30  |  -.4505878   .0590143    -7.64   0.000     -.568288   -.3328875
         31  |  -.1709203   .0638431    -2.68   0.009    -.2982514   -.0435893
         32  |  -.1839001   .0559886    -3.28   0.002    -.2955659   -.0722344
         33  |  -.1595355   .0626254    -2.55   0.013     -.284438   -.0346329
         34  |  -.2607416   .0891581    -2.92   0.005    -.4385618   -.0829214
         35  |  -.1285966   .0462733    -2.78   0.007    -.2208857   -.0363074
             |
       _cons |   .1347944   .0440924     3.06   0.003     .0468549     .222734
------------------------------------------------------------------------------

. reg ame  group1 group3    stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  clu
> ster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0708
                                                Root MSE          =     .19791

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0525519    .029548    -1.78   0.080    -.1114836    .0063797
      group3 |   .0270017     .01445     1.87   0.066    -.0018178    .0558213
   stats_brw |   .0824956   .0374201     2.20   0.031     .0078636    .1571276
   topic_brw |  -.1296656   .0508822    -2.55   0.013    -.2311469   -.0281842
          t2 |    -.00191   .0148835    -0.13   0.898    -.0315941    .0277741
          t3 |   .0106835   .0228352     0.47   0.641    -.0348598    .0562268
             |
     mdegree |
          2  |  -.2122076   .0616029    -3.44   0.001    -.3350707   -.0893446
          3  |  -.2027806   .0540667    -3.75   0.000    -.3106133    -.094948
          4  |  -.2046988   .0588469    -3.48   0.001    -.3220653   -.0873323
          5  |  -.1515217   .0647379    -2.34   0.022    -.2806374    -.022406
          6  |  -.2254712   .0598723    -3.77   0.000    -.3448827   -.1060597
         20  |  -.2030729   .0596124    -3.41   0.001    -.3219661   -.0841797
         30  |   -.477945   .0611646    -7.81   0.000     -.599934    -.355956
         31  |   -.196058   .0674963    -2.90   0.005    -.3306752   -.0614409
         32  |  -.2067078   .0557751    -3.71   0.000    -.3179479   -.0954678
         33  |  -.1478561   .0615296    -2.40   0.019     -.270573   -.0251392
         34  |  -.2945652   .0959578    -3.07   0.003    -.4859469   -.1031834
         35  |  -.1731037   .0526303    -3.29   0.002    -.2780715   -.0681359
             |
       _cons |   .1806416   .0548898     3.29   0.002     .0711674    .2901158
------------------------------------------------------------------------------

. *ADDING BELIEF;
. reg ame  proindex  pbelief  stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  c
> luster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0622
                                                Root MSE          =     .19881

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |    .012522   .0054729     2.29   0.025     .0016068    .0234373
     pbelief |  -.0136858   .0152281    -0.90   0.372    -.0440573    .0166857
   stats_brw |   .0897117   .0411801     2.18   0.033     .0075806    .1718429
   topic_brw |  -.1301054   .0526141    -2.47   0.016     -.235041   -.0251698
          t2 |    .010999   .0143243     0.77   0.445    -.0175699    .0395679
          t3 |   .0147823   .0239082     0.62   0.538    -.0329011    .0624656
             |
     mdegree |
          2  |  -.1946404   .0638037    -3.05   0.003    -.3218928    -.067388
          3  |  -.1898782   .0539683    -3.52   0.001    -.2975147   -.0822417
          4  |  -.1932732   .0589363    -3.28   0.002    -.3108179   -.0757286
          5  |  -.1341306    .064134    -2.09   0.040    -.2620417   -.0062194
          6  |  -.2165279   .0609523    -3.55   0.001    -.3380934   -.0949624
         20  |   -.188149   .0579017    -3.25   0.002    -.3036303   -.0726678
         30  |  -.4750835   .0633095    -7.50   0.000    -.6013503   -.3488166
         31  |  -.1864071   .0679289    -2.74   0.008     -.321887   -.0509271
         32  |  -.1964488   .0593291    -3.31   0.001    -.3147769   -.0781207
         33  |  -.1888558   .0677411    -2.79   0.007    -.3239612   -.0537504
         34  |  -.2795807   .1014766    -2.76   0.007    -.4819694    -.077192
         35  |  -.1568507   .0499968    -3.14   0.002    -.2565661   -.0571353
             |
       _cons |   .1264027   .0580131     2.18   0.033     .0106992    .2421062
------------------------------------------------------------------------------

. reg ame  dindex  pbelief  stats_brw topic_brw t2 t3 i.mdegree    [aw=1/nmodel] ,  cl
> uster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0675
                                                Root MSE          =     .19825

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0448597   .0156306     2.87   0.005     .0136855    .0760339
     pbelief |  -.0186187   .0162016    -1.15   0.254    -.0509316    .0136943
   stats_brw |   .0855384   .0377275     2.27   0.026     .0102933    .1607835
   topic_brw |  -.1261887   .0496451    -2.54   0.013    -.2252027   -.0271747
          t2 |   .0042245   .0139247     0.30   0.763    -.0235475    .0319964
          t3 |    .016044   .0227912     0.70   0.484    -.0294116    .0614997
             |
     mdegree |
          2  |  -.1816234   .0606442    -2.99   0.004    -.3025744   -.0606725
          3  |  -.1865974   .0549164    -3.40   0.001    -.2961247   -.0770701
          4  |  -.1875997   .0602022    -3.12   0.003    -.3076692   -.0675302
          5  |  -.1240811   .0611554    -2.03   0.046    -.2460517   -.0021105
          6  |  -.2057635   .0608305    -3.38   0.001    -.3270862   -.0844408
         20  |  -.1842572   .0623481    -2.96   0.004    -.3086065   -.0599078
         30  |  -.4716698   .0694003    -6.80   0.000    -.6100843   -.3332552
         31  |  -.1801428   .0684701    -2.63   0.010     -.316702   -.0435835
         32  |  -.1915877   .0591731    -3.24   0.002    -.3096047   -.0735706
         33  |  -.1652776   .0645999    -2.56   0.013    -.2941181   -.0364372
         34  |  -.2709469   .0933894    -2.90   0.005    -.4572061   -.0846877
         35  |  -.1353122   .0489639    -2.76   0.007    -.2329676   -.0376568
             |
       _cons |   .1515511    .053114     2.85   0.006     .0456186    .2574836
------------------------------------------------------------------------------

. reg ame  group1 group3  pbelief  stats_brw topic_brw t2 t3 i.mdegree    [aw=1/nmodel
> ] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0713
                                                Root MSE          =     .19793

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   -.050219   .0298219    -1.68   0.097     -.109697     .009259
      group3 |    .029488   .0148768     1.98   0.051    -.0001829     .059159
     pbelief |  -.0139777   .0163968    -0.85   0.397    -.0466802    .0187247
   stats_brw |   .0817392   .0366478     2.23   0.029     .0086474    .1548309
   topic_brw |  -.1300331   .0500273    -2.60   0.011    -.2298095   -.0302567
          t2 |  -.0007312   .0138982    -0.05   0.958    -.0284503    .0269879
          t3 |    .012171   .0232334     0.52   0.602    -.0341666    .0585085
             |
     mdegree |
          2  |  -.2229721   .0679817    -3.28   0.002    -.3585573   -.0873868
          3  |  -.2083602    .056843    -3.67   0.000      -.32173   -.0949903
          4  |  -.2122128   .0624679    -3.40   0.001    -.3368011   -.0876245
          5  |  -.1499398   .0632984    -2.37   0.021    -.2761845    -.023695
          6  |  -.2339777   .0637215    -3.67   0.000    -.3610661   -.1068893
         20  |  -.2099767   .0625284    -3.36   0.001    -.3346856   -.0852677
         30  |  -.4925576   .0709311    -6.94   0.000    -.6340251     -.35109
         31  |  -.2018657   .0716687    -2.82   0.006    -.3448045    -.058927
         32  |  -.2114667   .0585502    -3.61   0.001    -.3282413    -.094692
         33  |  -.1526855   .0642192    -2.38   0.020    -.2807666   -.0246043
         34  |  -.3007252    .099093    -3.03   0.003    -.4983599   -.1030904
         35  |  -.1761695   .0542388    -3.25   0.002    -.2843454   -.0679936
             |
       _cons |   .1911862   .0608564     3.14   0.002     .0698119    .3125605
------------------------------------------------------------------------------

. ***************************************************************************;
. *WEIGHTED REGRESSIONS USING PSCORE/NMODEL;
. *WEIGHTING BY QUALITY HELPS ADDRESS PUBLICATION BIAS PROBLEM;
. reg ame  proindex    stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel] ,  clu
> ster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0633
                                                Root MSE          =     .20017

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0123818   .0056092     2.21   0.031     .0011946    .0235689
   stats_brw |   .0925292   .0431963     2.14   0.036     .0063769    .1786815
   topic_brw |  -.1309981   .0544881    -2.40   0.019    -.2396711   -.0223251
          t2 |   .0099349   .0156544     0.63   0.528    -.0212868    .0411565
          t3 |   .0130364   .0245144     0.53   0.597    -.0358559    .0619288
             |
     mdegree |
          2  |  -.1843105   .0568673    -3.24   0.002    -.2977287   -.0708922
          3  |  -.1872643    .054396    -3.44   0.001    -.2957538   -.0787749
          4  |  -.1908367   .0576879    -3.31   0.001    -.3058915   -.0757818
          5  |  -.1350801   .0663175    -2.04   0.045    -.2673462    -.002814
          6  |  -.2094116   .0592294    -3.54   0.001     -.327541   -.0912823
         20  |  -.1824017   .0583591    -3.13   0.003    -.2987953   -.0660082
         30  |  -.4623925    .055617    -8.31   0.000    -.5733171   -.3514679
         31  |   -.186762   .0639635    -2.92   0.005    -.3143332   -.0591908
         32  |  -.1916381   .0568954    -3.37   0.001    -.3051123   -.0781638
         33  |  -.1865917   .0662564    -2.82   0.006    -.3187358   -.0544475
         34  |  -.2825613    .097455    -2.90   0.005    -.4769291   -.0881936
         35  |   -.153431   .0474819    -3.23   0.002    -.2481306   -.0587314
             |
       _cons |   .1166229   .0500645     2.33   0.023     .0167725    .2164734
------------------------------------------------------------------------------

. reg ame  dindex    stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel] ,  clust
> er(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0684
                                                Root MSE          =     .19962

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0432727    .015945     2.71   0.008     .0114713    .0750741
   stats_brw |   .0891465   .0400606     2.23   0.029     .0092481    .1690448
   topic_brw |  -.1264924    .051835    -2.44   0.017    -.2298741   -.0231107
          t2 |   .0031225   .0154706     0.20   0.841    -.0277326    .0339776
          t3 |   .0141544   .0235509     0.60   0.550    -.0328165    .0611252
             |
     mdegree |
          2  |  -.1674013   .0527522    -3.17   0.002    -.2726123   -.0621903
          3  |  -.1817805   .0542132    -3.35   0.001    -.2899053   -.0736556
          4  |  -.1817994   .0581034    -3.13   0.003    -.2976829    -.065916
          5  |  -.1259524   .0637869    -1.97   0.052    -.2531714    .0012667
          6  |  -.1945915   .0578647    -3.36   0.001    -.3099989    -.079184
         20  |  -.1756151     .06226    -2.82   0.006    -.2997888   -.0514414
         30  |  -.4539677   .0601801    -7.54   0.000    -.5739931   -.3339424
         31  |  -.1783855   .0640574    -2.78   0.007     -.306144   -.0506269
         32  |  -.1860099   .0563466    -3.30   0.002    -.2983895   -.0736302
         33  |   -.162893   .0633258    -2.57   0.012    -.2891923   -.0365936
         34  |  -.2708072   .0889641    -3.04   0.003    -.4482404   -.0933739
         35  |  -.1311388   .0466242    -2.81   0.006    -.2241277   -.0381498
             |
       _cons |   .1377506   .0454622     3.03   0.003     .0470792    .2284221
------------------------------------------------------------------------------

. reg ame  group1 group3    stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel] ,
>   cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0734
                                                Root MSE          =     .19916

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0563427   .0326814    -1.72   0.089    -.1215237    .0088382
      group3 |   .0272862   .0145286     1.88   0.065    -.0016902    .0562625
   stats_brw |   .0830265   .0380076     2.18   0.032     .0072226    .1588303
   topic_brw |  -.1303009   .0517616    -2.52   0.014    -.2335362   -.0270655
          t2 |  -.0025613   .0149479    -0.17   0.864     -.032374    .0272514
          t3 |   .0106282   .0231998     0.46   0.648    -.0356424    .0568988
             |
     mdegree |
          2  |   -.216702   .0640048    -3.39   0.001    -.3443556   -.0890484
          3  |  -.2070529    .056691    -3.65   0.000    -.3201196   -.0939862
          4  |  -.2115476   .0612608    -3.45   0.001    -.3337283   -.0893668
          5  |  -.1529096    .066275    -2.31   0.024    -.2850909   -.0207282
          6  |  -.2284195   .0622222    -3.67   0.000    -.3525178   -.1043212
         20  |  -.2061647   .0624843    -3.30   0.002    -.3307857   -.0815436
         30  |   -.482495   .0625877    -7.71   0.000    -.6073222   -.3576678
         31  |  -.2039401   .0684129    -2.98   0.004    -.3403854   -.0674949
         32  |  -.2101707   .0563253    -3.73   0.000    -.3225078   -.0978335
         33  |  -.1484767    .061854    -2.40   0.019    -.2718407   -.0251127
         34  |  -.3062543   .0964038    -3.18   0.002    -.4985257   -.1139829
         35  |  -.1778272   .0538016    -3.31   0.001    -.2851311   -.0705233
             |
       _cons |   .1850179   .0573882     3.22   0.002     .0705607    .2994752
------------------------------------------------------------------------------

. *ADDING BELIEF;
. reg ame  proindex  pbelief  stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel]
>  ,  cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0639
                                                Root MSE          =     .20017

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0130995   .0054661     2.40   0.019     .0021977    .0240014
     pbelief |  -.0159018   .0151974    -1.05   0.299    -.0462121    .0144085
   stats_brw |   .0917602   .0423094     2.17   0.033     .0073768    .1761435
   topic_brw |  -.1320867   .0538084    -2.45   0.017    -.2394041   -.0247692
          t2 |    .011175    .014505     0.77   0.444    -.0177544    .0401044
          t3 |    .014556   .0243943     0.60   0.553     -.034097     .063209
             |
     mdegree |
          2  |  -.2001037   .0658699    -3.04   0.003    -.3314771   -.0687303
          3  |  -.1953589   .0574169    -3.40   0.001    -.3098734   -.0808444
          4  |  -.2012862   .0616593    -3.26   0.002    -.3242617   -.0783107
          5  |   -.135397   .0657871    -2.06   0.043    -.2666052   -.0041888
          6  |  -.2219749   .0642402    -3.46   0.001    -.3500979   -.0938519
         20  |   -.192472    .061408    -3.13   0.003    -.3149465   -.0699975
         30  |  -.4815215    .065191    -7.39   0.000    -.6115409   -.3515021
         31  |   -.195812   .0688935    -2.84   0.006    -.3332158   -.0584082
         32  |  -.1989202   .0597261    -3.33   0.001    -.3180401   -.0798004
         33  |    -.19307   .0688888    -2.80   0.007    -.3304643   -.0556756
         34  |  -.2925204   .1020935    -2.87   0.005    -.4961394   -.0889013
         35  |  -.1606208   .0506729    -3.17   0.002    -.2616848   -.0595568
             |
       _cons |   .1298215   .0583384     2.23   0.029     .0134693    .2461737
------------------------------------------------------------------------------

. reg ame  dindex  pbelief  stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel] ,
>   cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0697
                                                Root MSE          =     .19956

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0462969   .0164421     2.82   0.006     .0135041    .0790896
     pbelief |  -.0217828   .0162844    -1.34   0.185     -.054261    .0106954
   stats_brw |   .0879109   .0387613     2.27   0.026     .0106041    .1652178
   topic_brw |  -.1277408   .0503624    -2.54   0.013    -.2281855   -.0272962
          t2 |   .0043255   .0139648     0.31   0.758    -.0235265    .0321775
          t3 |   .0162915    .023122     0.70   0.483    -.0298237    .0624068
             |
     mdegree |
          2  |  -.1878085   .0622972    -3.01   0.004    -.3120564   -.0635606
          3  |  -.1922382    .057522    -3.34   0.001    -.3069622   -.0775143
          4  |  -.1952322   .0622179    -3.14   0.002    -.3193219   -.0711425
          5  |  -.1256825   .0625469    -2.01   0.048    -.2504284   -.0009366
          6  |   -.210553   .0628757    -3.35   0.001    -.3359546   -.0851514
         20  |  -.1886728   .0658227    -2.87   0.005     -.319952   -.0573937
         30  |  -.4791413   .0708012    -6.77   0.000    -.6203498   -.3379329
         31  |  -.1899878   .0688645    -2.76   0.007    -.3273338   -.0526419
         32  |  -.1953719     .05948    -3.28   0.002     -.314001   -.0767428
         33  |  -.1699591   .0651488    -2.61   0.011    -.2998942   -.0400241
         34  |  -.2834017   .0934449    -3.03   0.003    -.4697718   -.0970317
         35  |  -.1392552    .049157    -2.83   0.006    -.2372958   -.0412146
             |
       _cons |   .1576011    .054672     2.88   0.005     .0485613    .2666409
------------------------------------------------------------------------------

. reg ame  group1 group3  pbelief  stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nm
> odel] ,  cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0741
                                                Root MSE          =     .19917

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0535469    .033017    -1.62   0.109    -.1193972    .0123034
      group3 |   .0303624   .0151353     2.01   0.049     .0001759    .0605488
     pbelief |  -.0164435   .0166286    -0.99   0.326    -.0496082    .0167213
   stats_brw |   .0823975   .0372424     2.21   0.030     .0081199     .156675
   topic_brw |  -.1310543   .0507682    -2.58   0.012    -.2323082   -.0298004
          t2 |  -.0013711   .0138289    -0.10   0.921     -.028952    .0262098
          t3 |   .0124165   .0235005     0.53   0.599    -.0344538    .0592868
             |
     mdegree |
          2  |  -.2296606   .0705324    -3.26   0.002    -.3703332   -.0889881
          3  |  -.2136932   .0593945    -3.60   0.001    -.3321519   -.0952346
          4  |  -.2202116   .0646845    -3.40   0.001    -.3492207   -.0912024
          5  |  -.1513682    .064777    -2.34   0.022    -.2805619   -.0221745
          6  |  -.2387899   .0661833    -3.61   0.001    -.3707884   -.1067914
         20  |  -.2145058   .0656666    -3.27   0.002    -.3454737   -.0835379
         30  |  -.5000825   .0726873    -6.88   0.000    -.6450529   -.3551122
         31  |  -.2114305   .0730063    -2.90   0.005     -.357037    -.065824
         32  |   -.216039   .0591428    -3.65   0.000    -.3339956   -.0980823
         33  |  -.1545262   .0645782    -2.39   0.019    -.2833235    -.025729
         34  |  -.3140028   .0997911    -3.15   0.002    -.5130298   -.1149757
         35  |  -.1816374   .0554205    -3.28   0.002      -.29217   -.0711047
             |
       _cons |   .1976572   .0634236     3.12   0.003     .0711628    .3241517
------------------------------------------------------------------------------

. ********************************************************************;
. *GETTING EFFECTS ON ESTIMATE BY LOOKING AT EXTREME SIGNIFICANT COEFFICIENTS, USING 1
> 0TH AND 90TH PERCENTILES;
. generate negsig=(ame<0 & z>1.645);

. generate possig=(ame>0 & z>1.645);

. summ ame;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |      1,253    .0007771    .1865197  -1.353765       2.47

. generate pos10=(ame>.052);

. generate neg10=(ame<-.071);

. generate pos10s=(ame>.052 & z>1.645);

. generate neg10s=(ame<-.071 & z>1.645);

. summ pos10-neg10s;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       pos10 |      1,253    .1005587    .3008635          0          1
       neg10 |      1,253    .1005587    .3008635          0          1
      pos10s |      1,253    .0526736    .2234702          0          1
      neg10s |      1,253    .0630487    .2431475          0          1

. summ pos10-neg10s [aw=model_brw];

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
       pos10 |   1,253  560.242243    .1000907   .3002407          0          1
       neg10 |   1,253  560.242243    .1076047   .3100043          0          1
      pos10s |   1,253  560.242243    .0478909   .2136206          0          1
      neg10s |   1,253  560.242243    .0661285   .2486058          0          1

. *OLS REGRESSIONS ON EXTREME OUTCOMES;
. reg neg10 proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(
> teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0839
                                                Root MSE          =     .33274

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
       neg10 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0515209   .0218577    -2.36   0.021    -.0951147   -.0079272
   stats_brw |   -.134611    .087614    -1.54   0.129    -.3093516    .0401296
   topic_brw |   .2419096   .0998376     2.42   0.018     .0427897    .4410294
          t2 |   .0421659   .0596997     0.71   0.482    -.0769014    .1612331
          t3 |   .0494748   .0781779     0.63   0.529    -.1064461    .2053957
             |
     mdegree |
          2  |   .1543637   .1153229     1.34   0.185    -.0756406    .3843681
          3  |    .285567    .165011     1.73   0.088     -.043537     .614671
          4  |   .3022763   .1489731     2.03   0.046     .0051589    .5993937
          5  |   .1491874    .148046     1.01   0.317     -.146081    .4444557
          6  |   .2538009   .1707052     1.49   0.142      -.08666    .5942617
         20  |   .2241848   .1542547     1.45   0.151    -.0834666    .5318362
         30  |   .6418054   .1481428     4.33   0.000     .3463438    .9372669
         31  |   .2423806   .1621387     1.49   0.139    -.0809948     .565756
         32  |   .2756013   .1455197     1.89   0.062    -.0146285    .5658311
         33  |   .1019938   .1480116     0.69   0.493     -.193206    .3971937
         34  |   .3939946   .2269823     1.74   0.087    -.0587073    .8466965
         35  |   .0576333   .1091656     0.53   0.599    -.1600907    .2753573
             |
       _cons |   .0547663   .1112393     0.49   0.624    -.1670934    .2766261
------------------------------------------------------------------------------

. reg neg10 dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(te
> amid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0967
                                                Root MSE          =     .33041

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
       neg10 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.1473116   .0541623    -2.72   0.008     -.255335   -.0392883
   stats_brw |  -.1261211   .0824232    -1.53   0.130    -.2905091    .0382668
   topic_brw |   .2341602   .0960053     2.44   0.017     .0426837    .4256368
          t2 |   .0668183   .0601691     1.11   0.271    -.0531852    .1868219
          t3 |   .0478394   .0746687     0.64   0.524    -.1010825    .1967614
             |
     mdegree |
          2  |    .091822   .1055493     0.87   0.387    -.1186895    .3023335
          3  |   .2460921   .1556171     1.58   0.118    -.0642763    .5564606
          4  |     .25232   .1388929     1.82   0.074    -.0246932    .5293332
          5  |   .1104891   .1335566     0.83   0.411    -.1558811    .3768593
          6  |   .1882579   .1463888     1.29   0.203    -.1037053    .4802211
         20  |   .1800701   .1478105     1.22   0.227    -.1147288    .4748689
         30  |   .5757155   .1311715     4.39   0.000     .3141022    .8373288
         31  |   .1957794     .14932     1.31   0.194      -.10203    .4935888
         32  |   .2351697   .1358669     1.73   0.088    -.0358083    .5061476
         33  |   .0062793   .1419146     0.04   0.965    -.2767604     .289319
         34  |   .3376875   .1937774     1.74   0.086    -.0487893    .7241644
         35  |  -.0338915   .1058487    -0.32   0.750    -.2450001     .177217
             |
       _cons |  -.0384072   .1007978    -0.38   0.704     -.239442    .1626276
------------------------------------------------------------------------------

. reg neg10 group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  clu
> ster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1095
                                                Root MSE          =      .3282

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
       neg10 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |    .155022   .1190496     1.30   0.197    -.0824149     .392459
      group3 |  -.1017054   .0488908    -2.08   0.041     -.199215   -.0041959
   stats_brw |  -.1134221   .0783981    -1.45   0.152    -.2697823    .0429381
   topic_brw |   .2465963   .1015013     2.43   0.018     .0441583    .4490342
          t2 |   .0811286   .0610915     1.33   0.188    -.0407146    .2029719
          t3 |   .0584342   .0784116     0.75   0.459    -.0979528    .2148212
             |
     mdegree |
          2  |   .2326672   .1677877     1.39   0.170    -.1019747    .5673092
          3  |   .3201326   .1732658     1.85   0.069     -.025435    .6657003
          4  |   .3373109   .1582943     2.13   0.037     .0216029    .6530188
          5  |   .1899165   .1665124     1.14   0.258     -.142182     .522015
          6  |   .2855724   .1783464     1.60   0.114    -.0701283    .6412731
         20  |   .2678946   .1707761     1.57   0.121    -.0727077    .6084968
         30  |    .656416   .1529286     4.29   0.000     .3514096    .9614225
         31  |   .2699327   .1812141     1.49   0.141    -.0914875    .6313528
         32  |   .3024497   .1404553     2.15   0.035     .0223204    .5825789
         33  |  -.0281735   .1415866    -0.20   0.843    -.3105591    .2542121
         34  |   .4374632   .2269407     1.93   0.058    -.0151557     .890082
         35  |   .0973992   .1489336     0.65   0.515    -.1996394    .3944378
             |
       _cons |   -.173651   .1606696    -1.08   0.283    -.4940965    .1467945
------------------------------------------------------------------------------

. reg neg10s proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster
> (teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0977
                                                Root MSE          =     .29044

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0526062   .0201393    -2.61   0.011    -.0927727   -.0124397
   stats_brw |  -.1610151   .0787305    -2.05   0.045    -.3180382    -.003992
   topic_brw |   .2208328    .083773     2.64   0.010     .0537528    .3879129
          t2 |   .0393169   .0593078     0.66   0.510    -.0789688    .1576026
          t3 |   .0569811   .0766521     0.74   0.460    -.0958968    .2098589
             |
     mdegree |
          2  |   .1853848   .1056764     1.75   0.084    -.0253801    .3961497
          3  |   .2974743   .1630756     1.82   0.072    -.0277697    .6227184
          4  |   .3250968   .1441152     2.26   0.027     .0376681    .6125254
          5  |    .171024   .1402268     1.22   0.227    -.1086496    .4506975
          6  |   .3131019   .1721819     1.82   0.073     -.030304    .6565078
         20  |    .183953   .1443086     1.27   0.207    -.1038615    .4717675
         30  |   .2753758   .1394985     1.97   0.052    -.0028451    .5535968
         31  |   .2670686   .1481146     1.80   0.076    -.0283367    .5624739
         32  |    .195392   .1287278     1.52   0.134    -.0613475    .4521315
         33  |   .1445726   .1396495     1.04   0.304    -.1339496    .4230948
         34  |   .4334891    .218282     1.99   0.051    -.0018606    .8688387
         35  |   .0788061   .1028987     0.77   0.446    -.1264189    .2840311
             |
       _cons |   .0168118   .0973013     0.17   0.863    -.1772495    .2108731
------------------------------------------------------------------------------

. reg neg10s dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(t
> eamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1252
                                                Root MSE          =     .28598

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.1664769   .0515827    -3.23   0.002    -.2693554   -.0635984
   stats_brw |  -.1489597   .0722726    -2.06   0.043    -.2931029   -.0048165
   topic_brw |   .2086685   .0701187     2.98   0.004     .0688211    .3485158
          t2 |   .0666304   .0592725     1.12   0.265     -.051585    .1848457
          t3 |   .0545566   .0724184     0.75   0.454    -.0898775    .1989906
             |
     mdegree |
          2  |   .1170178   .0910481     1.29   0.203    -.0645718    .2986074
          3  |   .2647047   .1521014     1.74   0.086     -.038652    .5680613
          4  |    .280507   .1305564     2.15   0.035     .0201204    .5408935
          5  |   .1305425    .121494     1.07   0.286    -.1117696    .3728547
          6  |   .2493195   .1403774     1.78   0.080    -.0306544    .5292933
         20  |   .1464002   .1374654     1.06   0.291    -.1277659    .4205662
         30  |   .2213677   .1192275     1.86   0.068    -.0164241    .4591594
         31  |   .2244807   .1333424     1.68   0.097    -.0414623    .4904236
         32  |   .1596956   .1154296     1.38   0.171    -.0705214    .3899126
         33  |   .0433392   .1310666     0.33   0.742     -.218065    .3047433
         34  |   .3804739   .1772043     2.15   0.035     .0270512    .7338967
         35  |  -.0166932   .0985587    -0.17   0.866    -.2132623    .1798759
             |
       _cons |  -.0746301   .0913172    -0.82   0.417    -.2567566    .1074963
------------------------------------------------------------------------------

. reg neg10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cl
> uster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1363
                                                Root MSE          =     .28427

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .1270453   .1154106     1.10   0.275    -.1031339    .3572245
      group3 |  -.1291012   .0466284    -2.77   0.007    -.2220986   -.0361038
   stats_brw |  -.1385524   .0673328    -2.06   0.043    -.2728435   -.0042613
   topic_brw |   .2188602   .0771412     2.84   0.006     .0650069    .3727134
          t2 |   .0783581   .0602359     1.30   0.198    -.0417786    .1984948
          t3 |   .0632393   .0762053     0.83   0.409    -.0887474    .2152261
             |
     mdegree |
          2  |   .2324449   .1619686     1.44   0.156    -.0905914    .5554811
          3  |   .3253832    .172958     1.88   0.064    -.0195707    .6703371
          4  |   .3501596   .1540094     2.27   0.026     .0429976    .6573217
          5  |   .1956357   .1569774     1.25   0.217    -.1174458    .5087172
          6  |   .3290717   .1778672     1.85   0.069    -.0256733    .6838167
         20  |   .2183751   .1629854     1.34   0.185    -.1066892    .5434393
         30  |   .2875042   .1429084     2.01   0.048     .0024824    .5725261
         31  |   .2852516   .1651636     1.73   0.089    -.0441568    .6146599
         32  |   .2148336   .1262852     1.70   0.093    -.0370343    .4667015
         33  |   .0151041    .129967     0.12   0.908    -.2441068     .274315
         34  |   .4622431    .210577     2.20   0.031     .0422605    .8822258
         35  |   .0909036   .1418995     0.64   0.524     -.192106    .3739132
             |
       _cons |  -.1854666   .1584864    -1.17   0.246    -.5015578    .1306246
------------------------------------------------------------------------------

. *REGRESSIONS ON OUTLYING POSITIVE & SIGNIFICANT COEFFICIENTS;
. reg pos10 proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(
> teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0847
                                                Root MSE          =     .30662

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
       pos10 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0238375   .0133767     1.78   0.079    -.0028415    .0505165
   stats_brw |    .148562   .0593095     2.50   0.015     .0302729    .2668511
   topic_brw |  -.1622257   .0717603    -2.26   0.027    -.3053472   -.0191043
          t2 |   .0803933   .0414938     1.94   0.057    -.0023635    .1631501
          t3 |   .0289493    .039983     0.72   0.471    -.0507942    .1086929
             |
     mdegree |
          2  |  -.5525792   .0774806    -7.13   0.000    -.7071094   -.3980489
          3  |  -.5188764   .0812113    -6.39   0.000    -.6808472   -.3569056
          4  |  -.5166041    .089087    -5.80   0.000    -.6942824   -.3389257
          5  |  -.2710203   .1228364    -2.21   0.031    -.5160099   -.0260308
          6  |  -.6061857   .0962283    -6.30   0.000    -.7981071   -.4142644
         20  |  -.4098171   .1277124    -3.21   0.002    -.6645314   -.1551027
         30  |  -.5590622   .0940245    -5.95   0.000    -.7465881   -.3715362
         31  |  -.4824063   .1086737    -4.44   0.000    -.6991492   -.2656634
         32  |  -.4338167   .0859587    -5.05   0.000     -.605256   -.2623774
         33  |  -.5955213   .0956399    -6.23   0.000     -.786269   -.4047736
         34  |  -.4034106   .1714995    -2.35   0.021    -.7454555   -.0613657
         35  |  -.4771423   .0718251    -6.64   0.000    -.6203929   -.3338917
             |
       _cons |   .4527819   .0754214     6.00   0.000     .3023586    .6032052
------------------------------------------------------------------------------

. reg pos10 dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(te
> amid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0827
                                                Root MSE          =     .30697

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
       pos10 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0420275    .030308     1.39   0.170      -.01842     .102475
   stats_brw |   .1501434   .0590592     2.54   0.013     .0323534    .2679333
   topic_brw |  -.1655571   .0708615    -2.34   0.022    -.3068859   -.0242284
          t2 |   .0724714   .0413472     1.75   0.084     -.009993    .1549357
          t3 |   .0284783   .0413699     0.69   0.493    -.0540313     .110988
             |
     mdegree |
          2  |  -.5309759   .0771591    -6.88   0.000    -.6848649   -.3770868
          3  |  -.4883516   .0789212    -6.19   0.000     -.645755   -.3309482
          4  |  -.4830485   .0874033    -5.53   0.000    -.6573689   -.3087281
          5  |  -.2546904   .1314476    -1.94   0.057    -.5168543    .0074734
          6  |  -.5707506   .0976937    -5.84   0.000    -.7655945   -.3759067
         20  |  -.3772198   .1283553    -2.94   0.004    -.6332163   -.1212233
         30  |  -.5065649    .086768    -5.84   0.000    -.6796182   -.3335116
         31  |  -.4527194   .1089941    -4.15   0.000    -.6701014   -.2353375
         32  |  -.4060213   .0857254    -4.74   0.000    -.5769953   -.2350474
         33  |  -.5569347   .0932714    -5.97   0.000    -.7429585   -.3709108
         34  |  -.3700739   .1628498    -2.27   0.026    -.6948676   -.0452803
         35  |  -.4381253   .0682326    -6.42   0.000    -.5742109   -.3020396
             |
       _cons |   .5019007   .0683219     7.35   0.000      .365637    .6381644
------------------------------------------------------------------------------

. reg pos10 group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  clu
> ster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0868
                                                Root MSE          =      .3064

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
       pos10 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0811287   .0449767    -1.80   0.076    -.1708319    .0085745
      group3 |   .0181601   .0342606     0.53   0.598    -.0501704    .0864907
   stats_brw |   .1434975   .0563056     2.55   0.013     .0311995    .2557955
   topic_brw |  -.1720654    .068808    -2.50   0.015    -.3092986   -.0348321
          t2 |   .0649823   .0385382     1.69   0.096    -.0118798    .1418443
          t3 |   .0229337   .0380683     0.60   0.549    -.0529912    .0988586
             |
     mdegree |
          2  |  -.6046854   .0873969    -6.92   0.000    -.7789929   -.4303778
          3  |  -.5270997   .0822733    -6.41   0.000    -.6911886   -.3630108
          4  |  -.5275273   .0899655    -5.86   0.000    -.7069578   -.3480969
          5  |  -.2962577   .1217309    -2.43   0.018    -.5390424    -.053473
          6  |  -.6216788   .0992513    -6.26   0.000    -.8196293   -.4237283
         20  |  -.4231815   .1238669    -3.42   0.001    -.6702263   -.1761368
         30  |  -.5487985   .0872385    -6.29   0.000    -.7227901   -.3748068
         31  |  -.4915266     .10815    -4.54   0.000     -.707225   -.2758281
         32  |  -.4412314   .0862144    -5.12   0.000    -.6131806   -.2692822
         33  |  -.5389043   .0881804    -6.11   0.000    -.7147746    -.363034
         34  |  -.4222902   .1726507    -2.45   0.017    -.7666311   -.0779492
         35  |  -.5068345   .0802957    -6.31   0.000    -.6669793   -.3466897
             |
       _cons |   .5726787   .0798603     7.17   0.000     .4134024    .7319551
------------------------------------------------------------------------------

. reg pos10s proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster
> (teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0864
                                                Root MSE          =     .24497

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |    .019493   .0116708     1.67   0.099    -.0037836    .0427696
   stats_brw |   .0545334   .0399918     1.36   0.177    -.0252277    .1342945
   topic_brw |  -.0707306   .0430256    -1.64   0.105    -.1565424    .0150812
          t2 |   .0271741   .0370582     0.73   0.466    -.0467362    .1010845
          t3 |   .0214432   .0318778     0.67   0.503    -.0421351    .0850215
             |
     mdegree |
          2  |  -.4256299   .0538479    -7.90   0.000    -.5330262   -.3182337
          3  |  -.4314119   .0675397    -6.39   0.000    -.5661155   -.2967082
          4  |  -.3800243   .0664467    -5.72   0.000    -.5125481   -.2475005
          5  |  -.1949112   .1102199    -1.77   0.081    -.4147378    .0249154
          6  |  -.4512027   .0726483    -6.21   0.000    -.5960953   -.3063102
         20  |  -.3398602   .1015316    -3.35   0.001    -.5423586   -.1373618
         30  |  -.4861339   .0764674    -6.36   0.000    -.6386433   -.3336246
         31  |  -.3741275   .0872381    -4.29   0.000    -.5481184   -.2001366
         32  |  -.4327207   .0605261    -7.15   0.000    -.5534361   -.3120053
         33  |  -.4551868   .0693643    -6.56   0.000    -.5935295   -.3168442
         34  |  -.2608366   .1615391    -1.61   0.111    -.5830161    .0613429
         35  |  -.3821596    .053205    -7.18   0.000    -.4882737   -.2760456
             |
       _cons |   .3533593   .0515208     6.86   0.000     .2506043    .4561142
------------------------------------------------------------------------------

. reg pos10s dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(t
> eamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0810
                                                Root MSE          =      .2457

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0067218   .0288962     0.23   0.817    -.0509099    .0643535
   stats_brw |   .0616557   .0428837     1.44   0.155    -.0238732    .1471845
   topic_brw |   -.080773    .045848    -1.76   0.082    -.1722139    .0106679
          t2 |   .0243824   .0357674     0.68   0.498    -.0469535    .0957183
          t3 |   .0197591   .0333387     0.59   0.555    -.0467328    .0862511
             |
     mdegree |
          2  |  -.4157227   .0553528    -7.51   0.000    -.5261205    -.305325
          3  |  -.3934783   .0609778    -6.45   0.000    -.5150947    -.271862
          4  |  -.3415365    .061322    -5.57   0.000    -.4638394   -.2192336
          5  |  -.1832237   .1182598    -1.55   0.126    -.4190854    .0526379
          6  |  -.4168193   .0662774    -6.29   0.000    -.5490055   -.2846332
         20  |  -.3003104   .0946701    -3.17   0.002    -.4891239   -.1114969
         30  |  -.4200138   .0627744    -6.69   0.000    -.5452133   -.2948142
         31  |  -.3412541   .0898371    -3.80   0.000    -.5204286   -.1620796
         32  |  -.4003752   .0556442    -7.20   0.000     -.511354   -.2893964
         33  |  -.4296616   .0675718    -6.36   0.000    -.5644293   -.2948938
         34  |  -.2258682    .161586    -1.40   0.167    -.5481414    .0964049
         35  |  -.3537761   .0489672    -7.22   0.000     -.451438   -.2561141
             |
       _cons |   .3998844    .051062     7.83   0.000     .2980444    .5017244
------------------------------------------------------------------------------

. reg pos10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cl
> uster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0879
                                                Root MSE          =     .24488

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   -.083571   .0390847    -2.14   0.036    -.1615231    -.005619
      group3 |  -.0178641   .0343164    -0.52   0.604    -.0863061    .0505778
   stats_brw |   .0548097   .0393459     1.39   0.168    -.0236632    .1332827
   topic_brw |  -.0874772   .0445349    -1.96   0.053    -.1762992    .0013449
          t2 |   .0166678   .0336988     0.49   0.622    -.0505424     .083878
          t3 |   .0140476    .030617     0.46   0.648     -.047016    .0751112
             |
     mdegree |
          2  |  -.4916512   .0681344    -7.22   0.000     -.627541   -.3557614
          3  |  -.4333929   .0613807    -7.06   0.000    -.5558129   -.3109729
          4  |  -.3873544   .0627021    -6.18   0.000    -.5124098   -.2622989
          5  |  -.2260423   .1044925    -2.16   0.034     -.434446   -.0176387
          6  |  -.4692807    .068162    -6.88   0.000    -.6052255   -.3333359
         20  |  -.3476559   .0901855    -3.85   0.000    -.5275252   -.1677866
         30  |  -.4635187   .0618133    -7.50   0.000    -.5868016   -.3402359
         31  |  -.3812295   .0888932    -4.29   0.000    -.5585214   -.2039376
         32  |  -.4366453   .0602994    -7.24   0.000    -.5569086    -.316382
         33  |  -.4110884   .0618858    -6.64   0.000    -.5345157    -.287661
         34  |  -.2796564   .1719641    -1.63   0.108     -.622628    .0633151
         35  |  -.4245537   .0618985    -6.86   0.000    -.5480063   -.3011012
             |
       _cons |   .4727932   .0638619     7.40   0.000     .3454246    .6001618
------------------------------------------------------------------------------

. *WEIGHTED REGRESSIONS ON OUTLYING NEGATIVE & SIGNIFICANT COEFFICIENTS;
. reg neg10 proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,  clu
> ster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0885
                                                Root MSE          =     .33932

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
       neg10 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0552603   .0226232    -2.44   0.017    -.1003809   -.0101398
   stats_brw |  -.1350325   .0916778    -1.47   0.145    -.3178781    .0478131
   topic_brw |   .2438122   .1001177     2.44   0.017     .0441338    .4434906
          t2 |   .0498755   .0595763     0.84   0.405    -.0689457    .1686968
          t3 |   .0688149   .0806148     0.85   0.396    -.0919661     .229596
             |
     mdegree |
          2  |   .1587962   .1216189     1.31   0.196    -.0837652    .4013575
          3  |   .2857427    .174546     1.64   0.106    -.0623784    .6338638
          4  |   .3133253    .156635     2.00   0.049     .0009268    .6257239
          5  |   .1435813   .1532252     0.94   0.352    -.1620166    .4491793
          6  |   .2674467   .1822582     1.47   0.147    -.0960559    .6309492
         20  |   .2284583    .162689     1.40   0.165    -.0960147    .5529314
         30  |   .6375687   .1539397     4.14   0.000     .3305457    .9445918
         31  |   .2369974   .1678758     1.41   0.162    -.0978204    .5718152
         32  |   .2627675   .1462047     1.80   0.077    -.0288286    .5543636
         33  |   .0890339   .1523834     0.58   0.561    -.2148852     .392953
         34  |   .4022153   .2278607     1.77   0.082    -.0522385     .856669
         35  |   .0447468   .1113115     0.40   0.689    -.1772571    .2667506
             |
       _cons |   .0620722   .1142416     0.54   0.589    -.1657755    .2899199
------------------------------------------------------------------------------

. reg neg10 dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,  clust
> er(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1025
                                                Root MSE          =      .3367

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
       neg10 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.1546275   .0559596    -2.76   0.007    -.2662353   -.0430196
   stats_brw |  -.1280217   .0860082    -1.49   0.141    -.2995596    .0435162
   topic_brw |   .2344543   .0964996     2.43   0.018     .0419919    .4269167
          t2 |   .0760548   .0587204     1.30   0.200    -.0410594     .193169
          t3 |   .0669261   .0756483     0.88   0.379    -.0839496    .2178018
             |
     mdegree |
          2  |   .0941508   .1097492     0.86   0.394     -.124737    .3130386
          3  |   .2430517   .1622353     1.50   0.139    -.0805163    .5666197
          4  |   .2576904   .1433681     1.80   0.077    -.0282483    .5436291
          5  |   .1047938   .1371655     0.76   0.447    -.1687742    .3783619
          6  |   .1946432   .1543449     1.26   0.211    -.1131881    .5024744
         20  |   .1796709   .1545226     1.16   0.249    -.1285146    .4878564
         30  |   .5662326    .133559     4.24   0.000     .2998576    .8326076
         31  |   .1875125   .1518158     1.24   0.221    -.1152746    .4902995
         32  |   .2220953   .1346382     1.65   0.104    -.0464321    .4906227
         33  |  -.0098362   .1424909    -0.07   0.945    -.2940254     .274353
         34  |   .3390738   .1916386     1.77   0.081    -.0431374    .7212851
         35  |  -.0512121   .1049495    -0.49   0.627    -.2605272    .1581031
             |
       _cons |  -.0409172   .1059449    -0.39   0.701    -.2522177    .1703832
------------------------------------------------------------------------------

. reg neg10 group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,
>   cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1177
                                                Root MSE          =     .33399

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
       neg10 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .1689345   .1277433     1.32   0.190    -.0858414    .4237105
      group3 |  -.1066945   .0491088    -2.17   0.033     -.204639   -.0087501
   stats_brw |  -.1096719   .0790304    -1.39   0.170    -.2672931    .0479493
   topic_brw |   .2458734   .1019117     2.41   0.018     .0426169    .4491299
          t2 |   .0930966   .0589435     1.58   0.119    -.0244625    .2106556
          t3 |   .0774988   .0784661     0.99   0.327    -.0789969    .2339944
             |
     mdegree |
          2  |   .2419709   .1777659     1.36   0.178    -.1125719    .5965138
          3  |   .3188269   .1805689     1.77   0.082    -.0413063    .6789602
          4  |   .3468853   .1647661     2.11   0.039     .0182698    .6755009
          5  |   .1856206   .1714246     1.08   0.283     -.156275    .5275162
          6  |   .2960709   .1888761     1.57   0.121    -.0806307    .6727725
         20  |   .2712688   .1784097     1.52   0.133    -.0845581    .6270958
         30  |   .6517669   .1581305     4.12   0.000     .3363855    .9671483
         31  |   .2641339   .1886169     1.40   0.166    -.1120506    .6403184
         32  |   .2945375   .1423431     2.07   0.042      .010643     .578432
         33  |   -.053061   .1399355    -0.38   0.706    -.3321535    .2260315
         34  |   .4453563   .2294138     1.94   0.056     -.012195    .9029076
         35  |   .0887755   .1539883     0.58   0.566    -.2183445    .3958955
             |
       _cons |  -.1826406   .1711601    -1.07   0.290    -.5240086    .1587274
------------------------------------------------------------------------------

. reg neg10s proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,  cl
> uster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1042
                                                Root MSE          =     .29893

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0566388   .0212364    -2.67   0.009    -.0989935   -.0142841
   stats_brw |  -.1592982   .0839256    -1.90   0.062    -.3266826    .0080862
   topic_brw |   .2237407   .0863819     2.59   0.012     .0514574    .3960239
          t2 |   .0451783   .0598424     0.75   0.453    -.0741737    .1645303
          t3 |   .0745234   .0800258     0.93   0.355     -.085083    .2341298
             |
     mdegree |
          2  |   .1876186   .1132735     1.66   0.102    -.0382983    .4135354
          3  |   .2967239   .1736163     1.71   0.092    -.0495429    .6429908
          4  |    .338759   .1529062     2.22   0.030     .0337972    .6437209
          5  |   .1637485   .1463005     1.12   0.267    -.1280386    .4555356
          6  |    .325887   .1838202     1.77   0.081    -.0407308    .6925048
         20  |   .1863446   .1545084     1.21   0.232    -.1218127    .4945018
         30  |   .2712729   .1466167     1.85   0.069    -.0211448    .5636906
         31  |    .260707   .1549119     1.68   0.097     -.048255     .569669
         32  |   .1802121   .1312702     1.37   0.174     -.081598    .4420222
         33  |   .1301846   .1452578     0.90   0.373    -.1595229    .4198921
         34  |   .4402971   .2200444     2.00   0.049     .0014324    .8791618
         35  |    .066095   .1059664     0.62   0.535    -.1452484    .2774384
             |
       _cons |   .0278072   .1020678     0.27   0.786    -.1757606     .231375
------------------------------------------------------------------------------

. reg neg10s dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,  clus
> ter(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1326
                                                Root MSE          =     .29416

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.1734808   .0535617    -3.24   0.002    -.2803062   -.0666554
   stats_brw |  -.1489628    .076559    -1.95   0.056    -.3016549    .0037293
   topic_brw |   .2099617   .0722227     2.91   0.005     .0659181    .3540053
          t2 |   .0736562   .0584102     1.26   0.211    -.0428393    .1901517
          t3 |   .0713797   .0740043     0.96   0.338    -.0762172    .2189767
             |
     mdegree |
          2  |   .1171458   .0961653     1.22   0.227    -.0746499    .3089414
          3  |   .2600633   .1591324     1.63   0.107    -.0573163    .5774429
          4  |   .2876963   .1359713     2.12   0.038     .0165102    .5588824
          5  |   .1232339   .1255499     0.98   0.330    -.1271675    .3736353
          6  |   .2538618   .1488742     1.71   0.093    -.0430584     .550782
         20  |   .1435454   .1454404     0.99   0.327    -.1465263    .4336171
         30  |   .2112977   .1222677     1.73   0.088    -.0325576     .455153
         31  |   .2147007   .1365862     1.57   0.120    -.0577119    .4871133
         32  |   .1445834   .1154241     1.25   0.215    -.0856226    .3747895
         33  |   .0261612   .1319354     0.20   0.843    -.2369756    .2892981
         34  |   .3797413   .1757465     2.16   0.034      .029226    .7302566
         35  |  -.0336334   .0977586    -0.34   0.732    -.2286068      .16134
             |
       _cons |  -.0743643   .0973124    -0.76   0.447    -.2684478    .1197193
------------------------------------------------------------------------------

. reg neg10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] 
> ,  cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1460
                                                Root MSE          =     .29199

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .1415763   .1253134     1.13   0.262    -.1083534    .3915061
      group3 |  -.1333104    .046769    -2.85   0.006    -.2265882   -.0400325
   stats_brw |  -.1335846   .0681663    -1.96   0.054     -.269538    .0023687
   topic_brw |   .2195315   .0793458     2.77   0.007     .0612812    .3777817
          t2 |   .0879381   .0588522     1.49   0.140    -.0294389    .2053151
          t3 |   .0802402   .0771436     1.04   0.302    -.0736179    .2340983
             |
     mdegree |
          2  |   .2410271   .1735011     1.39   0.169      -.10501    .5870642
          3  |   .3235671   .1815006     1.78   0.079    -.0384245    .6855587
          4  |   .3624465   .1618421     2.24   0.028     .0396626    .6852304
          5  |   .1909711   .1629144     1.17   0.245    -.1339513    .5158936
          6  |   .3388637   .1895893     1.79   0.078    -.0392603    .7169878
         20  |   .2203094   .1726042     1.28   0.206    -.1239389    .5645576
         30  |   .2829801   .1495884     1.89   0.063    -.0153645    .5813247
         31  |   .2789136   .1733161     1.61   0.112    -.0667544    .6245817
         32  |   .2052939   .1299501     1.58   0.119    -.0538833    .4644712
         33  |  -.0100634   .1282411    -0.08   0.938    -.2658323    .2457055
         34  |   .4688118   .2145772     2.18   0.032      .040851    .8967726
         35  |   .0836838   .1481221     0.56   0.574    -.2117364     .379104
             |
       _cons |  -.1931361   .1703426    -1.13   0.261    -.5328737    .1466014
------------------------------------------------------------------------------

. *WEIGHTED REGRESSIONS ON OUTLYING POSITIVE & SIGNIFICANT COEFFICIENTS;
. reg pos10 proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,  clu
> ster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0876
                                                Root MSE          =     .30142

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
       pos10 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0224925   .0126894     1.77   0.081    -.0028157    .0478007
   stats_brw |   .1476177   .0572586     2.58   0.012      .033419    .2618163
   topic_brw |  -.1659765   .0694102    -2.39   0.019    -.3044108   -.0275422
          t2 |    .084338   .0394617     2.14   0.036     .0056341    .1630418
          t3 |   .0404812   .0385307     1.05   0.297    -.0363658    .1173282
             |
     mdegree |
          2  |  -.5504515   .0749837    -7.34   0.000    -.7000018   -.4009012
          3  |  -.5189042   .0806629    -6.43   0.000    -.6797813    -.358027
          4  |  -.5207434   .0864421    -6.02   0.000    -.6931469     -.34834
          5  |  -.2689266   .1215535    -2.21   0.030    -.5113575   -.0264957
          6  |  -.5962325   .0948488    -6.29   0.000    -.7854025   -.4070624
         20  |  -.4010221   .1268452    -3.16   0.002    -.6540069   -.1480372
         30  |  -.5633105   .0932026    -6.04   0.000    -.7491973   -.3774238
         31  |  -.5004202   .1046959    -4.78   0.000    -.7092296   -.2916107
         32  |  -.4403868   .0852758    -5.16   0.000     -.610464   -.2703095
         33  |  -.6022513    .094821    -6.35   0.000    -.7913659   -.4131368
         34  |  -.4250661   .1702511    -2.50   0.015    -.7646211   -.0855111
         35  |   -.486732   .0712962    -6.83   0.000    -.6289277   -.3445362
             |
       _cons |   .4534109   .0721304     6.29   0.000     .3095513    .5972706
------------------------------------------------------------------------------

. reg pos10 dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,  clust
> er(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0858
                                                Root MSE          =     .30171

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
       pos10 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0394763   .0293975     1.34   0.184    -.0191553    .0981078
   stats_brw |   .1496919   .0573696     2.61   0.011     .0352718    .2641119
   topic_brw |  -.1687192   .0684906    -2.46   0.016    -.3053194   -.0321189
          t2 |   .0762567   .0390718     1.95   0.055    -.0016696     .154183
          t3 |   .0393606   .0397202     0.99   0.325    -.0398589      .11858
             |
     mdegree |
          2  |  -.5307331   .0748773    -7.09   0.000    -.6800712   -.3813951
          3  |   -.490427   .0780679    -6.28   0.000    -.6461286   -.3347254
          4  |  -.4887739   .0845195    -5.78   0.000    -.6573427   -.3202052
          5  |  -.2543273   .1302562    -1.95   0.055    -.5141151    .0054605
          6  |  -.5625404   .0958211    -5.87   0.000    -.7536496   -.3714312
         20  |  -.3698915   .1272155    -2.91   0.005    -.6236148   -.1161683
         30  |  -.5137164    .086532    -5.94   0.000    -.6862991   -.3411337
         31  |  -.4729048   .1042975    -4.53   0.000    -.6809197     -.26489
         32  |   -.414354   .0857687    -4.83   0.000    -.5854143   -.2432937
         33  |  -.5662121   .0928836    -6.10   0.000    -.7514627   -.3809615
         34  |  -.3928563   .1622329    -2.42   0.018    -.7164197   -.0692928
         35  |  -.4498266   .0680166    -6.61   0.000    -.5854814   -.3141718
             |
       _cons |   .5006296   .0665475     7.52   0.000     .3679047    .6333545
------------------------------------------------------------------------------

. reg pos10 group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,
>   cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0896
                                                Root MSE          =      .3012

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
       pos10 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0752131   .0440031    -1.71   0.092    -.1629746    .0125485
      group3 |   .0181356    .033629     0.54   0.591    -.0489354    .0852065
   stats_brw |   .1415222   .0546503     2.59   0.012     .0325255    .2505188
   topic_brw |  -.1738032   .0662909    -2.62   0.011    -.3060163   -.0415901
          t2 |   .0686694   .0361397     1.90   0.062     -.003409    .1407477
          t3 |   .0346534   .0366031     0.95   0.347    -.0383491    .1076559
             |
     mdegree |
          2  |  -.5965456   .0833423    -7.16   0.000    -.7627667   -.4303246
          3  |  -.5241637   .0803294    -6.53   0.000    -.6843757   -.3639516
          4  |  -.5284853   .0856152    -6.17   0.000    -.6992394   -.3577313
          5  |   -.290313    .120311    -2.41   0.018    -.5302656   -.0503603
          6  |  -.6076981   .0966316    -6.29   0.000    -.8004237   -.4149725
         20  |  -.4106728   .1215211    -3.38   0.001     -.653039   -.1683065
         30  |   -.551798   .0860921    -6.41   0.000    -.7235033   -.3800928
         31  |  -.5070182   .1028902    -4.93   0.000    -.7122263   -.3018101
         32  |  -.4466067   .0858347    -5.20   0.000    -.6177987   -.2754148
         33  |  -.5469676    .087654    -6.24   0.000     -.721788   -.3721471
         34  |  -.4401753    .171178    -2.57   0.012     -.781579   -.0987716
         35  |  -.5121519   .0791531    -6.47   0.000    -.6700177   -.3542861
             |
       _cons |   .5637277   .0764156     7.38   0.000     .4113215    .7161338
------------------------------------------------------------------------------

. reg pos10s proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,  cl
> uster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0853
                                                Root MSE          =     .24105

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |    .017491   .0114083     1.53   0.130    -.0052622    .0402443
   stats_brw |   .0597074   .0408798     1.46   0.149    -.0218248    .1412396
   topic_brw |  -.0773315   .0437603    -1.77   0.082    -.1646087    .0099457
          t2 |   .0309861   .0362855     0.85   0.396     -.041383    .1033552
          t3 |   .0265041   .0317013     0.84   0.406    -.0367221    .0897303
             |
     mdegree |
          2  |  -.4305249   .0550234    -7.82   0.000    -.5402656   -.3207841
          3  |  -.4340204   .0686234    -6.32   0.000    -.5708853   -.2971554
          4  |  -.3885373    .067224    -5.78   0.000    -.5226114   -.2544633
          5  |    -.19937   .1111658    -1.79   0.077    -.4210831    .0223432
          6  |  -.4516603   .0738603    -6.12   0.000    -.5989701   -.3043506
         20  |   -.337588   .1034701    -3.26   0.002    -.5439526   -.1312233
         30  |  -.4882737   .0785969    -6.21   0.000    -.6450303   -.3315171
         31  |  -.3931882   .0840258    -4.68   0.000    -.5607724    -.225604
         32  |  -.4389641   .0625162    -7.02   0.000    -.5636487   -.3142796
         33  |   -.463386   .0722603    -6.41   0.000    -.6075045   -.3192675
         34  |  -.2835799   .1618057    -1.75   0.084    -.6062911    .0391314
         35  |  -.3896921   .0554113    -7.03   0.000    -.5002064   -.2791778
             |
       _cons |   .3629851    .051993     6.98   0.000     .2592884    .4666818
------------------------------------------------------------------------------

. reg pos10s dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,  clus
> ter(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0808
                                                Root MSE          =     .24164

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0036215   .0281573     0.13   0.898    -.0525364    .0597794
   stats_brw |   .0670075   .0434832     1.54   0.128    -.0197169     .153732
   topic_brw |  -.0870255   .0464721    -1.87   0.065    -.1797111    .0056601
          t2 |   .0276729   .0347537     0.80   0.429     -.041641    .0969869
          t3 |    .023452   .0334357     0.70   0.485    -.0432333    .0901374
             |
     mdegree |
          2  |  -.4228014   .0561618    -7.53   0.000    -.5348127   -.3107902
          3  |  -.3990642   .0619134    -6.45   0.000    -.5225465   -.2755818
          4  |  -.3529153   .0611809    -5.77   0.000    -.4749368   -.2308937
          5  |  -.1893884   .1184115    -1.60   0.114    -.4255527    .0467759
          6  |  -.4207757   .0671021    -6.27   0.000    -.5546066   -.2869448
         20  |    -.30037   .0959237    -3.13   0.003    -.4916837   -.1090562
         30  |  -.4259811   .0650817    -6.55   0.000    -.5557825   -.2961798
         31  |  -.3632814    .084996    -4.27   0.000    -.5328006   -.1937622
         32  |  -.4077815   .0578236    -7.05   0.000     -.523107   -.2924561
         33  |  -.4402119   .0702786    -6.26   0.000    -.5803783   -.3000456
         34  |  -.2510197   .1622597    -1.55   0.126    -.5746366    .0725972
         35  |  -.3634773   .0511467    -7.11   0.000    -.4654863   -.2614684
             |
       _cons |   .4058197   .0516819     7.85   0.000     .3027434    .5088959
------------------------------------------------------------------------------

. reg pos10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] 
> ,  cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0877
                                                Root MSE          =     .24083

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0809551   .0378941    -2.14   0.036    -.1565326   -.0053776
      group3 |  -.0193485   .0334539    -0.58   0.565    -.0860702    .0473732
   stats_brw |   .0582141   .0397469     1.46   0.148    -.0210586    .1374868
   topic_brw |  -.0924976   .0446931    -2.07   0.042    -.1816353   -.0033599
          t2 |   .0195064   .0324099     0.60   0.549    -.0451332    .0841459
          t3 |   .0183855    .030677     0.60   0.551    -.0427978    .0795688
             |
     mdegree |
          2  |  -.4936383   .0666805    -7.40   0.000    -.6266284   -.3606483
          3  |  -.4353764   .0616516    -7.06   0.000    -.5583366   -.3124162
          4  |  -.3956584   .0614721    -6.44   0.000    -.5182606   -.2730562
          5  |  -.2281214   .1047972    -2.18   0.033    -.4371328     -.01911
          6  |  -.4693809   .0682101    -6.88   0.000    -.6054216   -.3333401
         20  |  -.3442646   .0904031    -3.81   0.000    -.5245679   -.1639613
         30  |  -.4669701   .0635175    -7.35   0.000    -.5936518   -.3402884
         31  |  -.3999991   .0839314    -4.77   0.000     -.567395   -.2326033
         32  |  -.4424966   .0611928    -7.23   0.000    -.5645418   -.3204513
         33  |  -.4194982   .0644111    -6.51   0.000    -.5479621   -.2910344
         34  |  -.3019513   .1723427    -1.75   0.084    -.6456779    .0417753
         35  |  -.4305608   .0629771    -6.84   0.000    -.5561646   -.3049569
             |
       _cons |   .4737349   .0624556     7.59   0.000     .3491712    .5982986
------------------------------------------------------------------------------

.         *LOGIT REGRESSIONS ON OUTLYING NEGATIVE & SIGNIFICANT COEFFICIENTS;
. quietly logit neg10 proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,
>   cluster(teamid);

. margins, dydx(proindex-topic_brw);

Average marginal effects                                 Number of obs = 1,185
Model VCE: Robust

Expression: Pr(neg10), predict()
dy/dx wrt:  proindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0539033   .0188659    -2.86   0.004    -.0908798   -.0169268
   stats_brw |  -.1459713   .0876662    -1.67   0.096    -.3177939    .0258513
   topic_brw |   .2415555   .0833946     2.90   0.004      .078105     .405006
------------------------------------------------------------------------------

. quietly logit neg10 dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  
> cluster(teamid);

. margins, dydx(dindex-topic_brw);

Average marginal effects                                 Number of obs = 1,185
Model VCE: Robust

Expression: Pr(neg10), predict()
dy/dx wrt:  dindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   -.124093   .0400153    -3.10   0.002    -.2025215   -.0456646
   stats_brw |   -.144296   .0874267    -1.65   0.099    -.3156493    .0270572
   topic_brw |   .2395298   .0917929     2.61   0.009     .0596189    .4194406
------------------------------------------------------------------------------

. quietly logit neg10 group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmod
> el] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,185
Model VCE: Robust

Expression: Pr(neg10), predict()
dy/dx wrt:  group1 group3 stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .1086969   .0669867     1.62   0.105    -.0225946    .2399885
      group3 |  -.0881218   .0402338    -2.19   0.029    -.1669785    -.009265
   stats_brw |  -.1266347    .079878    -1.59   0.113    -.2831927    .0299233
   topic_brw |   .2422435   .0837367     2.89   0.004     .0781227    .4063644
------------------------------------------------------------------------------

. quietly logit neg10s proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] 
> ,  cluster(teamid);

. margins, dydx(proindex-topic_brw);

Average marginal effects                                 Number of obs = 1,133
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  proindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0528035   .0182294    -2.90   0.004    -.0885324   -.0170746
   stats_brw |  -.2018037   .0868671    -2.32   0.020      -.37206   -.0315473
   topic_brw |   .2609845   .0714931     3.65   0.000     .1208605    .4011084
------------------------------------------------------------------------------

. quietly logit neg10s dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] , 
>  cluster(teamid);

. margins, dydx(dindex-topic_brw);

Average marginal effects                                 Number of obs = 1,133
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  dindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.1359619   .0362058    -3.76   0.000     -.206924   -.0649998
   stats_brw |  -.2084953   .0745869    -2.80   0.005     -.354683   -.0623076
   topic_brw |    .268671   .0687826     3.91   0.000     .1338595    .4034825
------------------------------------------------------------------------------

. quietly logit neg10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmo
> del] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,133
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  group1 group3 stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .0608369   .0548139     1.11   0.267    -.0465964    .1682702
      group3 |  -.1157639   .0367857    -3.15   0.002    -.1878627   -.0436652
   stats_brw |  -.1824795   .0682277    -2.67   0.007    -.3162033   -.0487557
   topic_brw |   .2536489   .0616054     4.12   0.000     .1329045    .3743932
------------------------------------------------------------------------------

. *LOGIT REGRESSIONS ON OUTLYING POSITIVE & SIGNIFICANT COEFFICIENTS;
. quietly logit pos10 proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,
>   cluster(teamid);

. margins, dydx(proindex-topic_brw);

Average marginal effects                                 Number of obs = 1,189
Model VCE: Robust

Expression: Pr(pos10), predict()
dy/dx wrt:  proindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0243083   .0172283     1.41   0.158    -.0094586    .0580752
   stats_brw |   .1573332   .0681364     2.31   0.021     .0237882    .2908782
   topic_brw |  -.2090861   .1095562    -1.91   0.056    -.4238123    .0056402
------------------------------------------------------------------------------

. quietly logit pos10 dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  
> cluster(teamid);

. margins, dydx(dindex-topic_brw);

Average marginal effects                                 Number of obs = 1,189
Model VCE: Robust

Expression: Pr(pos10), predict()
dy/dx wrt:  dindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0485882   .0416085     1.17   0.243     -.032963    .1301394
   stats_brw |   .1590162   .0626987     2.54   0.011     .0361289    .2819035
   topic_brw |  -.2166291   .1045423    -2.07   0.038    -.4215282     -.01173
------------------------------------------------------------------------------

. quietly logit pos10 group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmod
> el] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,189
Model VCE: Robust

Expression: Pr(pos10), predict()
dy/dx wrt:  group1 group3 stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.1391241   .0680442    -2.04   0.041    -.2724884   -.0057599
      group3 |   .0240947   .0406436     0.59   0.553    -.0555653    .1037548
   stats_brw |   .1518299   .0641424     2.37   0.018      .026113    .2775468
   topic_brw |  -.2181937   .1020296    -2.14   0.032     -.418168   -.0182195
------------------------------------------------------------------------------

. quietly logit pos10s proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] 
> ,  cluster(teamid);

. margins, dydx(proindex-topic_brw);

Average marginal effects                                 Number of obs = 1,169
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  proindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0205391   .0177263     1.16   0.247    -.0142038     .055282
   stats_brw |   .0618739   .0561796     1.10   0.271    -.0482361    .1719839
   topic_brw |  -.1454811   .1140095    -1.28   0.202    -.3689355    .0779733
------------------------------------------------------------------------------

. quietly logit pos10s dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] , 
>  cluster(teamid);

. margins, dydx(dindex-topic_brw);

Average marginal effects                                 Number of obs = 1,169
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  dindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0001743   .0378866     0.00   0.996     -.074082    .0744306
   stats_brw |   .0814603   .0513763     1.59   0.113    -.0192354    .1821559
   topic_brw |  -.1800337   .1194009    -1.51   0.132    -.4140551    .0539877
------------------------------------------------------------------------------

. quietly logit pos10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmo
> del] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,169
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  group1 group3 stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |    -.14978    .080059    -1.87   0.061    -.3066928    .0071328
      group3 |  -.0151496   .0365098    -0.41   0.678    -.0867074    .0564083
   stats_brw |   .0580289   .0487321     1.19   0.234    -.0374843    .1535421
   topic_brw |  -.1601285   .1154788    -1.39   0.166    -.3864628    .0662059
------------------------------------------------------------------------------

. *LOGIT WEIGHTED REGRESSIONS ON OUTLYING NEGATIVE & SIGNIFICANT COEFFICIENTS;
. quietly logit neg10 proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmod
> el] ,  cluster(teamid);

. margins, dydx(proindex-topic_brw);

Average marginal effects                                 Number of obs = 1,185
Model VCE: Robust

Expression: Pr(neg10), predict()
dy/dx wrt:  proindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0591858    .020344    -2.91   0.004    -.0990593   -.0193122
   stats_brw |   -.146177   .0907367    -1.61   0.107    -.3240176    .0316637
   topic_brw |   .2491118   .0863883     2.88   0.004     .0797939    .4184297
------------------------------------------------------------------------------

. quietly logit neg10 dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel
> ] ,  cluster(teamid);

. margins, dydx(dindex-topic_brw);

Average marginal effects                                 Number of obs = 1,185
Model VCE: Robust

Expression: Pr(neg10), predict()
dy/dx wrt:  dindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   -.132762   .0424381    -3.13   0.002    -.2159391    -.049585
   stats_brw |  -.1483559   .0910897    -1.63   0.103    -.3268885    .0301766
   topic_brw |   .2479711   .0966406     2.57   0.010     .0585589    .4373833
------------------------------------------------------------------------------

. quietly logit neg10 group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore
> /nmodel] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,185
Model VCE: Robust

Expression: Pr(neg10), predict()
dy/dx wrt:  group1 group3 stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .1164426   .0723842     1.61   0.108    -.0254278     .258313
      group3 |  -.0954583   .0412766    -2.31   0.021    -.1763589   -.0145577
   stats_brw |  -.1224279    .080152    -1.53   0.127    -.2795228     .034667
   topic_brw |     .24663   .0858589     2.87   0.004     .0783497    .4149103
------------------------------------------------------------------------------

. quietly logit neg10s proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmo
> del] ,  cluster(teamid);

. margins, dydx(proindex-topic_brw);

Average marginal effects                                 Number of obs = 1,133
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  proindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0588895   .0206369    -2.85   0.004    -.0993372   -.0184419
   stats_brw |  -.1996999    .089271    -2.24   0.025    -.3746678    -.024732
   topic_brw |   .2695216   .0750761     3.59   0.000     .1223752     .416668
------------------------------------------------------------------------------

. quietly logit neg10s dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmode
> l] ,  cluster(teamid);

. margins, dydx(dindex-topic_brw);

Average marginal effects                                 Number of obs = 1,133
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  dindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   -.148493   .0389783    -3.81   0.000     -.224889    -.072097
   stats_brw |   -.213759    .076349    -2.80   0.005    -.3634003   -.0641177
   topic_brw |   .2815277   .0736684     3.82   0.000     .1371402    .4259152
------------------------------------------------------------------------------

. quietly logit neg10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscor
> e/nmodel] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,133
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  group1 group3 stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .0655634   .0602884     1.09   0.277    -.0525997    .1837265
      group3 |  -.1267084   .0380732    -3.33   0.001    -.2013305   -.0520863
   stats_brw |  -.1807805   .0654479    -2.76   0.006    -.3090562   -.0525049
   topic_brw |   .2617821   .0631899     4.14   0.000     .1379321     .385632
------------------------------------------------------------------------------

. *LOGIT WEIGHTED REGRESSIONS ON OUTLYING POSITIVE & SIGNIFICANT COEFFICIENTS;
. quietly logit pos10 proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmod
> el] ,  cluster(teamid);

. margins, dydx(proindex-topic_brw);

Average marginal effects                                 Number of obs = 1,189
Model VCE: Robust

Expression: Pr(pos10), predict()
dy/dx wrt:  proindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0221968   .0161188     1.38   0.168    -.0093955     .053789
   stats_brw |   .1522124   .0652943     2.33   0.020     .0242379    .2801869
   topic_brw |  -.2123753   .1067859    -1.99   0.047    -.4216717   -.0030788
------------------------------------------------------------------------------

. quietly logit pos10 dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel
> ] ,  cluster(teamid);

. margins, dydx(dindex-topic_brw);

Average marginal effects                                 Number of obs = 1,189
Model VCE: Robust

Expression: Pr(pos10), predict()
dy/dx wrt:  dindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |   .0432509   .0395566     1.09   0.274    -.0342787    .1207804
   stats_brw |   .1541771   .0607722     2.54   0.011     .0350658    .2732883
   topic_brw |  -.2171219   .1011059    -2.15   0.032    -.4152858   -.0189579
------------------------------------------------------------------------------

. quietly logit pos10 group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore
> /nmodel] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,189
Model VCE: Robust

Expression: Pr(pos10), predict()
dy/dx wrt:  group1 group3 stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.1307612   .0675949    -1.93   0.053    -.2632447    .0017223
      group3 |   .0217863   .0391693     0.56   0.578    -.0549842    .0985568
   stats_brw |    .145118   .0622242     2.33   0.020     .0231607    .2670752
   topic_brw |  -.2169529   .0985337    -2.20   0.028    -.4100754   -.0238303
------------------------------------------------------------------------------

. quietly logit pos10s proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmo
> del] ,  cluster(teamid);

. margins, dydx(proindex-topic_brw);

Average marginal effects                                 Number of obs = 1,169
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  proindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0164615   .0165647     0.99   0.320    -.0160047    .0489278
   stats_brw |   .0682205    .056203     1.21   0.225    -.0419354    .1783764
   topic_brw |  -.1529564   .1079008    -1.42   0.156    -.3644381    .0585253
------------------------------------------------------------------------------

. quietly logit pos10s dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmode
> l] ,  cluster(teamid);

. margins, dydx(dindex-topic_brw);

Average marginal effects                                 Number of obs = 1,169
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  dindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.0044417   .0371457    -0.12   0.905    -.0772459    .0683626
   stats_brw |   .0854782   .0503225     1.70   0.089    -.0131522    .1841085
   topic_brw |  -.1844565   .1117263    -1.65   0.099     -.403436    .0345229
------------------------------------------------------------------------------

. quietly logit pos10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscor
> e/nmodel] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,169
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  group1 group3 stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.1496844   .0779698    -1.92   0.055    -.3025024    .0031337
      group3 |  -.0181703   .0359573    -0.51   0.613    -.0886453    .0523047
   stats_brw |   .0612976   .0476152     1.29   0.198    -.0320264    .1546216
   topic_brw |  -.1633558   .1084613    -1.51   0.132     -.375936    .0492245
------------------------------------------------------------------------------

. /*
> 
> ********************************************************************;
> 
> *RELATIONSHIP BETWEEN QUALITY OF RESEARCH AND PRO-IMMIGRATION INDEX
> 
> *NOTE HUGE RELATIONSHIP BETWEEN TEAM SIZE AND QUALITY, NO HIGH-QUALITY RESEARCH WHEN
>  ONLY SINGLE AUTHOR;
> tabulate team_size model_cat;
> 
> *PERHAPS USE XDEGREE TO CONTROL FOR DEGREE;
> generate xdegree=mdegree if mdegree==20;
> replace xdegree=mdegree if mdegree==30;
> replace xdegree=mdegree if mdegree==40;
> replace xdegree=mdegree if mdegree==50;
> replace xdegree=0 if xdegree==.;
> 
> 
> generate lowquality=(belief_hypothesis=="Low");
> 
> 
> 
> 
> 
> *FACTOR SCORE AS DEPENDENT VARIABLE;
> reg model_brw proindex     stats_brw topic_brw t2 t3 i.mdegree  [aw=1/nmodel] ,  clu
> ster(teamid);
> reg model_brw dindex     stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  clus
> ter(teamid);
> reg model_brw group1 group3     stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] 
> ,  cluster(teamid);
> 
> 
> 
> 
> 
> 
> 
> *QUALITY MODELS LOSE A LOT OF SINGLETON OBSERVATIONS IF WE USE LOGIT;
> *SO WILL DO LINEAR PROBABILITY MODEL INSTEAD;
> 
> 
> *OLS MODELS ON HIGH QUALITY;
> reg quality proindex     stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] , clust
> er(teamid);
> reg quality dindex     stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] , cluster
> (teamid);
> reg quality group1 group3     stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] , 
> cluster(teamid);
> 
> 
> 
> 
> 
> *LOGIT MODELS ON HIGH QUALITY;
> quietly logit quality proindex     stats_brw topic_brw t2 t3 i.mdegree   [iw=1/nmode
> l] ,  cluster(teamid);
> display e(r2_p);
> margins, dydx(proindex-t3);
> quietly logit quality dindex     stats_brw topic_brw t2 t3 i.mdegree   [iw=1/nmodel]
>  ,  cluster(teamid);
> display e(r2_p);
> margins, dydx(dindex-t3);
> quietly logit quality group1 group3     stats_brw topic_brw t2 t3 i.mdegree   [iw=1/
> nmodel] ,  cluster(teamid);
> display e(r2_p);
> margins, dydx(group1-t3);
> 
> 
> 
> 
> ********************************************************************;
> 
> */
> 
> 
> 
> 
> 
> 
> 
> 
> 
> 
> 
> *RELATIONSHIP BETWEEN NEW MEASURE OF QUALITY OF RESEARCH AND PRO-IMMIGRATION INDEX;
. *NOTE THESE REGRESSIONS LOSE A FEW OBSERVATIONS BECAUSE PEER_MEAN IS NOT AVAILABLE F
> OR 38 OBSERVATIONS;
. summ quality quality2;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     quality |      1,253    .2346369    .4239409          0          1
    quality2 |      1,215    .2271605    .4191697          0          1

. *NOTE HUGE RELATIONSHIP BETWEEN TEAM SIZE AND QUALITY, NO HIGH-QUALITY RESEARCH WHEN
>  ONLY SINGLE AUTHOR;
. tabulate team_size quality;

           |        quality
 team_size |         0          1 |     Total
-----------+----------------------+----------
         1 |       277          0 |       277 
         2 |       360         19 |       379 
         3 |       322        275 |       597 
-----------+----------------------+----------
     Total |       959        294 |     1,253 

. tabulate team_size quality2;

           |       quality2
 team_size |         0          1 |     Total
-----------+----------------------+----------
         1 |       206         71 |       277 
         2 |       330         49 |       379 
         3 |       403        156 |       559 
-----------+----------------------+----------
     Total |       939        276 |     1,215 

. *WEIGHT ALSO BY PEER_N, NUMBER OF REVIEWERS THAT MODEL HAD;
. *NEW REFEREE SCORE MEASURE AS DEPENDENT VARIABLE;
. reg peer_mean proindex     stats_brw topic_brw t2 t3 i.mdegree  [aw=peer_n/nmodel] ,
>   cluster(teamid);
(sum of wgt is 647.0125)

Linear regression                               Number of obs     =      1,215
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2362
                                                Root MSE          =     .48485

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
   peer_mean | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0586911    .039825    -1.47   0.145    -.1381195    .0207373
   stats_brw |  -.4007139    .133237    -3.01   0.004    -.6664466   -.1349811
   topic_brw |   .5823774   .2134394     2.73   0.008     .1566859    1.008069
          t2 |  -.2109728   .1681093    -1.25   0.214    -.5462563    .1243106
          t3 |   .1638627    .189755     0.86   0.391    -.2145917     .542317
             |
     mdegree |
          2  |   2.123483   .1731584    12.26   0.000     1.778129    2.468837
          3  |   1.599148   .2469655     6.48   0.000      1.10659    2.091705
          4  |   1.763581   .2277744     7.74   0.000       1.3093    2.217863
          5  |   1.815219   .2279659     7.96   0.000     1.360555    2.269883
          6  |   1.592366   .2839348     5.61   0.000     1.026076    2.158656
         20  |   1.899043   .2468061     7.69   0.000     1.406804    2.391282
         30  |   1.944359   .2892543     6.72   0.000      1.36746    2.521258
         31  |   1.689905   .3910458     4.32   0.000     .9099891    2.469822
         32  |   1.495566   .2713282     5.51   0.000      .954419    2.036713
         33  |   1.701338   .3164564     5.38   0.000     1.070185     2.33249
         34  |   2.042178   .3509736     5.82   0.000     1.342183    2.742173
         35  |   1.686604   .2552247     6.61   0.000     1.177575    2.195634
             |
       _cons |   2.839699   .1974179    14.38   0.000     2.445961    3.233436
------------------------------------------------------------------------------

. reg peer_mean dindex     stats_brw topic_brw t2 t3 i.mdegree   [aw=peer_n/nmodel] , 
>  cluster(teamid);
(sum of wgt is 647.0125)

Linear regression                               Number of obs     =      1,215
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3011
                                                Root MSE          =     .46381

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
   peer_mean | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.3664553   .1241577    -2.95   0.004    -.6140799   -.1188306
   stats_brw |   -.375164   .1411651    -2.66   0.010     -.656709   -.0936191
   topic_brw |     .53098   .1964802     2.70   0.009     .1391126    .9228475
          t2 |  -.1525818   .1715522    -0.89   0.377    -.4947319    .1895682
          t3 |   .1563702   .1828257     0.86   0.395    -.2082642    .5210045
             |
     mdegree |
          2  |   2.028928      .1824    11.12   0.000     1.665143    2.392714
          3  |   1.683651   .2546324     6.61   0.000     1.175803      2.1915
          4  |   1.815859   .2248806     8.07   0.000     1.367349    2.264369
          5  |   1.782328   .2220055     8.03   0.000     1.339553    2.225104
          6  |   1.594674   .2442374     6.53   0.000     1.107558     2.08179
         20  |   1.941681   .2562547     7.58   0.000     1.430597    2.452764
         30  |   2.062124   .2790357     7.39   0.000     1.505604    2.618643
         31  |   1.686736   .3701396     4.56   0.000     .9485154    2.424956
         32  |   1.607896   .2849446     5.64   0.000     1.039592      2.1762
         33  |   1.584268   .3200191     4.95   0.000     .9460105    2.222527
         34  |   1.983014    .315068     6.29   0.000      1.35463    2.611397
         35  |   1.576938   .2558879     6.16   0.000     1.066586    2.087291
             |
       _cons |   2.746152   .1706775    16.09   0.000     2.405746    3.086557
------------------------------------------------------------------------------

. reg peer_mean group1 group3     stats_brw topic_brw t2 t3 i.mdegree   [aw=peer_n/nmo
> del] ,  cluster(teamid);
(sum of wgt is 647.0125)

Linear regression                               Number of obs     =      1,215
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3345
                                                Root MSE          =     .45279

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
   peer_mean | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.3774391   .1455735    -2.59   0.012    -.6677762   -.0871019
      group3 |   -.532691   .1401495    -3.80   0.000    -.8122103   -.2531717
   stats_brw |  -.3679233   .1314116    -2.80   0.007    -.6300154   -.1058311
   topic_brw |   .4417918    .190418     2.32   0.023      .062015    .8215686
          t2 |  -.2109566   .1631696    -1.29   0.200    -.5363881    .1144749
          t3 |   .0720113   .1798289     0.40   0.690    -.2866461    .4306688
             |
     mdegree |
          2  |   1.634157   .2260112     7.23   0.000     1.183392    2.084922
          3  |   1.550509   .2437361     6.36   0.000     1.064393    2.036625
          4  |   1.631701   .2269662     7.19   0.000     1.179031    2.084371
          5  |   1.584051   .2238379     7.08   0.000      1.13762    2.030481
          6  |   1.359277   .2393974     5.68   0.000      .881814     1.83674
         20  |   1.745456   .2741672     6.37   0.000     1.198647    2.292265
         30  |   1.943895   .2653069     7.33   0.000     1.414757    2.473032
         31  |   1.514016   .3491724     4.34   0.000     .8176132    2.210418
         32  |   1.494948   .2579845     5.79   0.000      .980414    2.009482
         33  |   1.681806    .312817     5.38   0.000     1.057913      2.3057
         34  |   1.733569   .2949439     5.88   0.000     1.145322    2.321816
         35  |   1.285301   .2510154     5.12   0.000     .7846663    1.785935
             |
       _cons |   3.114763   .2083061    14.95   0.000      2.69931    3.530217
------------------------------------------------------------------------------

. *QUALITY MODELS LOSE A LOT OF SINGLETON OBSERVATIONS IF WE USE LOGIT;
. *SO WILL DO LINEAR PROBABILITY MODEL INSTEAD;
. *OLS MODELS ON HIGH quality2;
. reg quality2 proindex     stats_brw topic_brw t2 t3 i.mdegree   [aw=peer_n/nmodel] ,
>  cluster(teamid);
(sum of wgt is 647.0125)

Linear regression                               Number of obs     =      1,215
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2159
                                                Root MSE          =     .41225

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
    quality2 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0165663   .0449887    -0.37   0.714    -.1062934    .0731608
   stats_brw |  -.2668151   .1414961    -1.89   0.063    -.5490202      .01539
   topic_brw |   .2393167   .1577016     1.52   0.134    -.0752091    .5538425
          t2 |  -.1165092   .1678345    -0.69   0.490    -.4512445     .218226
          t3 |   .1879643   .1958391     0.96   0.340    -.2026245    .5785532
             |
     mdegree |
          2  |   1.362518   .1729155     7.88   0.000     1.017649    1.707387
          3  |   .5820749   .2913359     2.00   0.050     .0010238    1.163126
          4  |   .6858305   .2351156     2.92   0.005     .2169072    1.154754
          5  |   .7530931   .2365607     3.18   0.002     .2812876    1.224899
          6  |    .441673   .2599075     1.70   0.094    -.0766961    .9600421
         20  |   .6906031   .3290343     2.10   0.039     .0343648    1.346841
         30  |   1.160507   .2495125     4.65   0.000     .6628699    1.658144
         31  |   .7148789   .3867957     1.85   0.069    -.0565608    1.486319
         32  |   .4430589   .2530162     1.75   0.084     -.061566    .9476839
         33  |   .2016621   .3140872     0.64   0.523     -.424765    .8280892
         34  |   .9557149    .382387     2.50   0.015      .193068    1.718362
         35  |   .6049211   .2376051     2.55   0.013     .1310326     1.07881
             |
       _cons |  -.2778853    .227468    -1.22   0.226     -.731556    .1757853
------------------------------------------------------------------------------

. reg quality2 dindex     stats_brw topic_brw t2 t3 i.mdegree   [aw=peer_n/nmodel] , c
> luster(teamid);
(sum of wgt is 647.0125)

Linear regression                               Number of obs     =      1,215
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2576
                                                Root MSE          =     .40113

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
    quality2 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.2234663   .1276896    -1.75   0.084    -.4781351    .0312026
   stats_brw |  -.2589959   .1517106    -1.71   0.092    -.5615731    .0435813
   topic_brw |   .2152898   .1486491     1.45   0.152    -.0811815    .5117611
          t2 |  -.0801419   .1839046    -0.44   0.664    -.4469281    .2866443
          t3 |   .1910224   .1903301     1.00   0.319    -.1885791    .5706239
             |
     mdegree |
          2  |   1.334179   .1897935     7.03   0.000     .9556477     1.71271
          3  |   .6823652   .3285588     2.08   0.041     .0270754    1.337655
          4  |   .7780694   .2699861     2.88   0.005      .239599     1.31654
          5  |   .7567545   .2539175     2.98   0.004      .250332    1.263177
          6  |   .4958552   .2992353     1.66   0.102    -.1009509    1.092661
         20  |   .7679105   .3135483     2.45   0.017     .1425582    1.393263
         30  |   1.309728    .287308     4.56   0.000     .7367103    1.882746
         31  |   .7544369   .4060867     1.86   0.067    -.0554774    1.564351
         32  |   .5503786   .2795379     1.97   0.053    -.0071421    1.107899
         33  |   .1651172   .3562017     0.46   0.644    -.5453047    .8755392
         34  |    .963811   .3808963     2.53   0.014     .2041372    1.723485
         35  |   .5691037   .2763134     2.06   0.043     .0180141    1.120193
             |
       _cons |   -.305456   .1949441    -1.57   0.122    -.6942598    .0833478
------------------------------------------------------------------------------

. reg quality2 group1 group3     stats_brw topic_brw t2 t3 i.mdegree   [aw=peer_n/nmod
> el] , cluster(teamid);
(sum of wgt is 647.0125)

Linear regression                               Number of obs     =      1,215
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3107
                                                Root MSE          =     .38669

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
    quality2 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.3992866   .1867296    -2.14   0.036    -.7717071   -.0268662
      group3 |  -.3993243   .1425436    -2.80   0.007    -.6836185   -.1150301
   stats_brw |   -.251336   .1422082    -1.77   0.082    -.5349612    .0322892
   topic_brw |    .120939   .1502356     0.80   0.424    -.1786964    .4205744
          t2 |  -.1418956   .1833432    -0.77   0.442    -.5075622    .2237709
          t3 |   .1017806   .1970513     0.52   0.607    -.2912258     .494787
             |
     mdegree |
          2  |    .916557   .2456847     3.73   0.000     .4265544     1.40656
          3  |   .5415161   .3045485     1.78   0.080    -.0658867    1.148919
          4  |   .5832514   .2553826     2.28   0.025     .0739069    1.092596
          5  |   .5469996   .2403288     2.28   0.026     .0676788     1.02632
          6  |   .2468327   .3128582     0.79   0.433    -.3771432    .8708087
         20  |   .5603274   .2700582     2.07   0.042     .0217132    1.098942
         30  |   1.184655   .2567754     4.61   0.000     .6725329    1.696778
         31  |   .5717192   .3541088     1.61   0.111    -.1345286    1.277967
         32  |   .4308926   .2358813     1.83   0.072    -.0395579    .9013431
         33  |   .2683011     .35564     0.75   0.453    -.4410006    .9776028
         34  |   .6999277   .3284021     2.13   0.037     .0449503    1.354905
         35  |   .2605851   .2465207     1.06   0.294     -.231085    .7522553
             |
       _cons |    .084492   .2355819     0.36   0.721    -.3853613    .5543453
------------------------------------------------------------------------------

. *LOGIT MODELS ON HIGH quality2;
. quietly logit quality2 proindex     stats_brw topic_brw t2 t3 i.mdegree   [iw=peer_n
> /nmodel] ,  cluster(teamid);

. display e(r2_p);
.1254668

.  margins, dydx(proindex-t3);

Average marginal effects                                 Number of obs = 1,119
Model VCE: Robust

Expression: Pr(quality2), predict()
dy/dx wrt:  proindex stats_brw topic_brw t2 t3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0085196   .0467872    -0.18   0.856    -.1002208    .0831816
   stats_brw |  -.2541764    .140746    -1.81   0.071    -.5300336    .0216807
   topic_brw |   .2528631   .1660006     1.52   0.128    -.0724921    .5782184
          t2 |  -.1270859   .1805043    -0.70   0.481    -.4808677     .226696
          t3 |    .167839   .1739676     0.96   0.335    -.1731313    .5088093
------------------------------------------------------------------------------

. quietly logit quality2 dindex     stats_brw topic_brw t2 t3 i.mdegree   [iw=peer_n/n
> model] ,  cluster(teamid);

. display e(r2_p);
.16471667

.  margins, dydx(dindex-t3);

Average marginal effects                                 Number of obs = 1,119
Model VCE: Robust

Expression: Pr(quality2), predict()
dy/dx wrt:  dindex stats_brw topic_brw t2 t3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.1955784   .0992406    -1.97   0.049    -.3900864   -.0010705
   stats_brw |  -.2304056   .1506286    -1.53   0.126    -.5256322     .064821
   topic_brw |   .2247803   .1543782     1.46   0.145    -.0777954     .527356
          t2 |  -.1149518   .2017402    -0.57   0.569    -.5103554    .2804519
          t3 |   .1477785   .1686257     0.88   0.381    -.1827218    .4782789
------------------------------------------------------------------------------

. quietly logit quality2 group1 group3     stats_brw topic_brw t2 t3 i.mdegree   [iw=p
> eer_n/nmodel] ,  cluster(teamid);

. display e(r2_p);
.21611746

.  margins, dydx(group1-t3);

Average marginal effects                                 Number of obs = 1,119
Model VCE: Robust

Expression: Pr(quality2), predict()
dy/dx wrt:  group1 group3 stats_brw topic_brw t2 t3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.3288398   .1630483    -2.02   0.044    -.6484085    -.009271
      group3 |  -.3174614   .1116726    -2.84   0.004    -.5363357    -.098587
   stats_brw |  -.2527804   .1445083    -1.75   0.080    -.5360115    .0304507
   topic_brw |   .1678192   .1591424     1.05   0.292    -.1440942    .4797326
          t2 |  -.1668043   .1944404    -0.86   0.391    -.5479004    .2142918
          t3 |   .0687126   .1772202     0.39   0.698    -.2786327    .4160579
------------------------------------------------------------------------------

. ********************************************************************;
. *SAVE MODEL LEVEL DATA FOR GRAPHS;
. save /volumes/ddisk/mi/researcher/model.dta, replace;
file /volumes/ddisk/mi/researcher/model.dta saved

. *********************************************************************;
. *DESCRIPTIVE TABLE AT THE MODEL LEVEL;
. tabulate topic_knowledge, sum(topic_brw);

TOPIC_KNOWL |       Summary of topic_ipred
       EDGE |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |   .27234222   .39773482         390
        Low |  -.26715929   .02579929         378
        Mid |  -.10503227   .05089555         485
------------+------------------------------------
      Total |  -.03648316   .31296556       1,253

. tabulate statistics_skill, sum(stats_brw);

STATISTICS_ |       Summary of stats_ipred
      SKILL |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |   .73442269   .24230561         178
        Low |  -.51687865   .25222262         282
        Mid |  -.03007244   .17214468         793
------------+------------------------------------
      Total |  -.03102952   .42165622       1,253

. tabulate model_score, sum(model_brw);

            |        Summary of model_brw
MODEL_SCORE |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |   .59514352   .03268489         294
        Low |   .31438404   .03962311         417
        Mid |   .46895185   .04982655         542
------------+------------------------------------
      Total |   .44712071   .11429906       1,253

. generate hmodel=(model_score=="High");

. summ dindex group1 group2 group3;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      dindex |      1,253    .5706305    .4951838          0          1
      group1 |      1,253    .1069433    .3091646          0          1
      group2 |      1,253    .3224262    .4675917          0          1
      group3 |      1,253    .5706305    .4951838          0          1

. tabulate dindex group3;

           |        group3
    dindex |         0          1 |     Total
-----------+----------------------+----------
         0 |       538          0 |       538 
         1 |         0        715 |       715 
-----------+----------------------+----------
     Total |       538        715 |     1,253 

. summ ame neg10 pos10 negsig possig neg10s pos10s proindex dindex p12 p34 p56 group1 
> group2 group3 pbelief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej hstats-hmodel 
> ;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |      1,253    .0007771    .1865197  -1.353765       2.47
       neg10 |      1,253    .1005587    .3008635          0          1
       pos10 |      1,253    .1005587    .3008635          0          1
      negsig |      1,253    .2466081    .4312087          0          1
      possig |      1,253    .1859537    .3892247          0          1
-------------+---------------------------------------------------------
      neg10s |      1,253    .0630487    .2431475          0          1
      pos10s |      1,253    .0526736    .2234702          0          1
    proindex |      1,253    4.462357    1.135022          1          6
      dindex |      1,253    .5706305    .4951838          0          1
         p12 |      1,253    .0782123    .2255071          0          1
-------------+---------------------------------------------------------
         p34 |      1,253    .3812184    .3933172          0          1
         p56 |      1,253    .5405693    .4084319          0          1
      group1 |      1,253    .1069433    .3091646          0          1
      group2 |      1,253    .3224262    .4675917          0          1
      group3 |      1,253    .5706305    .4951838          0          1
-------------+---------------------------------------------------------
     pbelief |      1,253    .5810056    .4018672          0          1
      nmodel |      1,253    39.14525    32.66706          1        112
   team_size |      1,253    2.255387    .7954926          1          3
   stats_brw |      1,253   -.0310295    .4216562  -1.352966   1.099596
   topic_brw |      1,253   -.0364832    .3129656  -.3396846   1.210172
-------------+---------------------------------------------------------
   model_brw |      1,253    .4471207    .1142991   .1488998   .7288508
   peer_mean |      1,215    4.203944    .5266504          2   5.666667
     quality |      1,253    .2346369    .4239409          0          1
    quality2 |      1,215    .2271605    .4191697          0          1
        hrej |      1,253    .6799681    .4666747          0          1
-------------+---------------------------------------------------------
      hstats |      1,253    .1420591    .3492501          0          1
      htopic |      1,253     .311253    .4631909          0          1
     hbelief |      1,253    .1835595    .3872791          0          1
         dep |      1,253    5.246608    3.242933          1         11
      negsig |      1,253    .2466081    .4312087          0          1
-------------+---------------------------------------------------------
      possig |      1,253    .1859537    .3892247          0          1
       pos10 |      1,253    .1005587    .3008635          0          1
       neg10 |      1,253    .1005587    .3008635          0          1
      pos10s |      1,253    .0526736    .2234702          0          1
      neg10s |      1,253    .0630487    .2431475          0          1
-------------+---------------------------------------------------------
      hmodel |      1,253    .2346369    .4239409          0          1

. summ ame neg10 pos10 negsig possig neg10s pos10s proindex dindex p12 p34 p56 group1 
> group2 group3 pbelief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej hstats-hmodel 
> if index==1 ;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |        134   -.0188496    .0971865    -.40887     .42193
       neg10 |        134    .1492537    .3576755          0          1
       pos10 |        134    .0522388    .2233432          0          1
      negsig |        134    .2761194    .4487542          0          1
      possig |        134    .2238806    .4184071          0          1
-------------+---------------------------------------------------------
      neg10s |        134     .119403    .3254789          0          1
      pos10s |        134    .0373134    .1902399          0          1
    proindex |        134    2.422886    .9508947          1   3.666667
      dindex |        134           0           0          0          0
         p12 |        134    .6318408    .3173319   .3333333          1
-------------+---------------------------------------------------------
         p34 |        134    .2636816    .2488894          0   .6666667
         p56 |        134    .1044776    .1552098          0   .3333333
      group1 |        134           1           0          1          1
      group2 |        134           0           0          0          0
      group3 |        134           0           0          0          0
-------------+---------------------------------------------------------
     pbelief |        134    .7263682    .3266261          0          1
      nmodel |        134    18.83582     6.23499          2         24
   team_size |        134    2.283582    .9144779          1          3
   stats_brw |        134    -.189059    .5281624  -1.352966   .6680702
   topic_brw |        134   -.0596654    .1766918  -.2844923    .233174
-------------+---------------------------------------------------------
   model_brw |        134    .4336417    .1041899   .2631785   .5655868
   peer_mean |        134    4.221775     .463432   3.142857        5.2
     quality |        134    .1940299    .3969359          0          1
    quality2 |        134    .1641791     .371828          0          1
        hrej |        134    .9402985     .237822          0          1
-------------+---------------------------------------------------------
      hstats |        134    .0447761    .2075881          0          1
      htopic |        134     .358209    .4812731          0          1
     hbelief |        134    .2238806    .4184071          0          1
         dep |        134    4.970149    3.276575          1         11
      negsig |        134    .2761194    .4487542          0          1
-------------+---------------------------------------------------------
      possig |        134    .2238806    .4184071          0          1
       pos10 |        134    .0522388    .2233432          0          1
       neg10 |        134    .1492537    .3576755          0          1
      pos10s |        134    .0373134    .1902399          0          1
      neg10s |        134     .119403    .3254789          0          1
-------------+---------------------------------------------------------
      hmodel |        134    .1940299    .3969359          0          1

. summ ame neg10 pos10 negsig possig neg10s pos10s proindex dindex p12 p34 p56 group1 
> group2 group3 pbelief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej hstats-hmodel 
> if index==2;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |        404   -.0097988    .1233201  -1.353765   1.306339
       neg10 |        404    .1064356    .3087768          0          1
       pos10 |        404    .0792079    .2703979          0          1
      negsig |        404    .2970297    .4575163          0          1
      possig |        404    .1559406    .3632489          0          1
-------------+---------------------------------------------------------
      neg10s |        404    .0940594    .2922733          0          1
      pos10s |        404     .049505    .2171888          0          1
    proindex |        404    3.848185    .4948586          3   4.666667
      dindex |        404           0           0          0          0
         p12 |        404           0           0          0          0
-------------+---------------------------------------------------------
         p34 |        404     .869637    .1628664   .6666667          1
         p56 |        404     .130363    .1628665          0   .3333333
      group1 |        404           0           0          0          0
      group2 |        404           1           0          1          1
      group3 |        404           0           0          0          0
-------------+---------------------------------------------------------
     pbelief |        404    .3663366    .3599925          0          1
      nmodel |        404    50.71287    39.76166          2        112
   team_size |        404    2.554455    .7041211          1          3
   stats_brw |        404    -.147368    .3657803  -.9406251    .813791
   topic_brw |        404   -.0967982     .228128    -.30488   .8381723
-------------+---------------------------------------------------------
   model_brw |        404    .4987117     .109167   .3257702   .6065403
   peer_mean |        380    4.505764    .3088112   3.714286   5.666667
     quality |        404     .490099    .5005218          0          1
    quality2 |        380    .3842105    .4870493          0          1
        hrej |        404    .7128713    .4529831          0          1
-------------+---------------------------------------------------------
      hstats |        404    .1534653    .3608824          0          1
      htopic |        404    .1980198    .3990013          0          1
     hbelief |        404    .0049505    .0702724          0          1
         dep |        404     5.25495    3.285709          1         11
      negsig |        404    .2970297    .4575163          0          1
-------------+---------------------------------------------------------
      possig |        404    .1559406    .3632489          0          1
       pos10 |        404    .0792079    .2703979          0          1
       neg10 |        404    .1064356    .3087768          0          1
      pos10s |        404     .049505    .2171888          0          1
      neg10s |        404    .0940594    .2922733          0          1
-------------+---------------------------------------------------------
      hmodel |        404     .490099    .5005218          0          1

. summ ame neg10 pos10 negsig possig neg10s pos10s proindex dindex p12 p34 p56 group1 
> group2 group3 pbelief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej hstats-hmodel 
> if index==3;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |        715    .0104311    .2245698   -1.13019       2.47
       neg10 |        715    .0881119     .283656          0          1
       pos10 |        715    .1216783    .3271428          0          1
      negsig |        715    .2125874    .4094245          0          1
      possig |        715    .1958042    .3970963          0          1
-------------+---------------------------------------------------------
      neg10s |        715     .034965    .1838199          0          1
      pos10s |        715    .0573427    .2326589          0          1
    proindex |        715    5.191608    .6524806          4          6
      dindex |        715           1           0          1          1
         p12 |        715     .018648    .0766582          0   .3333333
-------------+---------------------------------------------------------
         p34 |        715    .1272727    .2064037          0         .5
         p56 |        715    .8540793    .2091066         .5          1
      group1 |        715           0           0          0          0
      group2 |        715           0           0          0          0
      group3 |        715           1           0          1          1
-------------+---------------------------------------------------------
     pbelief |        715    .6750583    .3889316          0          1
      nmodel |        715    36.41538    28.47889          1         96
   team_size |        715    2.081119    .7699677          1          3
   stats_brw |        715    .0643225    .4035249  -.8630697   1.099596
   topic_brw |        715    .0019416    .3645869  -.3396846   1.210172
-------------+---------------------------------------------------------
   model_brw |        715    .4204961    .1091312   .1488998   .7288508
   peer_mean |        701    4.036924    .5577951          2       5.25
     quality |        715    .0979021    .2973903          0          1
    quality2 |        701    .1540656    .3612694          0          1
        hrej |        715    .6125874    .4875002          0          1
-------------+---------------------------------------------------------
      hstats |        715    .1538462    .3610538          0          1
      htopic |        715    .3664336    .4821672          0          1
     hbelief |        715    .2769231    .4477914          0          1
         dep |        715    5.293706    3.214185          1         11
      negsig |        715    .2125874    .4094245          0          1
-------------+---------------------------------------------------------
      possig |        715    .1958042    .3970963          0          1
       pos10 |        715    .1216783    .3271428          0          1
       neg10 |        715    .0881119     .283656          0          1
      pos10s |        715    .0573427    .2326589          0          1
      neg10s |        715     .034965    .1838199          0          1
-------------+---------------------------------------------------------
      hmodel |        715    .0979021    .2973903          0          1

. *SUMMARY STATS WEIGHTED BY THE INVERSE OF THE NUMBER OF MODELS;
. summ ame neg10 pos10 negsig possig neg10s pos10s proindex dindex p12 p34 p56 group1 
> group2 group3 pbelief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej hstats-hmodel 
>  [aw=1/nmodel];

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
         ame |   1,253          71   -.0085083   .2038202  -1.353765       2.47
       neg10 |   1,253          71    .1382308   .3452798          0          1
       pos10 |   1,253          71    .1143123   .3183172          0          1
      negsig |   1,253          71     .318356   .4660244          0          1
      possig |   1,253          71    .1916886   .3937865          0          1
-------------+-----------------------------------------------------------------
      neg10s |   1,253          71    .1026884   .3036726          0          1
      pos10s |   1,253          71     .069587   .2545512          0          1
    proindex |   1,253          71    4.300469    1.10691          1          6
      dindex |   1,253          71    .6197183   .4856498          0          1
         p12 |   1,253          71    .0938967   .2514385          0          1
-------------+-----------------------------------------------------------------
         p34 |   1,253          71    .3967136   .3830483          0          1
         p56 |   1,253          71    .5093897   .4005581          0          1
      group1 |   1,253          71    .1267606   .3328374          0          1
      group2 |   1,253          71    .2535211   .4352003          0          1
      group3 |   1,253          71    .6197183   .4856498          0          1
-------------+-----------------------------------------------------------------
     pbelief |   1,253          71    .5492958    .387144          0          1
      nmodel |   1,253          71    17.64789   19.48554          1        112
   team_size |   1,253          71    2.239437   .7595613          1          3
   stats_brw |   1,253          71   -.0143092   .4385116  -1.352966   1.099596
   topic_brw |   1,253          71   -.0086646   .2867097  -.3396846   1.210172
-------------+-----------------------------------------------------------------
   model_brw |   1,253          71    .4356287   .1163981   .1488998   .7288508
   peer_mean |   1,215      69.625    4.231731   .6211737          2   5.666667
     quality |   1,253          71    .2042254   .4032954          0          1
    quality2 |   1,215      69.625    .3105326   .4629022          0          1
        hrej |   1,253          71    .6455399   .4785404          0          1
-------------+-----------------------------------------------------------------
      hstats |   1,253          71    .1971831   .3980306          0          1
      htopic |   1,253          71    .3239437   .4681657          0          1
     hbelief |   1,253          71    .1267606   .3328374          0          1
         dep |   1,253          71    5.784943   2.995869          1         11
      negsig |   1,253          71     .318356   .4660244          0          1
-------------+-----------------------------------------------------------------
      possig |   1,253          71    .1916886   .3937865          0          1
       pos10 |   1,253          71    .1143123   .3183172          0          1
       neg10 |   1,253          71    .1382308   .3452798          0          1
      pos10s |   1,253          71     .069587   .2545512          0          1
      neg10s |   1,253          71    .1026884   .3036726          0          1
-------------+-----------------------------------------------------------------
      hmodel |   1,253          71    .2042254   .4032954          0          1

. summ ame neg10 pos10 negsig possig neg10s pos10s proindex dindex p12 p34 p56 group1 
> group2 group3 pbelief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej hstats-hmodel 
> if index==1  [aw=1/nmodel];

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
         ame |     134           9   -.0444999   .1254703    -.40887     .42193
       neg10 |     134           9    .2561728   .4381564          0          1
       pos10 |     134           9     .058642    .235835          0          1
      negsig |     134           9    .3487654   .4783679          0          1
      possig |     134           9    .1867284   .3911556          0          1
-------------+-----------------------------------------------------------------
      neg10s |     134           9    .2283951   .4213737          0          1
      pos10s |     134           9    .0432099   .2040922          0          1
    proindex |     134           9     2.37037   .9256753          1   3.666667
      dindex |     134           9           0          0          0          0
         p12 |     134           9    .6666667   .3154489   .3333333          1
-------------+-----------------------------------------------------------------
         p34 |     134           9    .2592593   .2628741          0   .6666667
         p56 |     134           9    .0740741   .1390999          0   .3333333
      group1 |     134           9           1          0          1          1
      group2 |     134           9           0          0          0          0
      group3 |     134           9           0          0          0          0
-------------+-----------------------------------------------------------------
     pbelief |     134           9    .7037037   .3325124          0          1
      nmodel |     134           9    14.88889   7.694627          2         24
   team_size |     134           9    2.222222   .9196838          1          3
   stats_brw |     134           9   -.2616901   .5862244  -1.352966   .6680702
   topic_brw |     134           9   -.0896879   .1534702  -.2844923    .233174
-------------+-----------------------------------------------------------------
   model_brw |     134           9    .4317806   .1071579   .2631785   .5655868
   peer_mean |     134           9    4.249944   .5633377   3.142857        5.2
     quality |     134           9    .2222222   .4172997          0          1
    quality2 |     134           9    .2592593   .4398725          0          1
        hrej |     134           9    .8518519   .3565798          0          1
-------------+-----------------------------------------------------------------
      hstats |     134           9    .1111111   .3154489          0          1
      htopic |     134           9    .2222222   .4172997          0          1
     hbelief |     134           9    .2222222   .4172997          0          1
         dep |     134           9    5.305556   3.233712          1         11
      negsig |     134           9    .3487654   .4783679          0          1
-------------+-----------------------------------------------------------------
      possig |     134           9    .1867284   .3911556          0          1
       pos10 |     134           9     .058642    .235835          0          1
       neg10 |     134           9    .2561728   .4381564          0          1
      pos10s |     134           9    .0432099   .2040922          0          1
      neg10s |     134           9    .2283951   .4213737          0          1
-------------+-----------------------------------------------------------------
      hmodel |     134           9    .2222222   .4172997          0          1

. summ ame neg10 pos10 negsig possig neg10s pos10s proindex dindex p12 p34 p56 group1 
> group2 group3 pbelief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej hstats-hmodel 
> if index==2 [aw=1/nmodel];

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
         ame |     404          18   -.0177386   .2451826  -1.353765   1.306339
       neg10 |     404          18    .1677414   .3740998          0          1
       pos10 |     404          18    .1120701   .3158438          0          1
      negsig |     404          18    .4004575   .4905987          0          1
      possig |     404          18     .238685   .4268083          0          1
-------------+-----------------------------------------------------------------
      neg10s |     404          18    .1579034   .3651026          0          1
      pos10s |     404          18     .095205   .2938618          0          1
    proindex |     404          18    3.657407   .4253441          3   4.666667
      dindex |     404          18           0          0          0          0
         p12 |     404          18           0          0          0          0
-------------+-----------------------------------------------------------------
         p34 |     404          18    .9444444     .12438   .6666667          1
         p56 |     404          18    .0555556     .12438          0   .3333333
      group1 |     404          18           0          0          0          0
      group2 |     404          18           1          0          1          1
      group3 |     404          18           0          0          0          0
-------------+-----------------------------------------------------------------
     pbelief |     404          18    .4351852   .3778324          0          1
      nmodel |     404          18    22.44444    25.2199          2        112
   team_size |     404          18    2.277778   .8041532          1          3
   stats_brw |     404          18    .0272715   .4715925  -.9406251    .813791
   topic_brw |     404          18    .0255589   .3120676    -.30488   .8381723
-------------+-----------------------------------------------------------------
   model_brw |     404          18    .4599035   .0998817   .3257702   .6065403
   peer_mean |     380       17.25    4.649413   .4091028   3.714286   5.666667
     quality |     404          18    .3333333    .471989          0          1
    quality2 |     380       17.25    .5710145   .4955838          0          1
        hrej |     404          18    .5925926   .4919611          0          1
-------------+-----------------------------------------------------------------
      hstats |     404          18    .3333333    .471989          0          1
      htopic |     404          18    .3888889   .4881025          0          1
     hbelief |     404          18    .0555556   .2293454          0          1
         dep |     404          18    5.661508    3.02209          1         11
      negsig |     404          18    .4004575   .4905987          0          1
-------------+-----------------------------------------------------------------
      possig |     404          18     .238685   .4268083          0          1
       pos10 |     404          18    .1120701   .3158438          0          1
       neg10 |     404          18    .1677414   .3740998          0          1
      pos10s |     404          18     .095205   .2938618          0          1
      neg10s |     404          18    .1579034   .3651026          0          1
-------------+-----------------------------------------------------------------
      hmodel |     404          18    .3333333    .471989          0          1

. summ ame neg10 pos10 negsig possig neg10s pos10s proindex dindex p12 p34 p56 group1 
> group2 group3 pbelief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej hstats-hmodel 
> if index==3 [aw=1/nmodel];

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
         ame |     715          44    .0026297    .197191   -1.13019       2.47
       neg10 |     715          44    .1020337   .3029046          0          1
       pos10 |     715          44    .1266166   .3327758          0          1
      negsig |     715          44    .2785489   .4485988          0          1
      possig |     715          44    .1734773   .3789245          0          1
-------------+-----------------------------------------------------------------
      neg10s |     715          44    .0543876   .2269397          0          1
      pos10s |     715          44    .0645022   .2458173          0          1
    proindex |     715          44    4.958333   .6035758          4          6
      dindex |     715          44           1          0          1          1
         p12 |     715          44    .0151515   .0694816          0   .3333333
-------------+-----------------------------------------------------------------
         p34 |     715          44    .2007576   .2265139          0         .5
         p56 |     715          44    .7840909   .2237055         .5          1
      group1 |     715          44           0          0          0          0
      group2 |     715          44           0          0          0          0
      group3 |     715          44           1          0          1          1
-------------+-----------------------------------------------------------------
     pbelief |     715          44    .5643939   .3882473          0          1
      nmodel |     715          44       16.25   18.11481          1         96
   team_size |     715          44    2.227273   .7032021          1          3
   stats_brw |     715          44    .0192812   .3679032  -.8630697   1.099596
   topic_brw |     715          44   -.0060922   .2937827  -.3396846   1.210172
-------------+-----------------------------------------------------------------
   model_brw |     715          44    .4264852   .1230286   .1488998   .7288508
   peer_mean |     701      43.375    4.061842    .623991          2       5.25
     quality |     715          44    .1477273   .3550778          0          1
    quality2 |     701      43.375    .2175793   .4128943          0          1
        hrej |     715          44        .625   .4844618          0          1
-------------+-----------------------------------------------------------------
      hstats |     715          44    .1590909   .3660169          0          1
      htopic |     715          44    .3181818   .4660965          0          1
     hbelief |     715          44    .1363636   .3434145          0          1
         dep |     715          44    5.933496   2.925393          1         11
      negsig |     715          44    .2785489   .4485988          0          1
-------------+-----------------------------------------------------------------
      possig |     715          44    .1734773   .3789245          0          1
       pos10 |     715          44    .1266166   .3327758          0          1
       neg10 |     715          44    .1020337   .3029046          0          1
      pos10s |     715          44    .0645022   .2458173          0          1
      neg10s |     715          44    .0543876   .2269397          0          1
-------------+-----------------------------------------------------------------
      hmodel |     715          44    .1477273   .3550778          0          1

. **************************************************************'
> 
> *DESCRIPTIVE TABLE AT THE TEAM LEVEL BY COLLAPSING FROM THE MODEL LEVEL DATA;
. *THERE SEEMS TO BE AN INCONSISTENCY WITH THE TOPIC_KNOWLEDGE VARIABLE IN THE TEAM LE
> VEL DATA;
. *VERY FEW TEAMS ARE CLASSIFIED AS "HIGH" AS COMPARED TO THE MODEL LEVEL DATA;
. *SIMPLEST WAY TO SHOW IT IS TO DO A TABULATE MODEL_BRW TOPIC_KNOWLEDGE IN BOTH DATA 
> SETS;
. collapse (mean) ame proindex dindex group1 group2 group3 p12 p34 p56 pbelief  nmodel
>  team_size
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej hstats-hmodel 
> index, by(teamid);

. summ ame proindex dindex p12 p34 p56 group1 group2 group3 pbelief  nmodel team_size 
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej hstats-hmodel 
> ;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |         71   -.0085083    .0806706   -.267857   .3595625
    proindex |         71    4.300469    1.114344          1          6
      dindex |         71    .6197183    .4889112          0          1
         p12 |         71    .0938967    .2531271          0          1
         p34 |         71    .3967136    .3856207          0          1
-------------+---------------------------------------------------------
         p56 |         71    .5093897     .403248          0          1
      group1 |         71    .1267606    .3350726          0          1
      group2 |         71    .2535211    .4381229          0          1
      group3 |         71    .6197183    .4889112          0          1
     pbelief |         71    .5492958    .3897439          0          1
-------------+---------------------------------------------------------
      nmodel |         71    17.64789    19.61639          1        112
   team_size |         71    2.239437    .7646622          1          3
   stats_brw |         71   -.0143092    .4414565  -1.352966   1.099596
   topic_brw |         71   -.0086646    .2886352  -.3396846   1.210172
   model_brw |         71    .4356287    .1153529   .1488998   .6939181
-------------+---------------------------------------------------------
   peer_mean |         71    4.236243    .6076129          2   5.666667
     quality |         71    .2042254    .3833822          0          1
    quality2 |         71    .3159624    .4473417          0          1
        hrej |         71    .6455399    .4206284          0          1
      hstats |         71    .1971831    .4007036          0          1
-------------+---------------------------------------------------------
      htopic |         71    .3239437    .4713097          0          1
     hbelief |         71    .1267606    .3350726          0          1
         dep |         71    5.784943    1.545854   4.333333        9.5
      negsig |         71     .318356    .2624097          0          1
      possig |         71    .1916886    .2195856          0          1
-------------+---------------------------------------------------------
       pos10 |         71    .1143123    .1549548          0         .5
       neg10 |         71    .1382308    .2016839          0          1
      pos10s |         71     .069587    .1293219          0         .5
      neg10s |         71    .1026884    .1879387          0          1
      hmodel |         71    .2042254    .3833822          0          1

. summ ame proindex dindex p12 p34 p56 group1 group2 group3 pbelief  nmodel team_size 
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej hstats-hmodel 
> if index==1;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |          9   -.0444999     .089032   -.257955   .0435525
    proindex |          9     2.37037    .9781565          1   3.666667
      dindex |          9           0           0          0          0
         p12 |          9    .6666667    .3333333   .3333333          1
         p34 |          9    .2592593    .2777778          0   .6666667
-------------+---------------------------------------------------------
         p56 |          9    .0740741    .1469862          0   .3333333
      group1 |          9           1           0          1          1
      group2 |          9           0           0          0          0
      group3 |          9           0           0          0          0
     pbelief |          9    .7037037    .3513642          0          1
-------------+---------------------------------------------------------
      nmodel |          9    14.88889    8.130874          2         24
   team_size |          9    2.222222    .9718253          1          3
   stats_brw |          9   -.2616901    .6194605  -1.352966   .6680702
   topic_brw |          9   -.0896879    .1621712  -.2844923    .233174
   model_brw |          9    .4317806     .108451   .2864059   .5655868
-------------+---------------------------------------------------------
   peer_mean |          9    4.249944    .5784541   3.142857        5.2
     quality |          9    .2222222    .4409586          0          1
    quality2 |          9    .2592593    .4339028          0          1
        hrej |          9    .8518519    .3379313          0          1
      hstats |          9    .1111111    .3333333          0          1
-------------+---------------------------------------------------------
      htopic |          9    .2222222    .4409586          0          1
     hbelief |          9    .2222222    .4409586          0          1
         dep |          9    5.305556    1.596437   4.333333          8
      negsig |          9    .3487654    .3087307          0          1
      possig |          9    .1867284    .2526013          0       .625
-------------+---------------------------------------------------------
       pos10 |          9     .058642    .1114962          0   .3333333
       neg10 |          9    .2561728    .3407105          0          1
      pos10s |          9    .0432099    .1103368          0   .3333333
      neg10s |          9    .2283951    .3352888          0          1
      hmodel |          9    .2222222    .4409586          0          1

. summ ame proindex dindex p12 p34 p56 group1 group2 group3 pbelief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej hstats-hmodel 
> if index==2 ;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |         18   -.0177386    .0614432   -.178776   .1311667
    proindex |         18    3.657407    .4371335          3   4.666667
      dindex |         18           0           0          0          0
         p12 |         18           0           0          0          0
         p34 |         18    .9444444    .1278275   .6666667          1
-------------+---------------------------------------------------------
         p56 |         18    .0555556    .1278275          0   .3333333
      group1 |         18           0           0          0          0
      group2 |         18           1           0          1          1
      group3 |         18           0           0          0          0
     pbelief |         18    .4351852    .3883049          0          1
-------------+---------------------------------------------------------
      nmodel |         18    22.44444    25.91893          2        112
   team_size |         18    2.277778    .8264421          1          3
   stats_brw |         18    .0272715    .4846637  -.9406251    .813791
   topic_brw |         18    .0255589    .3207173    -.30488   .8381723
   model_brw |         18    .4599035    .1022613   .3257702   .6065403
-------------+---------------------------------------------------------
   peer_mean |         18    4.657441    .3945461   4.142857   5.666667
     quality |         18    .3333333    .4850713          0          1
    quality2 |         18    .5888889    .4921608          0          1
        hrej |         18    .5925926    .4131112          0          1
      hstats |         18    .3333333    .4850713          0          1
-------------+---------------------------------------------------------
      htopic |         18    .3888889    .5016313          0          1
     hbelief |         18    .0555556    .2357023          0          1
         dep |         18    5.661508    1.404047   4.333333        9.5
      negsig |         18    .4004575    .2130463   .0833333        .75
      possig |         18     .238685    .1837906          0         .5
-------------+---------------------------------------------------------
       pos10 |         18    .1120701    .1684675          0         .5
       neg10 |         18    .1677414    .1965107          0         .5
      pos10s |         18     .095205    .1561963          0         .5
      neg10s |         18    .1579034    .1926805          0         .5
      hmodel |         18    .3333333    .4850713          0          1

. summ ame proindex dindex p12 p34 p56 group1 group2 group3 pbelief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean quality quality2 hrej hstats-hmodel 
> if index==3;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |         44    .0026297    .0848115   -.267857   .3595625
    proindex |         44    4.958333    .6101266          4          6
      dindex |         44           1           0          1          1
         p12 |         44    .0151515    .0702357          0   .3333333
         p34 |         44    .2007576    .2289724          0         .5
-------------+---------------------------------------------------------
         p56 |         44    .7840909    .2261335         .5          1
      group1 |         44           0           0          0          0
      group2 |         44           0           0          0          0
      group3 |         44           1           0          1          1
     pbelief |         44    .5643939    .3924611          0          1
-------------+---------------------------------------------------------
      nmodel |         44       16.25    18.31142          1         96
   team_size |         44    2.227273    .7108343          1          3
   stats_brw |         44    .0192812    .3718962  -.8630697   1.099596
   topic_brw |         44   -.0060922    .2969712  -.3396846   1.210172
   model_brw |         44    .4264852    .1224891   .1488998   .6939181
-------------+---------------------------------------------------------
   peer_mean |         44    4.061132    .6095383          2       5.25
     quality |         44    .1477273    .3158515          0          1
    quality2 |         44    .2159091    .3909994          0          1
        hrej |         44        .625     .434502          0          1
      hstats |         44    .1590909    .3699894          0          1
-------------+---------------------------------------------------------
      htopic |         44    .3181818    .4711553          0          1
     hbelief |         44    .1363636    .3471418          0          1
         dep |         44    5.933496    1.599864   4.333333        9.5
      negsig |         44    .2785489    .2679213          0          1
      possig |         44    .1734773    .2280338          0          1
-------------+---------------------------------------------------------
       pos10 |         44    .1266166    .1573169          0         .5
       neg10 |         44    .1020337    .1572792          0         .5
      pos10s |         44    .0645022     .121935          0         .5
      neg10s |         44    .0543876    .1222116          0         .5
      hmodel |         44    .1477273    .3158515          0          1

. log close;
      name:  <unnamed>
       log:  /volumes/ddisk/mi/researcher/reg_model.log
  log type:  text
 closed on:  10 Oct 2024, 09:17:58
--------------------------------------------------------------------------------------
