--------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /volumes/ddisk/mi/researcher/reg_teamlevel.log
  log type:  text
 opened on:  11 Oct 2024, 08:20:07

. clear matrix;

. clear mata;

. *THE DATA IN CRI.CSV IS MODEL-LEVEL DATA;
. *THE DATA IN CRI_TEAM.CSV IS TEAM-LEVEL DATA;
. *TEAM LEVEL DATA CONTAINS MORE THAN ONE OBSERVATION PER TEAM FOR A FEW TEAMS, DUE TO
>  STOCK-FLOW DISTINCTION;
. **************************************************;
. *THIS PROGRAM AGGREATES TEAM LEVEL DATA TO ONE OBSERVATION PER TEAM;
. *THE VARIABLE HREJECT IS CONSTANT WITHIN A TEAM;
. **************************************************;
. *GETTING VARIANCE OF THE AME WITHIN A TEAM;
. *MODEL LEVEL DATA;
. use /volumes/ddisk/mi/researcher/cri.dta, clear;

. generate teamid=u_teamid;

. destring teamid, force replace;
teamid already numeric; no replace

. *DROPS TEAMS WITH MISSING ID;
. drop if teamid==.;
(0 observations deleted)

. *DROPS THE BASELINE BRADY-FINNIGAN RESULTS;
. drop if teamid==0;
(48 observations deleted)

. rename AME ame;

. destring ame, force replace;
ame: contains nonnumeric characters; replaced as double
(8 missing values generated)

. destring z, force replace;
z: contains nonnumeric characters; replaced as double
(9 missing values generated)

. replace z=abs(z);
(686 real changes made)

. generate varame=(ame/z)^2;
(11 missing values generated)

. generate negsig=(ame<0 & z>1.645);

. generate possig=(ame>0 & z>1.645);

. *generate negsig=(ame<0 & z>1.96);
. *generate possig=(ame>0 & z>1.96);
. generate nmodel=1;

. collapse (sum) nmodel negsig possig (mean) meaname=ame varame, by(teamid);

. generate rpos=possig/nmodel;

. generate rneg=negsig/nmodel;

. summ;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      teamid |         72    48.33333    29.67286          1        106
      nmodel |         72    17.51389    19.51092          1        112
      negsig |         72    4.291667    4.888727          0         22
      possig |         72    3.347222    4.696897          0         24
     meaname |         71   -.0085083    .0806706   -.267857   .3595625
-------------+---------------------------------------------------------
      varame |         71    .0303464    .1723209   6.23e-06   1.434496
        rpos |         72    .2029151    .2379354          0          1
        rneg |         72    .3139344    .2632426          0          1

. save /volumes/ddisk/data/junkvar.dta, replace;
file /volumes/ddisk/data/junkvar.dta saved

. *GET TEAM LEVEL DATA;
. *BUT WILL ALL ALSO COLLAPSE TO 71 TEAMS;
. clear;

. use /volumes/ddisk/mi/researcher/cri_team.dta, clear;

. generate teamid=u_teamid;

. destring teamid, force replace;
teamid already numeric; no replace

. *DROPS TEAMS WITH MISSING ID;
. drop if teamid==.;
(0 observations deleted)

. *DROPS THE BASELINE BRADY-FINNIGAN RESULTS;
. drop if teamid==0;
(1 observation deleted)

. rename BELIEF_HYPOTHESIS belief_hypothesis;

. rename TOPIC_KNOWLEDGE topic_knowledge;

. rename STATISTICS_SKILL statistics_skill;

. rename MODEL_SCORE model_score;

. rename AME ame;

. rename belief_H1_11 belief_h1_11;

. rename belief_H1_12 belief_h1_12;

. rename belief_H1_13 belief_h1_13;

. rename Hsupport hsupport;

. rename Hreject hreject;

. rename Hrej hrej;

. rename Hsup hsup;

. rename Hnotest hnotest;

. rename Hmixed hmixed;

. encode Hresult, gen(hresult);

. *SIMPLIFY DATA SET BY DROPPING IRRELEVANT VARIABLES;
. drop AU-VE;

. drop emigration_ivC-fbXleftright;

. *AVERAGE MARGINAL EFFECT VARIABLE;
. destring ame, replace force;
ame: contains nonnumeric characters; replaced as double
(1 missing value generated)

. summ ame;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |         87   -.0093777    .0871169   -.391782   .3595625

. *TEAM 1 DOES NOT REPORT AN AME, SO WILL BE DELETED;
. list teamid if ame==.;

     +--------+
     | teamid |
     |--------|
  1. |      1 |
     +--------+

. drop if ame==.;
(1 observation deleted)

. *TEAM SIZE;
. *TEAM 93 HAS TEAM SIZE MISCODED;
. replace team_size=3 if teamid==93;
(1 real change made)

. tabulate team_size;

  team_size |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         17       19.54       19.54
          2 |         33       37.93       57.47
          3 |         37       42.53      100.00
------------+-----------------------------------
      Total |         87      100.00

. generate t2=(team_size==2);

. generate t3=(team_size==3);

. unique teamid if team_size==1;
Number of unique values of teamid is  14
Number of records is  17

. unique teamid if team_size==2;
Number of unique values of teamid is  26
Number of records is  33

. unique teamid if team_size==3;
Number of unique values of teamid is  31
Number of records is  37

. *GENDER COMPOSITION OF TEAM;
. destring v_1101 v_1102 v_1103, force replace;
v_1101: contains nonnumeric characters; replaced as byte
(9 missing values generated)
v_1102: contains nonnumeric characters; replaced as byte
(52 missing values generated)
v_1103: contains nonnumeric characters; replaced as byte
(21 missing values generated)

. generate nmale=(v_1101==1) + (v_1102==1) + (v_1103==1);

. generate team=(v_1101~=.) + (v_1102~=.) + (v_1103~=.);

. generate pmale=nmale/team;
(1 missing value generated)

. replace pmale=.6666667 if teamid==27;
(1 real change made)

. tabulate pmale;

      pmale |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         11       12.64       12.64
   .3333333 |          8        9.20       21.84
         .5 |         11       12.64       34.48
   .6666667 |         11       12.64       47.13
          1 |         46       52.87      100.00
------------+-----------------------------------
      Total |         87      100.00

. *FIELD OF HIGHEST DEGREE OF TEAM;
. tabulate backgr_degree1;

backgr_degr |
        ee1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          1        1.15        1.15
          2 |          5        5.75        6.90
          3 |         45       51.72       58.62
          4 |         24       27.59       86.21
          5 |          6        6.90       93.10
          6 |          3        3.45       96.55
          7 |          2        2.30       98.85
         NA |          1        1.15      100.00
------------+-----------------------------------
      Total |         87      100.00

. destring backgr_degree1, force gen(degree1);
backgr_degree1: contains nonnumeric characters; degree1 generated as byte
(1 missing value generated)

. destring backgr_degree2, force gen(degree2);
backgr_degree2: contains nonnumeric characters; degree2 generated as byte
(51 missing values generated)

. destring backgr_degree3, force gen(degree3);
backgr_degree3: contains nonnumeric characters; degree3 generated as byte
(18 missing values generated)

. tabulate backgr_degree1 degree1;

backgr_deg |                     backgr_degree1
      ree1 |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
         1 |         1          0          0          0          0 |         1 
         2 |         0          5          0          0          0 |         5 
         3 |         0          0         45          0          0 |        45 
         4 |         0          0          0         24          0 |        24 
         5 |         0          0          0          0          6 |         6 
         6 |         0          0          0          0          0 |         3 
         7 |         0          0          0          0          0 |         2 
-----------+-------------------------------------------------------+----------
     Total |         1          5         45         24          6 |        86 


backgr_deg |    backgr_degree1
      ree1 |         6          7 |     Total
-----------+----------------------+----------
         1 |         0          0 |         1 
         2 |         0          0 |         5 
         3 |         0          0 |        45 
         4 |         0          0 |        24 
         5 |         0          0 |         6 
         6 |         3          0 |         3 
         7 |         0          2 |         2 
-----------+----------------------+----------
     Total |         3          2 |        86 

. summ degree1 degree2 degree3;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     degree1 |         86    3.534884    1.036938          1          7
     degree2 |         36        3.25    .8742344          1          5
     degree3 |         69    3.608696    .8781229          3          6

. generate d1=degree1;
(1 missing value generated)

. generate d2=degree2;
(51 missing values generated)

. generate d3=degree3;
(18 missing values generated)

. replace d1=0 if d1==.;
(1 real change made)

. replace d2=0 if d2==.;
(51 real changes made)

. replace d3=0 if d3==.;
(18 real changes made)

. generate counter=d1*100 + d2*10 + d3;

. generate counter2=team_size*1000 + counter;

. summ d1-d3 counter counter2;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
          d1 |         87    3.494253    1.098345          0          7
          d2 |         87    1.344828     1.70381          0          5
          d3 |         87    2.862069    1.664768          0          6
     counter |         87    365.7356    109.3123          5        703
    counter2 |         87    2595.621    760.9549       1100       3654

. tabulate counter2;

   counter2 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1100 |          1        1.15        1.15
       1200 |          1        1.15        2.30
       1300 |          6        6.90        9.20
       1400 |          5        5.75       14.94
       1500 |          3        3.45       18.39
       1600 |          1        1.15       19.54
       2204 |          2        2.30       21.84
       2303 |         13       14.94       36.78
       2306 |          2        2.30       39.08
       2400 |          1        1.15       40.23
       2404 |         10       11.49       51.72
       2504 |          1        1.15       52.87
       2505 |          1        1.15       54.02
       2606 |          1        1.15       55.17
       2703 |          2        2.30       57.47
       3005 |          1        1.15       58.62
       3244 |          2        2.30       60.92
       3323 |          2        2.30       63.22
       3333 |         14       16.09       79.31
       3336 |          2        2.30       81.61
       3343 |          5        5.75       87.36
       3344 |          1        1.15       88.51
       3414 |          2        2.30       90.80
       3433 |          3        3.45       94.25
       3443 |          1        1.15       95.40
       3444 |          2        2.30       97.70
       3555 |          1        1.15       98.85
       3654 |          1        1.15      100.00
------------+-----------------------------------
      Total |         87      100.00

. *SIZE OF TEAM THAT PROVIDES A DEGREE, NOT EQUAL TO TEAM_SIZE BECAUSE OF MISSING INFO
> ;
. replace team=(degree1~=.) + (degree2~=.) + (degree3~=.);
(13 real changes made)

. *THESE ARE THE EXCLUSIVE DISCIPLINES;
. generate mdegree=1 if counter2==1100;
(86 missing values generated)

. replace mdegree=2 if counter2==1200;
(1 real change made)

. replace mdegree=3 if counter2==1300 | counter2==2303 | counter2==3333;
(33 real changes made)

. replace mdegree=4 if counter2==1400 | counter2==2400 | counter2==2404 | counter2==34
> 44;
(18 real changes made)

. replace mdegree=5 if counter2==1500 | counter2==2505 | counter2==3555;
(5 real changes made)

. replace mdegree=6 if counter2==1600 | counter2==2606;
(2 real changes made)

. *ALL MIXED DEGREES FOR ACTUAL TEAM SIZE 2;
. replace mdegree=20 if (team==2 & mdegree==.) ;
(7 real changes made)

. tabulate counter2 if mdegree==20;

   counter2 |      Freq.     Percent        Cum.
------------+-----------------------------------
       2204 |          2       28.57       28.57
       2306 |          2       28.57       57.14
       2504 |          1       14.29       71.43
       2703 |          2       28.57      100.00
------------+-----------------------------------
      Total |          7      100.00

. *NOW BREAK UP TEAM SIZE 3 INTO 4 CATEGORIES;
. replace mdegree=31 if (counter2==3323 | counter2==3336
>         | counter2==3343);
(9 real changes made)

. replace mdegree=32 if (counter2==3244 
>         | counter2==3414 | counter2==3443);
(5 real changes made)

. *THE FOLLOWING 2 CATEGORIES USE DIFFERENT LEAD AUTHOR IN SOCIO OR POLI SCI TO CLASSI
> FY;
. *ALSO SEPARATES OUT STRANGE TEAM WITH 3 DISTINCT FIELDS;
. replace mdegree=33 if (counter2==3344 );
(1 real change made)

. replace mdegree=34 if (counter2==3433);
(3 real changes made)

. replace mdegree=35 if (counter2==3654);
(1 real change made)

. tabulate counter2 if team==3 & mdegree==.;
no observations

. tabulate counter2 if team_size==3 & mdegree==.;

   counter2 |      Freq.     Percent        Cum.
------------+-----------------------------------
       3005 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. replace mdegree=30 if team_size==3 & mdegree==.;
(1 real change made)

. tabulate counter2 if mdegree==30, missing;

   counter2 |      Freq.     Percent        Cum.
------------+-----------------------------------
       3005 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. tabulate counter2, sum(mdegree);

            |         Summary of mdegree
   counter2 |        Mean   Std. dev.       Freq.
------------+------------------------------------
       1100 |           1           0           1
       1200 |           2           0           1
       1300 |           3           0           6
       1400 |           4           0           5
       1500 |           5           0           3
       1600 |           6           0           1
       2204 |          20           0           2
       2303 |           3           0          13
       2306 |          20           0           2
       2400 |           4           0           1
       2404 |           4           0          10
       2504 |          20           0           1
       2505 |           5           0           1
       2606 |           6           0           1
       2703 |          20           0           2
       3005 |          30           0           1
       3244 |          32           0           2
       3323 |          31           0           2
       3333 |           3           0          14
       3336 |          31           0           2
       3343 |          31           0           5
       3344 |          33           0           1
       3414 |          32           0           2
       3433 |          34           0           3
       3443 |          32           0           1
       3444 |           4           0           2
       3555 |           5           0           1
       3654 |          35           0           1
------------+------------------------------------
      Total |    11.37931   12.186765          87

. *PRO-IMMIGRATION INDEX USES THE VARIABLE MEASURING THE GENERAL ATTITUDE TOWARDS IMMI
> GRATION, ATTITUDE_IMMIGRATION_11;
. *A VARIABLE COLLECTED IN THE FIRST WAVE QUESTIONNAIRE;
. *THE VARIABLE pro_immigrant in lower case IS THE MEAN OF THE INDEX WITHIN A TEAM;
. *THE PRO_IMMIGRANT VARIABLE IN UPPER CASE ONLY HAS 3 VALUES AS COMPARED TO MORE THAN
>  6 FOR THE pro_immigrant VARIABLE;
. *HIGHER VALUES OF PRO_IMMIGRANT INDICATE THAT IMMIGRATION LAWS SHOULD BE RELAXED, MO
> RE IMMIGRATION;
. *NOTE THAT ATTITUDE_IMMIGRATION_11 IS IN REVERSE ORDER;
. tabulate pro_immigrant attitude_immigration_11 if team_size==1;

                 |                attitude_immigration_11
   pro_immigrant |         1          2          3          4          5 |     Total
-----------------+-------------------------------------------------------+----------
               1 |         0          0          0          0          0 |         2 
               2 |         0          0          0          0          1 |         1 
               3 |         0          0          0          2          0 |         2 
               4 |         0          0          3          0          0 |         3 
               5 |         0          4          0          0          0 |         4 
               6 |         5          0          0          0          0 |         5 
-----------------+-------------------------------------------------------+----------
           Total |         5          4          3          2          1 |        17 


                 | attitude_i
                 | mmigration
                 |    _11
   pro_immigrant |         6 |     Total
-----------------+-----------+----------
               1 |         2 |         2 
               2 |         0 |         1 
               3 |         0 |         2 
               4 |         0 |         3 
               5 |         0 |         4 
               6 |         0 |         5 
-----------------+-----------+----------
           Total |         2 |        17 

. rename PRO_IMMIGRANT pro;

. generate proindex=pro_immigrant;

. destring proindex, force replace;
proindex: all characters numeric; replaced as double

. tabulate proindex pro, missing;

           |          PRO_IMMIGRANT
  proindex |      High        Low        Mid |     Total
-----------+---------------------------------+----------
         1 |         0          2          0 |         2 
         2 |         0          2          0 |         2 
  2.333333 |         0          1          0 |         1 
  2.666667 |         0          1          0 |         1 
         3 |         0          3          0 |         3 
  3.333333 |         0          0          3 |         3 
       3.5 |         0          0          7 |         7 
  3.666667 |         0          0          7 |         7 
         4 |         0          0         11 |        11 
  4.333333 |         0          0          3 |         3 
       4.5 |         0          0         10 |        10 
  4.666667 |         6          0          0 |         6 
         5 |        14          0          0 |        14 
  5.333333 |         3          0          0 |         3 
       5.5 |         5          0          0 |         5 
  5.666667 |         2          0          0 |         2 
         6 |         7          0          0 |         7 
-----------+---------------------------------+----------
     Total |        37          9         41 |        87 

. *CREATING PINDEX, PERCENT OF TEAM WITH PRO-IMMIGRATION IDEOLOGY;
. *SIMPLY COUNT NUMBER OF AUTHORS WITH CORRECT CODE IN ATTITUDE VARIABLE, AND DIVIDE B
> Y TEAM SIZE;
. destring attitude_immigration_11, force gen(att1);
attitude_immigration_11: contains nonnumeric characters; att1 generated as byte
(2 missing values generated)

. destring attitude_immigration_12, force gen(att2);
attitude_immigration_12: contains nonnumeric characters; att2 generated as byte
(52 missing values generated)

. destring attitude_immigration_13, force gen(att3);
attitude_immigration_13: contains nonnumeric characters; att3 generated as byte
(18 missing values generated)

. *REVERSE ORDER OF THE ATTITUDE IMMIGRATION VARIABLES TO MAKE THEM CONSISTENT WITH PR
> OINDEX;
. replace att1=7-att1;
(85 real changes made)

. replace att2=7-att2;
(35 real changes made)

. replace att3=7-att3;
(69 real changes made)

. *NOT ALL MEMBERS IN TEAM RESPONDED TO THE ATTITUDE_IMMIGRATION VARIABLES;
. *WILL USE ACTUAL NUMBER WHO RESPONDED TO DEFINE INDEX BELOW;
. replace team=(att1~=.) + (att2~=.) + (att3~=.);
(2 real changes made)

. generate npro=(att1>4 & att1~=.) + (att2>4 & att2~=.) + (att3>4 & att3~=.);

. tabulate npro;

       npro |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         26       29.89       29.89
          1 |         34       39.08       68.97
          2 |         21       24.14       93.10
          3 |          6        6.90      100.00
------------+-----------------------------------
      Total |         87      100.00

. generate pindex=(npro/team);

. *DINDEX IS THE VARIABLE THAT MEASURES IF AT LEAST HALF OF THE TEAM IS PRO-IMMIGRANT;
. generate dindex=(pindex>=.5);

. summ npro pindex dindex;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        npro |         87     1.08046    .9050041          0          3
      pindex |         87    .5095785    .3997385          0          1
      dindex |         87    .6091954    .4907593          0          1

. generate npro1=(att1==1) + (att2==1) + (att3==1);

. generate npro2=(att1==2) + (att2==2) + (att3==2);

. generate npro3=(att1==3) + (att2==3) + (att3==3);

. generate npro4=(att1==4) + (att2==4) + (att3==4);

. generate npro5=(att1==5) + (att2==5) + (att3==5);

. generate npro6=(att1==6) + (att2==6) + (att3==6);

. *THE Px VARIABLES GIVE % OF TEAM THAT IS IN EACH OF THE CODES;
. generate p1=npro1/team;

. generate p2=npro2/team;

. generate p3=npro3/team;

. generate p4=npro4/team;

. generate p5=npro5/team;

. generate p6=npro6/team;

. *P12 P34 P56 GIVE % OF TEAM THAT IS 1,2 OR 3,4, OR 5,6;
. generate p12=p1+p2;

. generate p34=p3+p4;

. generate p56=p5+p6;

. *NOW DEFINING THE THREE TYPES OF TEAMS USED IN PAPER;
. *GROUP 1, AT LEAST 1 PERSON IN TEAM IS ANTI-IMMIGRATION;
. *GROUP 3, MORE THAN HALF OF TEAM IS PRO-IMMIGRATION, SAME AS DINDEX VARIABLE;
. *GROUP 2, THE MODERATE MIDDLE;
. *BUT THERE IS AN OVERLAP OF 2 TEAMS BETWEEN GROUPS 1 AND 3, BOTH TEAMS HAVE 3 PERSON
> S;
. *IN THESE TEAMS, 1 PERSON IS A 2 BUT BOTH OF THE OTHER PEOPLE ARE 5 OR 6;
. *WILL CLASSIFY THEM AS PRO-IMMIGRATION GROUP SINCE MAJORITY IS PRO-IMMIGRATION;
. generate group1=(p12>0);

. generate group3=(pindex>=.5);

. tabulate group3 dindex;

           |        dindex
    group3 |         0          1 |     Total
-----------+----------------------+----------
         0 |        34          0 |        34 
         1 |         0         53 |        53 
-----------+----------------------+----------
     Total |        34         53 |        87 

. tabulate group1 group3;

           |        group3
    group1 |         0          1 |     Total
-----------+----------------------+----------
         0 |        24         51 |        75 
         1 |        10          2 |        12 
-----------+----------------------+----------
     Total |        34         53 |        87 

. list teamid att1 att2 att3 if group1==1 & group3==1;

     +-----------------------------+
     | teamid   att1   att2   att3 |
     |-----------------------------|
  7. |     64      5      2      5 |
 45. |     61      5      2      6 |
     +-----------------------------+

. unique teamid if group1==1 & group3==1;
Number of unique values of teamid is  2
Number of records is  2

. replace group3=1 if group1==1 & group3==1;
(0 real changes made)

. replace group1=0 if group1==1 & group3==1;
(2 real changes made)

. generate group2=(group1==0 & group3==0);

. generate index=1*group1 +2*group2 + 3*group3;

. tabulate index;

      index |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         10       11.49       11.49
          2 |         24       27.59       39.08
          3 |         53       60.92      100.00
------------+-----------------------------------
      Total |         87      100.00

. *TOPIC KNOWLEDGE;
. tabulate topic_knowledge, missing;

TOPIC_KNOWL |
       EDGE |      Freq.     Percent        Cum.
------------+-----------------------------------
       High |          9       10.34       10.34
        Low |         22       25.29       35.63
        Mid |         55       63.22       98.85
         NA |          1        1.15      100.00
------------+-----------------------------------
      Total |         87      100.00

. *MISSING DATA FOR THIS VARIABLE AND IT ALL BELONGS TO TEAM 27;
. *MOREOVER TOPIC_KNOWLEDGE FOR TEAM 27 IN TEAM LEVEL DATA IS ALSO MISSING;
. *WILL USE A HOT DECK PROCEDURE TO IMPUTE BASED ON MDEGREE, TEAM SIZE, AND PMALE;
. tabulate teamid if topic_knowledge=="NA";

     teamid |      Freq.     Percent        Cum.
------------+-----------------------------------
         27 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. summ mdegree  if teamid==27;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     mdegree |          1           4           .          4          4

. tabulate topic_knowledge if mdegree==40 & team_size==1 & pmale==0;
no observations

. tabulate topic_ipred if mdegree==40 & team_size==1 & pmale==0;
no observations

. replace topic_knowledge="Low" if teamid==27;
(1 real change made)

. replace topic_ipred="-0.253722245526001" if teamid==27;
(1 real change made)

. tabulate topic_knowledge, missing;

TOPIC_KNOWL |
       EDGE |      Freq.     Percent        Cum.
------------+-----------------------------------
       High |          9       10.34       10.34
        Low |         23       26.44       36.78
        Mid |         55       63.22      100.00
------------+-----------------------------------
      Total |         87      100.00

. *TOPIC_CAT CONVERTS TOPIC_KNOWLEDGE INTO NUMERIC, NOTE CODE 4 IS NA;
. drop topic_cat;

. generate topic_cat=1*(topic_knowledge=="Low") + 2*(topic_knowledge=="Mid") 
>         + 3*(topic_knowledge=="High");

. *TOPIC VARIABLE IN BRW COMES FROM A FACTOR ANALYSIS PREDICTION;
. destring topic_ipred, force gen(topic_brw);
topic_ipred: all characters numeric; topic_brw generated as double

. tabulate topic_brw topic_knowledge, missing;

topic_ipre |         TOPIC_KNOWLEDGE
         d |      High        Low        Mid |     Total
-----------+---------------------------------+----------
 -.3396846 |         0          1          0 |         1 
 -.3125983 |         0          2          0 |         2 
   -.30488 |         0          1          0 |         1 
 -.2948698 |         0          1          0 |         1 
 -.2924661 |         0          1          0 |         1 
 -.2844923 |         0          1          0 |         1 
 -.2842492 |         0          1          0 |         1 
 -.2567398 |         0          1          0 |         1 
 -.2537222 |         0          2          0 |         2 
 -.2501658 |         0          1          0 |         1 
 -.2323944 |         0          1          0 |         1 
 -.2252685 |         0          1          0 |         1 
 -.2088186 |         0          1          0 |         1 
 -.2032106 |         0          2          0 |         2 
 -.1750503 |         0          1          0 |         1 
 -.1700541 |         0          1          0 |         1 
 -.1684909 |         0          1          0 |         1 
 -.1681252 |         0          1          0 |         1 
  -.159743 |         0          1          0 |         1 
  -.152279 |         0          1          0 |         1 
 -.1431925 |         0          0          2 |         2 
 -.1379568 |         0          0          1 |         1 
 -.1322295 |         0          0          1 |         1 
 -.1180402 |         0          0          1 |         1 
 -.1180365 |         0          0          1 |         1 
 -.1160367 |         0          0          1 |         1 
 -.1126539 |         0          0          1 |         1 
 -.1081857 |         0          0          2 |         2 
 -.1060163 |         0          0          2 |         2 
 -.1056993 |         0          0          2 |         2 
 -.0988388 |         0          0          2 |         2 
 -.0964761 |         0          0          2 |         2 
 -.0910359 |         0          0          1 |         1 
 -.0861576 |         0          0          1 |         1 
 -.0766422 |         0          0          1 |         1 
 -.0724543 |         0          0          1 |         1 
 -.0630017 |         0          0          2 |         2 
 -.0605945 |         0          0          2 |         2 
 -.0572294 |         0          0          1 |         1 
 -.0528801 |         0          0          1 |         1 
 -.0390203 |         0          0          1 |         1 
 -.0355067 |         0          0          1 |         1 
 -.0346285 |         0          0          2 |         2 
 -.0198385 |         0          0          1 |         1 
 -.0190452 |         0          0          1 |         1 
 -.0120221 |         0          0          1 |         1 
 -.0084401 |         0          0          1 |         1 
  .0020823 |         0          0          1 |         1 
  .0121719 |         0          0          1 |         1 
  .0199861 |         0          0          1 |         1 
  .0227601 |         0          0          1 |         1 
  .0236555 |         0          0          1 |         1 
  .0544597 |         0          0          2 |         2 
  .0605255 |         0          0          1 |         1 
  .0693577 |         0          0          1 |         1 
  .0731461 |         0          0          1 |         1 
   .084274 |         0          0          2 |         2 
  .0897856 |         0          0          1 |         1 
  .1259155 |         0          0          1 |         1 
  .1959201 |         0          0          1 |         1 
  .2198415 |         0          0          2 |         2 
   .233174 |         0          0          1 |         1 
  .2384678 |         0          0          1 |         1 
  .2590647 |         2          0          0 |         2 
  .3775455 |         1          0          0 |         1 
  .6968864 |         1          0          0 |         1 
  .7740507 |         1          0          0 |         1 
  .8162819 |         2          0          0 |         2 
  .8381723 |         1          0          0 |         1 
  1.210172 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |         9         23         55 |        87 

. summ topic_brw;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   topic_brw |         87   -.0059047    .2821717  -.3396846   1.210172

. *STATS INFO IS MISSING FOR TEAM 27, BUT TEAM 27 DATA IS NOT AVAILABLE IN TEAM DATA;
. *WILL USE HOT DECK PROCEDURE;
. tabulate statistics_skill if mdegree==40 & team_size==1 & pmale==0;
no observations

. tabulate stats_ipred if mdegree==40 & team_size==1 & pmale==0;
no observations

. replace statistics_skill="Mid" if teamid==27;
(1 real change made)

. replace stats_ipred="0.102538885683808" if teamid==27;
(1 real change made)

. generate stats_cat=1*(statistics_skill=="Low") + 2*(statistics_skill=="Mid") 
>         + 3*(statistics_skill=="High");

. *STATISTICS VARIABLE IN BRW COMES FROM A FACTOR ANALYSIS PREDICTION;
. destring stats_ipred, force gen(stats_brw);
stats_ipred: all characters numeric; stats_brw generated as double

. tabulate teamid if stats_brw==.;
no observations

. replace stats_brw=0.649019158901927 if teamid==8;
(0 real changes made)

. tabulate statistics_skill, sum(stats_brw);

STATISTICS_ |       Summary of stats_ipred
      SKILL |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |   .52499355   .21042013          25
        Low |  -.48944831   .26780576          27
        Mid |   -.0068917   .10468045          35
------------+------------------------------------
      Total |  -.00381006    .4401228          87

. *BELIEF HYPOTHESIS HAS USUAL PROBLEM WITH MISSING DATA FOR TEAM 27;
. *WILL AGAIN USE HOT DECK PROCEDURE;
. *NOT CLEAR THAT BELIEF VARIABLE SHOULD BE IMPUTED IN THIS CONTEXT;
. *AS THE BELIEF VARIABLE IS A KEY INDEPENDENT VARIABLE;
. tabulate belief_hypothesis if teamid==27;

BELIEF_HYPO |
     THESIS |      Freq.     Percent        Cum.
------------+-----------------------------------
         NA |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. tabulate belief_ipred if teamid==27;

      belief_ipred |      Freq.     Percent        Cum.
-------------------+-----------------------------------
                NA |          1      100.00      100.00
-------------------+-----------------------------------
             Total |          1      100.00

. tabulate belief_hypothesis if mdegree==40 & team_size==1 & pmale==0;
no observations

. replace belief_hypothesis="Low" if teamid==27;
(1 real change made)

. replace belief_ipred="-1.13508799270782" if teamid==27;
(1 real change made)

. tabulate belief_hypothesis, missing;

BELIEF_HYPO |
     THESIS |      Freq.     Percent        Cum.
------------+-----------------------------------
       High |         31       35.63       35.63
        Low |         22       25.29       60.92
        Mid |         34       39.08      100.00
------------+-----------------------------------
      Total |         87      100.00

. *BELIEF_CAT REVERSES ORDER TO MAKE IT CONSISTENT WITH DATA;
. drop belief_cat;

. generate belief_cat=3*(belief_hypothesis=="Low") + 2*(belief_hypothesis=="Mid") 
>         + 1*(belief_hypothesis=="High");

. tabulate belief_hypothesis belief_cat, missing;

BELIEF_HYP |            belief_cat
   OTHESIS |         1          2          3 |     Total
-----------+---------------------------------+----------
      High |        31          0          0 |        31 
       Low |         0          0         22 |        22 
       Mid |         0         34          0 |        34 
-----------+---------------------------------+----------
     Total |        31         34         22 |        87 

. destring belief_ipred, force replace;
belief_ipred: all characters numeric; replaced as double

. *THERE IS PROBABLY A MISCODING OF WHAT "HIGH BELIEF" MEANS IN DATA SET, DIRECTION IS
>  REVERSED;
. *ALTERNATIVE MEASURE OF BELIEF HYPOTHESIS USING INDIVIDUAL TEAM MEMBER BELIEFS;
. *SEE 002_CRI_DATA_PREP.RMD, LINE 356;
. *SUGGESTS CODING CHANGED FROM QUESTIONNAIRE AND HIGHER VALUES OF BELIEF_H1_11 SHOULD
>  INDICATE MORE BELIEF IN HYPOTHESIS;
. *BUT DISTRIBUTION OF VARIABLE COMPARED TO APPENDIX SUGGESTS THAT 1 IS STRONGLY REDUC
> ES, AND 4 IS SOMEWHAT INCREASES;
. *NOTE HIGH VALUE OF BELIEF_1_AVG MEANS *WEAKER* BELIEF IN HYPOTHESIS IMMIGRATION RED
> UCES SOCIAL SUPPORT;
. *NOTE THAT BELIEF_1_AVG AND BELIEF_H1_11 ARE THE SAME FOR SINGLE PERSON TEAMS;
. tabulate belief_1_avg belief_hypothesis;

                 |        BELIEF_HYPOTHESIS
    belief_1_avg |      High        Low        Mid |     Total
-----------------+---------------------------------+----------
               1 |         0          1          0 |         1 
1.66666666666667 |         0          2          0 |         2 
               2 |         2         15          8 |        25 
2.33333333333333 |         0          2         12 |        14 
             2.5 |         3          0          6 |         9 
2.66666666666667 |         6          0          5 |        11 
               3 |        15          2          3 |        20 
3.33333333333333 |         1          0          0 |         1 
             3.5 |         4          0          0 |         4 
-----------------+---------------------------------+----------
           Total |        31         22         34 |        87 

. tabulate belief_1_avg;

    belief_1_avg |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               1 |          1        1.15        1.15
1.66666666666667 |          2        2.30        3.45
               2 |         25       28.74       32.18
2.33333333333333 |         14       16.09       48.28
             2.5 |          9       10.34       58.62
2.66666666666667 |         11       12.64       71.26
               3 |         20       22.99       94.25
3.33333333333333 |          1        1.15       95.40
             3.5 |          4        4.60      100.00
-----------------+-----------------------------------
           Total |         87      100.00

. tabulate belief_1_avg belief_h1_11 if team_size==1;

                 |           belief_H1_11
    belief_1_avg |         1          2          3 |     Total
-----------------+---------------------------------+----------
               1 |         1          0          0 |         1 
               2 |         0          8          0 |         8 
               3 |         0          0          8 |         8 
-----------------+---------------------------------+----------
           Total |         1          8          8 |        17 

. destring belief_1_avg, force replace;
belief_1_avg: all characters numeric; replaced as double

. destring belief_h1_11, force replace;
belief_h1_11: contains nonnumeric characters; replaced as byte
(1 missing value generated)

. destring belief_h1_12, force replace;
belief_h1_12: contains nonnumeric characters; replaced as byte
(51 missing values generated)

. destring belief_h1_13, force replace;
belief_h1_13: contains nonnumeric characters; replaced as byte
(18 missing values generated)

. tabulate belief_h1_11, missing;

belief_H1_1 |
          1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          3        3.45        3.45
          2 |         50       57.47       60.92
          3 |         28       32.18       93.10
          4 |          5        5.75       98.85
          . |          1        1.15      100.00
------------+-----------------------------------
      Total |         87      100.00

. tabulate belief_h1_12, missing;

belief_H1_1 |
          2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |         17       19.54       19.54
          3 |         19       21.84       41.38
          . |         51       58.62      100.00
------------+-----------------------------------
      Total |         87      100.00

. tabulate belief_h1_13, missing;

belief_H1_1 |
          3 |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |         38       43.68       43.68
          3 |         26       29.89       73.56
          4 |          5        5.75       79.31
          . |         18       20.69      100.00
------------+-----------------------------------
      Total |         87      100.00

. *NBELIEF IS NUMBER IN TEAM THAT BELIEVES HYPOTHESIS IMMIGRATION REDUCES SUPPORT;
. *DBELIEF EQUALS 1 IF MORE THAN HALF THE TEAM BELIEVES IMMIGRATION REDUCES SUPPORT;
. *IF IMMIGRATION REDUCES SUPPORT IT WOULD MEAN THAT THE AME IS NEGATIVE;
. *USE CORRECT MEASURE OF TEAM SIZE TO DEFINE PBELIEF;
. *THE ORIGINAL BELIEF INDICES ONLY HAVE 4 POTENTIAL VALUES SO CANNOT DIFFERENTIATE LO
> WER AND UPPER ENDS;
. generate nbelief=(belief_h1_11<=2 & belief_h1_11~=.) 
>         + (belief_h1_12<=2 & belief_h1_12~=.) + (belief_h1_13<=2 & belief_h1_13~=.);

. replace team=(belief_h1_11~=.) + (belief_h1_12~=.) + (belief_h1_13~=.);
(2 real changes made)

. *generate nbelief=(belief_h1_11<2) + (belief_h1_12<2) + (belief_h1_13<2);
. generate pbelief=nbelief/team;

. tabulate pbelief;

    pbelief |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         21       24.14       24.14
   .3333333 |         10       11.49       35.63
         .5 |         13       14.94       50.57
   .6666667 |         15       17.24       67.82
          1 |         28       32.18      100.00
------------+-----------------------------------
      Total |         87      100.00

. tabulate belief_hypothesis, sum(pbelief);

BELIEF_HYPO |         Summary of pbelief
     THESIS |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |   .20430108   .30033832          31
        Low |   .92424243   .16846076          22
        Mid |   .62254903   .27311898          34
------------+------------------------------------
      Total |   .54980843   .38471687          87

. tabulate belief_hypothesis, sum(belief_ipred);

BELIEF_HYPO |       Summary of belief_ipred
     THESIS |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |   .35405259   .15502166          31
        Low |  -.43933601   .25193769          22
        Mid |  -.01930631   .11867689          34
------------+------------------------------------
      Total |   .00751521   .35204914          87

. tabulate pbelief, sum(belief_ipred);

            |       Summary of belief_ipred
    pbelief |        Mean   Std. dev.       Freq.
------------+------------------------------------
          0 |   .41087404   .16004751          21
   .3333333 |   .15795696   .07255801          10
         .5 |   .04399382   .24131874          13
   .6666667 |  -.12038985   .12135739          15
          1 |  -.29714904   .31560491          28
------------+------------------------------------
      Total |   .00751521   .35204914          87

. *NOTE SIGN IS REVERSED BECAUSE THE ORDERING OF THE BELIEF VARIABLE IN FINAL DATA SET
>  IS INCORRECT;
. generate belief_brw=-belief_ipred;

. tabulate belief_hypothesis, sum(belief_brw);

BELIEF_HYPO |        Summary of belief_brw
     THESIS |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |  -.35405259   .15502166          31
        Low |   .43933601   .25193769          22
        Mid |   .01930631   .11867689          34
------------+------------------------------------
      Total |  -.00751521   .35204914          87

. tabulate pbelief, sum(belief_brw);

            |        Summary of belief_brw
    pbelief |        Mean   Std. dev.       Freq.
------------+------------------------------------
          0 |  -.41087404   .16004751          21
   .3333333 |  -.15795696   .07255801          10
         .5 |  -.04399382   .24131874          13
   .6666667 |   .12038985   .12135739          15
          1 |   .29714904   .31560491          28
------------+------------------------------------
      Total |  -.00751521   .35204914          87

. tabulate belief_cat, sum(belief_brw);

            |        Summary of belief_brw
 belief_cat |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |  -.35405259   .15502166          31
          2 |   .01930631   .11867689          34
          3 |   .43933601   .25193769          22
------------+------------------------------------
      Total |  -.00751521   .35204914          87

. tabulate Hresult hresult;

           |             Hresult
   Hresult |   No test     Reject    Support |     Total
-----------+---------------------------------+----------
   No test |        10          0          0 |        10 
    Reject |         0         54          0 |        54 
   Support |         0          0         23 |        23 
-----------+---------------------------------+----------
     Total |        10         54         23 |        87 

. summ belief_brw stats_brw topic_brw ame;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  belief_brw |         87   -.0075152    .3520491  -.7355577   1.135088
   stats_brw |         87   -.0038101    .4401228  -1.352966   1.099596
   topic_brw |         87   -.0059047    .2821717  -.3396846   1.210172
         ame |         87   -.0093777    .0871169   -.391782   .3595625

. *DO BELIEFS DRIVE NORMATIVE CONCLUSIONS?
> *WEIGHTED BY # OF MODELS SO THAT TEAMS THAT STUDIED THE ISSUE "MORE" COUNT MORE IN T
> HE NORMATIVE REGRESSION;
. *ALTERNATIVE MEASURES OF BELIEF;
. *BELIEF_BRW IS THE FACTOR INDEX IN THE ORIGINAL PAPER TIMES MINUS 1;
. *PBELIEF GIVES THE FRACTION OF THE TEAM THAT STRONGLY BELIEVES IN HYPOTHESIS;
. *HBELIEF IS A DUMMY = 1 IF BELIEF_HYPOTHESIS IS "LOW", WHICH MEANS TEAM REALLY BELIE
> VES THE HYPOTHESIS BASED ON FACTOR INDEX;
. *PB1 = 1 IF MORE THAN HALF TEH TEAM STRONGLY BELIEVES IN HYPOTHESIS;
. generate hbelief=(belief_hypothesis=="Low");

. corr pbelief hbelief;
(obs=87)

             |  pbelief  hbelief
-------------+------------------
     pbelief |   1.0000
     hbelief |   0.5695   1.0000


. *PB1 INDICATES IF MORE THAN HALF THE TEAM STRONGLY BELIEVES IN HYPOTHESIS;
. generate pb1=(pbelief>.5);

. *COLLAPSING TEAM DATA TO ONE OBSERVATION PER TEAM;
. collapse (mean) ame  proindex index p12 p56 stats_brw topic_brw mdegree pbelief beli
> ef_brw
>         pmale belief_1_avg  team_size hresult hreject hrej hsupport hnotest, 
>         by(teamid);

.                 *MERGING IN ALTERNATIVE MEASURES OF MEAN AND VARIANCE OF AME FROM MO
> DEL LEVEL DATA;
. sort teamid;

. merge teamid using /volumes/ddisk/data/junkvar.dta;
(you are using old merge syntax; see [D] merge for new syntax)

. drop _merge;

. drop if ame==.;
(1 observation deleted)

. *NOTE THAT HREJ IS NOT CONSTANT WITHIN A TEAM;
. *IT HAS TO DO WITH THE 16 TEAMS THAT PROVIDED CONFLICTING CONCLUSIONS;
. *SO HREJECT IS A MUCH BETTER VARIABLE TO USE IN ANALYSIS;
. tabulate hrej hreject;

    (mean) |    (mean) hreject
      hrej |         0          1 |     Total
-----------+----------------------+----------
         0 |        17          0 |        17 
        .5 |        16          0 |        16 
         1 |         0         38 |        38 
-----------+----------------------+----------
     Total |        33         38 |        71 

. generate group1=(index==1);

. generate group2=(index==2);

. generate group3=(index==3);

. *REPLICATING BASIC REGRESSIONS AT TEAM LEVEL;
. regress meaname  proindex stats_brw topic_brw i.team_size i.mdegree  , cluster(teami
> d);

Linear regression                               Number of obs     =         71
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3993
                                                Root MSE          =     .07186

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
     meaname | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0119531   .0064181     1.86   0.067    -.0008474    .0247537
   stats_brw |   .0905171   .0479873     1.89   0.063    -.0051905    .1862248
   topic_brw |  -.1294408   .0607227    -2.13   0.037    -.2505484   -.0083332
             |
   team_size |
          2  |   .0097654   .0175478     0.56   0.580    -.0252326    .0447634
          3  |   .0135064    .027293     0.49   0.622    -.0409277    .0679406
             |
     mdegree |
          2  |  -.1812968   .0626681    -2.89   0.005    -.3062844   -.0563091
          3  |   -.182952   .0579566    -3.16   0.002    -.2985428   -.0673612
          4  |  -.1841665   .0623292    -2.95   0.004    -.3084783   -.0598547
          5  |  -.1340736   .0737167    -1.82   0.073     -.281097    .0129497
          6  |   -.206068   .0639524    -3.22   0.002     -.333617    -.078519
         20  |  -.1796716   .0626497    -2.87   0.005    -.3046226   -.0547207
         30  |  -.4589712   .0614105    -7.47   0.000    -.5814506   -.3364917
         31  |  -.1791557   .0720614    -2.49   0.015    -.3228776   -.0354338
         32  |  -.1903988   .0644263    -2.96   0.004     -.318893   -.0619046
         33  |  -.1835485   .0742623    -2.47   0.016      -.33166   -.0354369
         34  |  -.2714954   .1109873    -2.45   0.017    -.4928525   -.0501383
         35  |  -.1508864   .0533703    -2.83   0.006    -.2573302   -.0444427
             |
       _cons |   .1150831   .0568877     2.02   0.047     .0016243     .228542
------------------------------------------------------------------------------

. regress meaname  group3 stats_brw topic_brw i.team_size i.mdegree  , cluster(teamid)
> ;

Linear regression                               Number of obs     =         71
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4304
                                                Root MSE          =     .06997

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
     meaname | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |   .0424621   .0174612     2.43   0.018     .0076368    .0772874
   stats_brw |   .0868006    .044428     1.95   0.055    -.0018083    .1754094
   topic_brw |  -.1254498   .0580441    -2.16   0.034    -.2412151   -.0096845
             |
   team_size |
          2  |   .0029411   .0174031     0.17   0.866    -.0317682    .0376505
          3  |   .0142751   .0262448     0.54   0.588    -.0380685    .0666186
             |
     mdegree |
          2  |  -.1644616   .0585504    -2.81   0.006    -.2812366   -.0476865
          3  |  -.1776811   .0587517    -3.02   0.003    -.2948576   -.0605046
          4  |  -.1758872   .0636961    -2.76   0.007     -.302925   -.0488494
          5  |  -.1245961   .0710024    -1.75   0.084    -.2662059    .0170137
          6  |  -.1924819   .0639489    -3.01   0.004    -.3200239   -.0649399
         20  |  -.1733007   .0673902    -2.57   0.012    -.3077062   -.0388952
         30  |  -.4505878   .0673596    -6.69   0.000    -.5849322   -.3162433
         31  |  -.1709203   .0728713    -2.35   0.022    -.3162575   -.0255832
         32  |  -.1839001   .0639061    -2.88   0.005    -.3113567   -.0564435
         33  |  -.1595355   .0714814    -2.23   0.029    -.3021007   -.0169702
         34  |  -.2607416   .1017661    -2.56   0.013    -.4637077   -.0577755
         35  |  -.1285966   .0528169    -2.43   0.017    -.2339365   -.0232567
             |
       _cons |   .1347944   .0503276     2.68   0.009     .0344192    .2351697
------------------------------------------------------------------------------

. regress meaname group1 group3 stats_brw topic_brw i.team_size i.mdegree  , cluster(t
> eamid);

Linear regression                               Number of obs     =         71
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4577
                                                Root MSE          =     .06892

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
     meaname | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0525519   .0340354    -1.54   0.127    -.1204334    .0153295
      group3 |   .0270017   .0166445     1.62   0.109    -.0061946    .0601981
   stats_brw |   .0824956    .043103     1.91   0.060    -.0034706    .1684619
   topic_brw |  -.1296656   .0586096    -2.21   0.030    -.2465587   -.0127724
             |
   team_size |
          2  |    -.00191   .0171438    -0.11   0.912    -.0361022    .0322822
          3  |   .0106835   .0263031     0.41   0.686    -.0417764    .0631434
             |
     mdegree |
          2  |  -.2122076   .0709584    -2.99   0.004    -.3537297   -.0706856
          3  |  -.2027806   .0622777    -3.26   0.002    -.3269896   -.0785716
          4  |  -.2046988   .0677839    -3.02   0.004    -.3398896    -.069508
          5  |  -.1515217   .0745695    -2.03   0.046     -.300246   -.0027975
          6  |  -.2254712    .068965    -3.27   0.002    -.3630175   -.0879249
         20  |  -.2030729   .0686656    -2.96   0.004    -.3400222   -.0661237
         30  |   -.477945   .0704536    -6.78   0.000    -.6184602   -.3374297
         31  |   -.196058   .0777469    -2.52   0.014    -.3511193   -.0409968
         32  |  -.2067078   .0642456    -3.22   0.002    -.3348417    -.078574
         33  |  -.1478561    .070874    -2.09   0.041    -.2892098   -.0065024
         34  |  -.2945652   .1105307    -2.67   0.010    -.5150117   -.0741186
         35  |  -.1731037   .0606231    -2.86   0.006    -.2940127   -.0521946
             |
       _cons |   .1806416   .0632258     2.86   0.006     .0545418    .3067415
------------------------------------------------------------------------------

. summ ame meaname;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |         71   -.0081205    .0805256   -.267857   .3595625
     meaname |         71   -.0085083    .0806706   -.267857   .3595625

. *NOTE THAT THE MEAN AME FROM THE COLLAPSE OF THE 87 OBSERVATIONS TO 71 OBSERVATIONS;
. *DOES NOT EXACTLY REPLICATE THE TRUE MEANAME FROM THE MODELS ESTIMATED BY THAT TEAM;
. *REPLICATING BASIC REGRESSIONS AT TEAM LEVEL;
. regress ame  proindex stats_brw topic_brw i.team_size i.mdegree  , cluster(teamid);

Linear regression                               Number of obs     =         71
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4001
                                                Root MSE          =     .07168

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0121641   .0063665     1.91   0.060    -.0005335    .0248617
   stats_brw |   .0894912   .0479863     1.86   0.066    -.0062145    .1851969
   topic_brw |  -.1279161   .0608585    -2.10   0.039    -.2492944   -.0065377
             |
   team_size |
          2  |   .0095546   .0174937     0.55   0.587    -.0253356    .0444447
          3  |   .0136711   .0272936     0.50   0.618    -.0407642    .0681064
             |
     mdegree |
          2  |  -.1801194   .0627056    -2.87   0.005    -.3051819    -.055057
          3  |  -.1822173   .0579661    -3.14   0.002     -.297827   -.0666075
          4  |    -.18343   .0623587    -2.94   0.004    -.3078005   -.0590596
          5  |    -.13291   .0737265    -1.80   0.076     -.279953    .0141329
          6  |  -.2053923   .0639617    -3.21   0.002      -.33296   -.0778247
         20  |  -.1790499   .0625843    -2.86   0.006    -.3038704   -.0542294
         30  |  -.4590135   .0614647    -7.47   0.000    -.5816011    -.336426
         31  |  -.1744149   .0713004    -2.45   0.017    -.3166191   -.0322108
         32  |  -.1912091   .0647801    -2.95   0.004     -.320409   -.0620093
         33  |  -.1828409   .0743153    -2.46   0.016    -.3310582   -.0346236
         34  |  -.2708949   .1109754    -2.44   0.017    -.4922283   -.0495614
         35  |  -.1505761   .0534168    -2.82   0.006    -.2571126   -.0440397
             |
       _cons |   .1135916   .0567679     2.00   0.049     .0003716    .2268116
------------------------------------------------------------------------------

. regress ame  group3 stats_brw topic_brw i.team_size i.mdegree  , cluster(teamid);

Linear regression                               Number of obs     =         71
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4293
                                                Root MSE          =     .06991

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |   .0419351   .0174104     2.41   0.019     .0072112     .076659
   stats_brw |   .0859782   .0444621     1.93   0.057    -.0026987     .174655
   topic_brw |  -.1241925   .0581591    -2.14   0.036    -.2401872   -.0081978
             |
   team_size |
          2  |   .0027801   .0172926     0.16   0.873     -.031709    .0372692
          3  |   .0143934   .0262463     0.55   0.585    -.0379533    .0667401
             |
     mdegree |
          2  |  -.1633453   .0586014    -2.79   0.007    -.2802221   -.0464685
          3  |  -.1762544   .0587383    -3.00   0.004    -.2934042   -.0591047
          4  |  -.1744945   .0636729    -2.74   0.008    -.3014862   -.0475029
          5  |  -.1233422   .0709883    -1.74   0.087    -.2649239    .0182396
          6  |  -.1913168   .0638637    -3.00   0.004     -.318689   -.0639447
         20  |  -.1719713   .0671871    -2.56   0.013    -.3059716   -.0379709
         30  |  -.4494115   .0673562    -6.67   0.000    -.5837492   -.3150738
         31  |  -.1656373   .0723784    -2.29   0.025    -.3099915   -.0212831
         32  |  -.1841519   .0641618    -2.87   0.005    -.3121184   -.0561853
         33  |  -.1586825   .0714981    -2.22   0.030     -.301281   -.0160839
         34  |  -.2595955   .1019124    -2.55   0.013    -.4628534   -.0563375
         35  |  -.1280555   .0528221    -2.42   0.018    -.2334058   -.0227052
             |
       _cons |   .1339443   .0503544     2.66   0.010     .0335155     .234373
------------------------------------------------------------------------------

. regress ame  group1 group3 stats_brw topic_brw i.team_size i.mdegree  , cluster(team
> id);

Linear regression                               Number of obs     =         71
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4594
                                                Root MSE          =     .06869

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0550126   .0337036    -1.63   0.107    -.1222325    .0122072
      group3 |   .0257509   .0163677     1.57   0.120    -.0068936    .0583953
   stats_brw |   .0814717   .0430597     1.89   0.063    -.0044082    .1673516
   topic_brw |  -.1286057    .058741    -2.19   0.032    -.2457609   -.0114505
             |
   team_size |
          2  |  -.0022982   .0170306    -0.13   0.893    -.0362646    .0316682
          3  |   .0106336   .0262935     0.40   0.687    -.0418071    .0630744
             |
     mdegree |
          2  |  -.2133271   .0709085    -3.01   0.004    -.3547495   -.0719046
          3  |  -.2025292   .0621642    -3.26   0.002    -.3265117   -.0785467
          4  |  -.2046552   .0677032    -3.02   0.003    -.3396849   -.0696255
          5  |  -.1515285    .074591    -2.03   0.046    -.3002955   -.0027616
          6  |  -.2258508    .068785    -3.28   0.002    -.3630381   -.0886636
         20  |  -.2031375   .0683367    -2.97   0.004    -.3394309   -.0668442
         30  |  -.4780497   .0704594    -6.78   0.000    -.6185766   -.3375228
         31  |  -.1919521   .0770929    -2.49   0.015     -.345709   -.0381951
         32  |  -.2080275   .0643305    -3.23   0.002    -.3363307   -.0797243
         33  |  -.1464562   .0707896    -2.07   0.042    -.2876416   -.0052708
         34  |  -.2950028   .1109195    -2.66   0.010    -.5162248   -.0737808
         35  |  -.1746466   .0606196    -2.88   0.005    -.2955486   -.0537447
             |
       _cons |   .1819382   .0631563     2.88   0.005      .055977    .3078995
------------------------------------------------------------------------------

. ***************************************************************;
. *REPLICATING BASIC REGRESSIONS AT 87-TEAM-HREJ LEVEL;
. use /volumes/ddisk/mi/researcher/cri.dta, clear;

. generate teamid=u_teamid;

. destring teamid, force replace;
teamid already numeric; no replace

. rename Hrej hrej;

. *DROPS TEAMS WITH MISSING ID;
. drop if teamid==.;
(0 observations deleted)

. *DROPS THE BASELINE BRADY-FINNIGAN RESULTS;
. drop if teamid==0;
(48 observations deleted)

. rename AME ame;

. destring ame, force replace;
ame: contains nonnumeric characters; replaced as double
(8 missing values generated)

. destring z, force replace;
z: contains nonnumeric characters; replaced as double
(9 missing values generated)

. replace z=abs(z);
(686 real changes made)

. generate varame=(ame/z)^2;
(11 missing values generated)

. generate negsig=(ame<0 & z>1.645);

. generate possig=(ame>0 & z>1.645);

. *generate negsig=(ame<0 & z>1.96);
. *generate possig=(ame>0 & z>1.96);
. generate nmodel=1;

. collapse (sum) nmodel negsig possig (mean) meaname=ame varame, by(teamid hrej);

. generate rpos=possig/nmodel;

. generate rneg=negsig/nmodel;

. summ;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hrej |         88    .6136364    .4897059          0          1
      teamid |         88    49.96591    29.68433          1        106
      nmodel |         88    14.32955    17.60533          1        112
      negsig |         88    3.511364    4.068365          0         19
      possig |         88    2.738636    4.366788          0         24
-------------+---------------------------------------------------------
     meaname |         87   -.0093777    .0871169   -.391782   .3595625
      varame |         87    .0269193    .1568105   6.30e-07   1.434496
        rpos |         88    .1988497    .2695284          0          1
        rneg |         88    .3393601    .3334852          0          1

. save /volumes/ddisk/data/junkvar.dta, replace;
file /volumes/ddisk/data/junkvar.dta saved

. *GET TEAM LEVEL DATA;
. clear;

. use /volumes/ddisk/mi/researcher/cri_team.dta, clear;

. generate teamid=u_teamid;

. destring teamid, force replace;
teamid already numeric; no replace

. *DROPS TEAMS WITH MISSING ID;
. drop if teamid==.;
(0 observations deleted)

. *DROPS THE BASELINE BRADY-FINNIGAN RESULTS;
. drop if teamid==0;
(1 observation deleted)

. rename BELIEF_HYPOTHESIS belief_hypothesis;

. rename TOPIC_KNOWLEDGE topic_knowledge;

. rename STATISTICS_SKILL statistics_skill;

. rename MODEL_SCORE model_score;

. rename AME ame;

. rename belief_H1_11 belief_h1_11;

. rename belief_H1_12 belief_h1_12;

. rename belief_H1_13 belief_h1_13;

. rename Hsupport hsupport;

. rename Hreject hreject;

. rename Hrej hrej;

. rename Hsup hsup;

. rename Hnotest hnotest;

. rename Hmixed hmixed;

. encode Hresult, gen(hresult);

. *SIMPLIFY DATA SET BY DROPPING IRRELEVANT VARIABLES;
. drop AU-VE;

. drop emigration_ivC-fbXleftright;

. *AVERAGE MARGINAL EFFECT VARIABLE;
. destring ame, replace force;
ame: contains nonnumeric characters; replaced as double
(1 missing value generated)

. summ ame;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |         87   -.0093777    .0871169   -.391782   .3595625

. *TEAM 1 DOES NOT REPORT AN AME, SO WILL BE DELETED;
. list teamid if ame==.;

     +--------+
     | teamid |
     |--------|
  1. |      1 |
     +--------+

. drop if ame==.;
(1 observation deleted)

. *TEAM SIZE;
. *TEAM 93 HAS TEAM SIZE MISCODED;
. replace team_size=3 if teamid==93;
(1 real change made)

. tabulate team_size;

  team_size |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         17       19.54       19.54
          2 |         33       37.93       57.47
          3 |         37       42.53      100.00
------------+-----------------------------------
      Total |         87      100.00

. generate t2=(team_size==2);

. generate t3=(team_size==3);

. unique teamid if team_size==1;
Number of unique values of teamid is  14
Number of records is  17

. unique teamid if team_size==2;
Number of unique values of teamid is  26
Number of records is  33

. unique teamid if team_size==3;
Number of unique values of teamid is  31
Number of records is  37

. *GENDER COMPOSITION OF TEAM;
. destring v_1101 v_1102 v_1103, force replace;
v_1101: contains nonnumeric characters; replaced as byte
(9 missing values generated)
v_1102: contains nonnumeric characters; replaced as byte
(52 missing values generated)
v_1103: contains nonnumeric characters; replaced as byte
(21 missing values generated)

. generate nmale=(v_1101==1) + (v_1102==1) + (v_1103==1);

. generate team=(v_1101~=.) + (v_1102~=.) + (v_1103~=.);

. generate pmale=nmale/team;
(1 missing value generated)

. replace pmale=.6666667 if teamid==27;
(1 real change made)

. tabulate pmale;

      pmale |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         11       12.64       12.64
   .3333333 |          8        9.20       21.84
         .5 |         11       12.64       34.48
   .6666667 |         11       12.64       47.13
          1 |         46       52.87      100.00
------------+-----------------------------------
      Total |         87      100.00

. *FIELD OF HIGHEST DEGREE OF TEAM;
. tabulate backgr_degree1;

backgr_degr |
        ee1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          1        1.15        1.15
          2 |          5        5.75        6.90
          3 |         45       51.72       58.62
          4 |         24       27.59       86.21
          5 |          6        6.90       93.10
          6 |          3        3.45       96.55
          7 |          2        2.30       98.85
         NA |          1        1.15      100.00
------------+-----------------------------------
      Total |         87      100.00

. destring backgr_degree1, force gen(degree1);
backgr_degree1: contains nonnumeric characters; degree1 generated as byte
(1 missing value generated)

. destring backgr_degree2, force gen(degree2);
backgr_degree2: contains nonnumeric characters; degree2 generated as byte
(51 missing values generated)

. destring backgr_degree3, force gen(degree3);
backgr_degree3: contains nonnumeric characters; degree3 generated as byte
(18 missing values generated)

. tabulate backgr_degree1 degree1;

backgr_deg |                     backgr_degree1
      ree1 |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
         1 |         1          0          0          0          0 |         1 
         2 |         0          5          0          0          0 |         5 
         3 |         0          0         45          0          0 |        45 
         4 |         0          0          0         24          0 |        24 
         5 |         0          0          0          0          6 |         6 
         6 |         0          0          0          0          0 |         3 
         7 |         0          0          0          0          0 |         2 
-----------+-------------------------------------------------------+----------
     Total |         1          5         45         24          6 |        86 


backgr_deg |    backgr_degree1
      ree1 |         6          7 |     Total
-----------+----------------------+----------
         1 |         0          0 |         1 
         2 |         0          0 |         5 
         3 |         0          0 |        45 
         4 |         0          0 |        24 
         5 |         0          0 |         6 
         6 |         3          0 |         3 
         7 |         0          2 |         2 
-----------+----------------------+----------
     Total |         3          2 |        86 

. summ degree1 degree2 degree3;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     degree1 |         86    3.534884    1.036938          1          7
     degree2 |         36        3.25    .8742344          1          5
     degree3 |         69    3.608696    .8781229          3          6

. generate d1=degree1;
(1 missing value generated)

. generate d2=degree2;
(51 missing values generated)

. generate d3=degree3;
(18 missing values generated)

. replace d1=0 if d1==.;
(1 real change made)

. replace d2=0 if d2==.;
(51 real changes made)

. replace d3=0 if d3==.;
(18 real changes made)

. generate counter=d1*100 + d2*10 + d3;

. generate counter2=team_size*1000 + counter;

. summ d1-d3 counter counter2;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
          d1 |         87    3.494253    1.098345          0          7
          d2 |         87    1.344828     1.70381          0          5
          d3 |         87    2.862069    1.664768          0          6
     counter |         87    365.7356    109.3123          5        703
    counter2 |         87    2595.621    760.9549       1100       3654

. tabulate counter2;

   counter2 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1100 |          1        1.15        1.15
       1200 |          1        1.15        2.30
       1300 |          6        6.90        9.20
       1400 |          5        5.75       14.94
       1500 |          3        3.45       18.39
       1600 |          1        1.15       19.54
       2204 |          2        2.30       21.84
       2303 |         13       14.94       36.78
       2306 |          2        2.30       39.08
       2400 |          1        1.15       40.23
       2404 |         10       11.49       51.72
       2504 |          1        1.15       52.87
       2505 |          1        1.15       54.02
       2606 |          1        1.15       55.17
       2703 |          2        2.30       57.47
       3005 |          1        1.15       58.62
       3244 |          2        2.30       60.92
       3323 |          2        2.30       63.22
       3333 |         14       16.09       79.31
       3336 |          2        2.30       81.61
       3343 |          5        5.75       87.36
       3344 |          1        1.15       88.51
       3414 |          2        2.30       90.80
       3433 |          3        3.45       94.25
       3443 |          1        1.15       95.40
       3444 |          2        2.30       97.70
       3555 |          1        1.15       98.85
       3654 |          1        1.15      100.00
------------+-----------------------------------
      Total |         87      100.00

. *SIZE OF TEAM THAT PROVIDES A DEGREE, NOT EQUAL TO TEAM_SIZE BECAUSE OF MISSING INFO
> ;
. replace team=(degree1~=.) + (degree2~=.) + (degree3~=.);
(13 real changes made)

. *THESE ARE THE EXCLUSIVE DISCIPLINES;
. generate mdegree=1 if counter2==1100;
(86 missing values generated)

. replace mdegree=2 if counter2==1200;
(1 real change made)

. replace mdegree=3 if counter2==1300 | counter2==2303 | counter2==3333;
(33 real changes made)

. replace mdegree=4 if counter2==1400 | counter2==2400 | counter2==2404 | counter2==34
> 44;
(18 real changes made)

. replace mdegree=5 if counter2==1500 | counter2==2505 | counter2==3555;
(5 real changes made)

. replace mdegree=6 if counter2==1600 | counter2==2606;
(2 real changes made)

. *ALL MIXED DEGREES FOR ACTUAL TEAM SIZE 2;
. replace mdegree=20 if (team==2 & mdegree==.) ;
(7 real changes made)

. tabulate counter2 if mdegree==20;

   counter2 |      Freq.     Percent        Cum.
------------+-----------------------------------
       2204 |          2       28.57       28.57
       2306 |          2       28.57       57.14
       2504 |          1       14.29       71.43
       2703 |          2       28.57      100.00
------------+-----------------------------------
      Total |          7      100.00

. *NOW BREAK UP TEAM SIZE 3 INTO 4 CATEGORIES;
. replace mdegree=31 if (counter2==3323 | counter2==3336
>         | counter2==3343);
(9 real changes made)

. replace mdegree=32 if (counter2==3244 
>         | counter2==3414 | counter2==3443);
(5 real changes made)

. *THE FOLLOWING 2 CATEGORIES USE DIFFERENT LEAD AUTHOR IN SOCIO OR POLI SCI TO CLASSI
> FY;
. *ALSO SEPARATES OUT STRANGE TEAM WITH 3 DISTINCT FIELDS;
. replace mdegree=33 if (counter2==3344 );
(1 real change made)

. replace mdegree=34 if (counter2==3433);
(3 real changes made)

. replace mdegree=35 if (counter2==3654);
(1 real change made)

. tabulate counter2 if team==3 & mdegree==.;
no observations

. tabulate counter2 if team_size==3 & mdegree==.;

   counter2 |      Freq.     Percent        Cum.
------------+-----------------------------------
       3005 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. replace mdegree=30 if team_size==3 & mdegree==.;
(1 real change made)

. tabulate counter2 if mdegree==30, missing;

   counter2 |      Freq.     Percent        Cum.
------------+-----------------------------------
       3005 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. tabulate counter2, sum(mdegree);

            |         Summary of mdegree
   counter2 |        Mean   Std. dev.       Freq.
------------+------------------------------------
       1100 |           1           0           1
       1200 |           2           0           1
       1300 |           3           0           6
       1400 |           4           0           5
       1500 |           5           0           3
       1600 |           6           0           1
       2204 |          20           0           2
       2303 |           3           0          13
       2306 |          20           0           2
       2400 |           4           0           1
       2404 |           4           0          10
       2504 |          20           0           1
       2505 |           5           0           1
       2606 |           6           0           1
       2703 |          20           0           2
       3005 |          30           0           1
       3244 |          32           0           2
       3323 |          31           0           2
       3333 |           3           0          14
       3336 |          31           0           2
       3343 |          31           0           5
       3344 |          33           0           1
       3414 |          32           0           2
       3433 |          34           0           3
       3443 |          32           0           1
       3444 |           4           0           2
       3555 |           5           0           1
       3654 |          35           0           1
------------+------------------------------------
      Total |    11.37931   12.186765          87

. *PRO-IMMIGRATION INDEX USES THE VARIABLE MEASURING THE GENERAL ATTITUDE TOWARDS IMMI
> GRATION, ATTITUDE_IMMIGRATION_11;
. *A VARIABLE COLLECTED IN THE FIRST WAVE QUESTIONNAIRE;
. *THE VARIABLE pro_immigrant in lower case IS THE MEAN OF THE INDEX WITHIN A TEAM;
. *THE PRO_IMMIGRANT VARIABLE IN UPPER CASE ONLY HAS 3 VALUES AS COMPARED TO MORE THAN
>  6 FOR THE pro_immigrant VARIABLE;
. *HIGHER VALUES OF PRO_IMMIGRANT INDICATE THAT IMMIGRATION LAWS SHOULD BE RELAXED, MO
> RE IMMIGRATION;
. *NOTE THAT ATTITUDE_IMMIGRATION_11 IS IN REVERSE ORDER;
. tabulate pro_immigrant attitude_immigration_11 if team_size==1;

                 |                attitude_immigration_11
   pro_immigrant |         1          2          3          4          5 |     Total
-----------------+-------------------------------------------------------+----------
               1 |         0          0          0          0          0 |         2 
               2 |         0          0          0          0          1 |         1 
               3 |         0          0          0          2          0 |         2 
               4 |         0          0          3          0          0 |         3 
               5 |         0          4          0          0          0 |         4 
               6 |         5          0          0          0          0 |         5 
-----------------+-------------------------------------------------------+----------
           Total |         5          4          3          2          1 |        17 


                 | attitude_i
                 | mmigration
                 |    _11
   pro_immigrant |         6 |     Total
-----------------+-----------+----------
               1 |         2 |         2 
               2 |         0 |         1 
               3 |         0 |         2 
               4 |         0 |         3 
               5 |         0 |         4 
               6 |         0 |         5 
-----------------+-----------+----------
           Total |         2 |        17 

. rename PRO_IMMIGRANT pro;

. generate proindex=pro_immigrant;

. destring proindex, force replace;
proindex: all characters numeric; replaced as double

. tabulate proindex pro, missing;

           |          PRO_IMMIGRANT
  proindex |      High        Low        Mid |     Total
-----------+---------------------------------+----------
         1 |         0          2          0 |         2 
         2 |         0          2          0 |         2 
  2.333333 |         0          1          0 |         1 
  2.666667 |         0          1          0 |         1 
         3 |         0          3          0 |         3 
  3.333333 |         0          0          3 |         3 
       3.5 |         0          0          7 |         7 
  3.666667 |         0          0          7 |         7 
         4 |         0          0         11 |        11 
  4.333333 |         0          0          3 |         3 
       4.5 |         0          0         10 |        10 
  4.666667 |         6          0          0 |         6 
         5 |        14          0          0 |        14 
  5.333333 |         3          0          0 |         3 
       5.5 |         5          0          0 |         5 
  5.666667 |         2          0          0 |         2 
         6 |         7          0          0 |         7 
-----------+---------------------------------+----------
     Total |        37          9         41 |        87 

. *CREATING PINDEX, PERCENT OF TEAM WITH PRO-IMMIGRATION IDEOLOGY;
. *SIMPLY COUNT NUMBER OF AUTHORS WITH CORRECT CODE IN ATTITUDE VARIABLE, AND DIVIDE B
> Y TEAM SIZE;
. destring attitude_immigration_11, force gen(att1);
attitude_immigration_11: contains nonnumeric characters; att1 generated as byte
(2 missing values generated)

. destring attitude_immigration_12, force gen(att2);
attitude_immigration_12: contains nonnumeric characters; att2 generated as byte
(52 missing values generated)

. destring attitude_immigration_13, force gen(att3);
attitude_immigration_13: contains nonnumeric characters; att3 generated as byte
(18 missing values generated)

. *REVERSE ORDER OF THE ATTITUDE IMMIGRATION VARIABLES TO MAKE THEM CONSISTENT WITH PR
> OINDEX;
. replace att1=7-att1;
(85 real changes made)

. replace att2=7-att2;
(35 real changes made)

. replace att3=7-att3;
(69 real changes made)

. *NOT ALL MEMBERS IN TEAM RESPONDED TO THE ATTITUDE_IMMIGRATION VARIABLES;
. *WILL USE ACTUAL NUMBER WHO RESPONDED TO DEFINE INDEX BELOW;
. replace team=(att1~=.) + (att2~=.) + (att3~=.);
(2 real changes made)

. generate npro=(att1>4 & att1~=.) + (att2>4 & att2~=.) + (att3>4 & att3~=.);

. tabulate npro;

       npro |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         26       29.89       29.89
          1 |         34       39.08       68.97
          2 |         21       24.14       93.10
          3 |          6        6.90      100.00
------------+-----------------------------------
      Total |         87      100.00

. generate pindex=(npro/team);

. *DINDEX IS THE VARIABLE THAT MEASURES IF AT LEAST HALF OF THE TEAM IS PRO-IMMIGRANT;
. generate dindex=(pindex>=.5);

. summ npro pindex dindex;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        npro |         87     1.08046    .9050041          0          3
      pindex |         87    .5095785    .3997385          0          1
      dindex |         87    .6091954    .4907593          0          1

. generate npro1=(att1==1) + (att2==1) + (att3==1);

. generate npro2=(att1==2) + (att2==2) + (att3==2);

. generate npro3=(att1==3) + (att2==3) + (att3==3);

. generate npro4=(att1==4) + (att2==4) + (att3==4);

. generate npro5=(att1==5) + (att2==5) + (att3==5);

. generate npro6=(att1==6) + (att2==6) + (att3==6);

. *THE Px VARIABLES GIVE % OF TEAM THAT IS IN EACH OF THE CODES;
. generate p1=npro1/team;

. generate p2=npro2/team;

. generate p3=npro3/team;

. generate p4=npro4/team;

. generate p5=npro5/team;

. generate p6=npro6/team;

. *P12 P34 P56 GIVE % OF TEAM THAT IS 1,2 OR 3,4, OR 5,6;
. generate p12=p1+p2;

. generate p34=p3+p4;

. generate p56=p5+p6;

. *NOW DEFINING THE THREE TYPES OF TEAMS USED IN PAPER;
. *GROUP 1, AT LEAST 1 PERSON IN TEAM IS ANTI-IMMIGRATION;
. *GROUP 3, MORE THAN HALF OF TEAM IS PRO-IMMIGRATION, SAME AS DINDEX VARIABLE;
. *GROUP 2, THE MODERATE MIDDLE;
. *BUT THERE IS AN OVERLAP OF 2 TEAMS BETWEEN GROUPS 1 AND 3, BOTH TEAMS HAVE 3 PERSON
> S;
. *IN THESE TEAMS, 1 PERSON IS A 2 BUT BOTH OF THE OTHER PEOPLE ARE 5 OR 6;
. *WILL CLASSIFY THEM AS PRO-IMMIGRATION GROUP SINCE MAJORITY IS PRO-IMMIGRATION;
. generate group1=(p12>0);

. generate group3=(pindex>=.5);

. tabulate group3 dindex;

           |        dindex
    group3 |         0          1 |     Total
-----------+----------------------+----------
         0 |        34          0 |        34 
         1 |         0         53 |        53 
-----------+----------------------+----------
     Total |        34         53 |        87 

. tabulate group1 group3;

           |        group3
    group1 |         0          1 |     Total
-----------+----------------------+----------
         0 |        24         51 |        75 
         1 |        10          2 |        12 
-----------+----------------------+----------
     Total |        34         53 |        87 

. list teamid att1 att2 att3 if group1==1 & group3==1;

     +-----------------------------+
     | teamid   att1   att2   att3 |
     |-----------------------------|
  7. |     64      5      2      5 |
 45. |     61      5      2      6 |
     +-----------------------------+

. unique teamid if group1==1 & group3==1;
Number of unique values of teamid is  2
Number of records is  2

. replace group3=1 if group1==1 & group3==1;
(0 real changes made)

. replace group1=0 if group1==1 & group3==1;
(2 real changes made)

. generate group2=(group1==0 & group3==0);

. generate index=1*group1 +2*group2 + 3*group3;

. tabulate index;

      index |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         10       11.49       11.49
          2 |         24       27.59       39.08
          3 |         53       60.92      100.00
------------+-----------------------------------
      Total |         87      100.00

. *TOPIC KNOWLEDGE;
. tabulate topic_knowledge, missing;

TOPIC_KNOWL |
       EDGE |      Freq.     Percent        Cum.
------------+-----------------------------------
       High |          9       10.34       10.34
        Low |         22       25.29       35.63
        Mid |         55       63.22       98.85
         NA |          1        1.15      100.00
------------+-----------------------------------
      Total |         87      100.00

. *MISSING DATA FOR THIS VARIABLE AND IT ALL BELONGS TO TEAM 27;
. *MOREOVER TOPIC_KNOWLEDGE FOR TEAM 27 IN TEAM LEVEL DATA IS ALSO MISSING;
. *WILL USE A HOT DECK PROCEDURE TO IMPUTE BASED ON MDEGREE, TEAM SIZE, AND PMALE;
. tabulate teamid if topic_knowledge=="NA";

     teamid |      Freq.     Percent        Cum.
------------+-----------------------------------
         27 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. summ mdegree  if teamid==27;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     mdegree |          1           4           .          4          4

. tabulate topic_knowledge if mdegree==40 & team_size==1 & pmale==0;
no observations

. tabulate topic_ipred if mdegree==40 & team_size==1 & pmale==0;
no observations

. replace topic_knowledge="Low" if teamid==27;
(1 real change made)

. replace topic_ipred="-0.253722245526001" if teamid==27;
(1 real change made)

. tabulate topic_knowledge, missing;

TOPIC_KNOWL |
       EDGE |      Freq.     Percent        Cum.
------------+-----------------------------------
       High |          9       10.34       10.34
        Low |         23       26.44       36.78
        Mid |         55       63.22      100.00
------------+-----------------------------------
      Total |         87      100.00

. *TOPIC_CAT CONVERTS TOPIC_KNOWLEDGE INTO NUMERIC, NOTE CODE 4 IS NA;
. drop topic_cat;

. generate topic_cat=1*(topic_knowledge=="Low") + 2*(topic_knowledge=="Mid") 
>         + 3*(topic_knowledge=="High");

. *TOPIC VARIABLE IN BRW COMES FROM A FACTOR ANALYSIS PREDICTION;
. destring topic_ipred, force gen(topic_brw);
topic_ipred: all characters numeric; topic_brw generated as double

. tabulate topic_brw topic_knowledge, missing;

topic_ipre |         TOPIC_KNOWLEDGE
         d |      High        Low        Mid |     Total
-----------+---------------------------------+----------
 -.3396846 |         0          1          0 |         1 
 -.3125983 |         0          2          0 |         2 
   -.30488 |         0          1          0 |         1 
 -.2948698 |         0          1          0 |         1 
 -.2924661 |         0          1          0 |         1 
 -.2844923 |         0          1          0 |         1 
 -.2842492 |         0          1          0 |         1 
 -.2567398 |         0          1          0 |         1 
 -.2537222 |         0          2          0 |         2 
 -.2501658 |         0          1          0 |         1 
 -.2323944 |         0          1          0 |         1 
 -.2252685 |         0          1          0 |         1 
 -.2088186 |         0          1          0 |         1 
 -.2032106 |         0          2          0 |         2 
 -.1750503 |         0          1          0 |         1 
 -.1700541 |         0          1          0 |         1 
 -.1684909 |         0          1          0 |         1 
 -.1681252 |         0          1          0 |         1 
  -.159743 |         0          1          0 |         1 
  -.152279 |         0          1          0 |         1 
 -.1431925 |         0          0          2 |         2 
 -.1379568 |         0          0          1 |         1 
 -.1322295 |         0          0          1 |         1 
 -.1180402 |         0          0          1 |         1 
 -.1180365 |         0          0          1 |         1 
 -.1160367 |         0          0          1 |         1 
 -.1126539 |         0          0          1 |         1 
 -.1081857 |         0          0          2 |         2 
 -.1060163 |         0          0          2 |         2 
 -.1056993 |         0          0          2 |         2 
 -.0988388 |         0          0          2 |         2 
 -.0964761 |         0          0          2 |         2 
 -.0910359 |         0          0          1 |         1 
 -.0861576 |         0          0          1 |         1 
 -.0766422 |         0          0          1 |         1 
 -.0724543 |         0          0          1 |         1 
 -.0630017 |         0          0          2 |         2 
 -.0605945 |         0          0          2 |         2 
 -.0572294 |         0          0          1 |         1 
 -.0528801 |         0          0          1 |         1 
 -.0390203 |         0          0          1 |         1 
 -.0355067 |         0          0          1 |         1 
 -.0346285 |         0          0          2 |         2 
 -.0198385 |         0          0          1 |         1 
 -.0190452 |         0          0          1 |         1 
 -.0120221 |         0          0          1 |         1 
 -.0084401 |         0          0          1 |         1 
  .0020823 |         0          0          1 |         1 
  .0121719 |         0          0          1 |         1 
  .0199861 |         0          0          1 |         1 
  .0227601 |         0          0          1 |         1 
  .0236555 |         0          0          1 |         1 
  .0544597 |         0          0          2 |         2 
  .0605255 |         0          0          1 |         1 
  .0693577 |         0          0          1 |         1 
  .0731461 |         0          0          1 |         1 
   .084274 |         0          0          2 |         2 
  .0897856 |         0          0          1 |         1 
  .1259155 |         0          0          1 |         1 
  .1959201 |         0          0          1 |         1 
  .2198415 |         0          0          2 |         2 
   .233174 |         0          0          1 |         1 
  .2384678 |         0          0          1 |         1 
  .2590647 |         2          0          0 |         2 
  .3775455 |         1          0          0 |         1 
  .6968864 |         1          0          0 |         1 
  .7740507 |         1          0          0 |         1 
  .8162819 |         2          0          0 |         2 
  .8381723 |         1          0          0 |         1 
  1.210172 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |         9         23         55 |        87 

. summ topic_brw;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   topic_brw |         87   -.0059047    .2821717  -.3396846   1.210172

. *STATS INFO IS MISSING FOR TEAM 27, BUT TEAM 27 DATA IS NOT AVAILABLE IN TEAM DATA;
. *WILL USE HOT DECK PROCEDURE;
. tabulate statistics_skill if mdegree==40 & team_size==1 & pmale==0;
no observations

. tabulate stats_ipred if mdegree==40 & team_size==1 & pmale==0;
no observations

. replace statistics_skill="Mid" if teamid==27;
(1 real change made)

. replace stats_ipred="0.102538885683808" if teamid==27;
(1 real change made)

. generate stats_cat=1*(statistics_skill=="Low") + 2*(statistics_skill=="Mid") 
>         + 3*(statistics_skill=="High");

. *STATISTICS VARIABLE IN BRW COMES FROM A FACTOR ANALYSIS PREDICTION;
. destring stats_ipred, force gen(stats_brw);
stats_ipred: all characters numeric; stats_brw generated as double

. tabulate teamid if stats_brw==.;
no observations

. replace stats_brw=0.649019158901927 if teamid==8;
(0 real changes made)

. tabulate statistics_skill, sum(stats_brw);

STATISTICS_ |       Summary of stats_ipred
      SKILL |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |   .52499355   .21042013          25
        Low |  -.48944831   .26780576          27
        Mid |   -.0068917   .10468045          35
------------+------------------------------------
      Total |  -.00381006    .4401228          87

. *BELIEF HYPOTHESIS HAS USUAL PROBLEM WITH MISSING DATA FOR TEAM 27;
. *WILL AGAIN USE HOT DECK PROCEDURE;
. *NOT CLEAR THAT BELIEF VARIABLE SHOULD BE IMPUTED IN THIS CONTEXT;
. *AS THE BELIEF VARIABLE IS A KEY INDEPENDENT VARIABLE;
. tabulate belief_hypothesis if teamid==27;

BELIEF_HYPO |
     THESIS |      Freq.     Percent        Cum.
------------+-----------------------------------
         NA |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. tabulate belief_ipred if teamid==27;

      belief_ipred |      Freq.     Percent        Cum.
-------------------+-----------------------------------
                NA |          1      100.00      100.00
-------------------+-----------------------------------
             Total |          1      100.00

. tabulate belief_hypothesis if mdegree==40 & team_size==1 & pmale==0;
no observations

. replace belief_hypothesis="Low" if teamid==27;
(1 real change made)

. replace belief_ipred="-1.13508799270782" if teamid==27;
(1 real change made)

. tabulate belief_hypothesis, missing;

BELIEF_HYPO |
     THESIS |      Freq.     Percent        Cum.
------------+-----------------------------------
       High |         31       35.63       35.63
        Low |         22       25.29       60.92
        Mid |         34       39.08      100.00
------------+-----------------------------------
      Total |         87      100.00

. *BELIEF_CAT REVERSES ORDER TO MAKE IT CONSISTENT WITH DATA;
. drop belief_cat;

. generate belief_cat=3*(belief_hypothesis=="Low") + 2*(belief_hypothesis=="Mid") 
>         + 1*(belief_hypothesis=="High");

. tabulate belief_hypothesis belief_cat, missing;

BELIEF_HYP |            belief_cat
   OTHESIS |         1          2          3 |     Total
-----------+---------------------------------+----------
      High |        31          0          0 |        31 
       Low |         0          0         22 |        22 
       Mid |         0         34          0 |        34 
-----------+---------------------------------+----------
     Total |        31         34         22 |        87 

. destring belief_ipred, force replace;
belief_ipred: all characters numeric; replaced as double

. *THERE IS PROBABLY A MISCODING OF WHAT "HIGH BELIEF" MEANS IN DATA SET, DIRECTION IS
>  REVERSED;
. *ALTERNATIVE MEASURE OF BELIEF HYPOTHESIS USING INDIVIDUAL TEAM MEMBER BELIEFS;
. *SEE 002_CRI_DATA_PREP.RMD, LINE 356;
. *SUGGESTS CODING CHANGED FROM QUESTIONNAIRE AND HIGHER VALUES OF BELIEF_H1_11 SHOULD
>  INDICATE MORE BELIEF IN HYPOTHESIS;
. *BUT DISTRIBUTION OF VARIABLE COMPARED TO APPENDIX SUGGESTS THAT 1 IS STRONGLY REDUC
> ES, AND 4 IS SOMEWHAT INCREASES;
. *NOTE HIGH VALUE OF BELIEF_1_AVG MEANS *WEAKER* BELIEF IN HYPOTHESIS IMMIGRATION RED
> UCES SOCIAL SUPPORT;
. *NOTE THAT BELIEF_1_AVG AND BELIEF_H1_11 ARE THE SAME FOR SINGLE PERSON TEAMS;
. tabulate belief_1_avg belief_hypothesis;

                 |        BELIEF_HYPOTHESIS
    belief_1_avg |      High        Low        Mid |     Total
-----------------+---------------------------------+----------
               1 |         0          1          0 |         1 
1.66666666666667 |         0          2          0 |         2 
               2 |         2         15          8 |        25 
2.33333333333333 |         0          2         12 |        14 
             2.5 |         3          0          6 |         9 
2.66666666666667 |         6          0          5 |        11 
               3 |        15          2          3 |        20 
3.33333333333333 |         1          0          0 |         1 
             3.5 |         4          0          0 |         4 
-----------------+---------------------------------+----------
           Total |        31         22         34 |        87 

. tabulate belief_1_avg;

    belief_1_avg |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               1 |          1        1.15        1.15
1.66666666666667 |          2        2.30        3.45
               2 |         25       28.74       32.18
2.33333333333333 |         14       16.09       48.28
             2.5 |          9       10.34       58.62
2.66666666666667 |         11       12.64       71.26
               3 |         20       22.99       94.25
3.33333333333333 |          1        1.15       95.40
             3.5 |          4        4.60      100.00
-----------------+-----------------------------------
           Total |         87      100.00

. tabulate belief_1_avg belief_h1_11 if team_size==1;

                 |           belief_H1_11
    belief_1_avg |         1          2          3 |     Total
-----------------+---------------------------------+----------
               1 |         1          0          0 |         1 
               2 |         0          8          0 |         8 
               3 |         0          0          8 |         8 
-----------------+---------------------------------+----------
           Total |         1          8          8 |        17 

. destring belief_1_avg, force replace;
belief_1_avg: all characters numeric; replaced as double

. destring belief_h1_11, force replace;
belief_h1_11: contains nonnumeric characters; replaced as byte
(1 missing value generated)

. destring belief_h1_12, force replace;
belief_h1_12: contains nonnumeric characters; replaced as byte
(51 missing values generated)

. destring belief_h1_13, force replace;
belief_h1_13: contains nonnumeric characters; replaced as byte
(18 missing values generated)

. tabulate belief_h1_11, missing;

belief_H1_1 |
          1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          3        3.45        3.45
          2 |         50       57.47       60.92
          3 |         28       32.18       93.10
          4 |          5        5.75       98.85
          . |          1        1.15      100.00
------------+-----------------------------------
      Total |         87      100.00

. tabulate belief_h1_12, missing;

belief_H1_1 |
          2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |         17       19.54       19.54
          3 |         19       21.84       41.38
          . |         51       58.62      100.00
------------+-----------------------------------
      Total |         87      100.00

. tabulate belief_h1_13, missing;

belief_H1_1 |
          3 |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |         38       43.68       43.68
          3 |         26       29.89       73.56
          4 |          5        5.75       79.31
          . |         18       20.69      100.00
------------+-----------------------------------
      Total |         87      100.00

. *NBELIEF IS NUMBER IN TEAM THAT BELIEVES HYPOTHESIS IMMIGRATION REDUCES SUPPORT;
. *DBELIEF EQUALS 1 IF MORE THAN HALF THE TEAM BELIEVES IMMIGRATION REDUCES SUPPORT;
. *IF IMMIGRATION REDUCES SUPPORT IT WOULD MEAN THAT THE AME IS NEGATIVE;
. *USE CORRECT MEASURE OF TEAM SIZE TO DEFINE PBELIEF;
. *THE ORIGINAL BELIEF INDICES ONLY HAVE 4 POTENTIAL VALUES SO CANNOT DIFFERENTIATE LO
> WER AND UPPER ENDS;
. generate nbelief=(belief_h1_11<=2 & belief_h1_11~=.) 
>         + (belief_h1_12<=2 & belief_h1_12~=.) + (belief_h1_13<=2 & belief_h1_13~=.);

. replace team=(belief_h1_11~=.) + (belief_h1_12~=.) + (belief_h1_13~=.);
(2 real changes made)

. *generate nbelief=(belief_h1_11<2) + (belief_h1_12<2) + (belief_h1_13<2);
. generate pbelief=nbelief/team;

. tabulate pbelief;

    pbelief |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         21       24.14       24.14
   .3333333 |         10       11.49       35.63
         .5 |         13       14.94       50.57
   .6666667 |         15       17.24       67.82
          1 |         28       32.18      100.00
------------+-----------------------------------
      Total |         87      100.00

. tabulate belief_hypothesis, sum(pbelief);

BELIEF_HYPO |         Summary of pbelief
     THESIS |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |   .20430108   .30033832          31
        Low |   .92424243   .16846076          22
        Mid |   .62254903   .27311898          34
------------+------------------------------------
      Total |   .54980843   .38471687          87

. tabulate belief_hypothesis, sum(belief_ipred);

BELIEF_HYPO |       Summary of belief_ipred
     THESIS |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |   .35405259   .15502166          31
        Low |  -.43933601   .25193769          22
        Mid |  -.01930631   .11867689          34
------------+------------------------------------
      Total |   .00751521   .35204914          87

. tabulate pbelief, sum(belief_ipred);

            |       Summary of belief_ipred
    pbelief |        Mean   Std. dev.       Freq.
------------+------------------------------------
          0 |   .41087404   .16004751          21
   .3333333 |   .15795696   .07255801          10
         .5 |   .04399382   .24131874          13
   .6666667 |  -.12038985   .12135739          15
          1 |  -.29714904   .31560491          28
------------+------------------------------------
      Total |   .00751521   .35204914          87

. *NOTE SIGN IS REVERSED BECAUSE THE ORDERING OF THE BELIEF VARIABLE IN FINAL DATA SET
>  IS INCORRECT;
. generate belief_brw=-belief_ipred;

. tabulate belief_hypothesis, sum(belief_brw);

BELIEF_HYPO |        Summary of belief_brw
     THESIS |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |  -.35405259   .15502166          31
        Low |   .43933601   .25193769          22
        Mid |   .01930631   .11867689          34
------------+------------------------------------
      Total |  -.00751521   .35204914          87

. tabulate pbelief, sum(belief_brw);

            |        Summary of belief_brw
    pbelief |        Mean   Std. dev.       Freq.
------------+------------------------------------
          0 |  -.41087404   .16004751          21
   .3333333 |  -.15795696   .07255801          10
         .5 |  -.04399382   .24131874          13
   .6666667 |   .12038985   .12135739          15
          1 |   .29714904   .31560491          28
------------+------------------------------------
      Total |  -.00751521   .35204914          87

. tabulate belief_cat, sum(belief_brw);

            |        Summary of belief_brw
 belief_cat |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |  -.35405259   .15502166          31
          2 |   .01930631   .11867689          34
          3 |   .43933601   .25193769          22
------------+------------------------------------
      Total |  -.00751521   .35204914          87

. tabulate Hresult hresult;

           |             Hresult
   Hresult |   No test     Reject    Support |     Total
-----------+---------------------------------+----------
   No test |        10          0          0 |        10 
    Reject |         0         54          0 |        54 
   Support |         0          0         23 |        23 
-----------+---------------------------------+----------
     Total |        10         54         23 |        87 

. summ belief_brw stats_brw topic_brw ame;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  belief_brw |         87   -.0075152    .3520491  -.7355577   1.135088
   stats_brw |         87   -.0038101    .4401228  -1.352966   1.099596
   topic_brw |         87   -.0059047    .2821717  -.3396846   1.210172
         ame |         87   -.0093777    .0871169   -.391782   .3595625

. *DO BELIEFS DRIVE NORMATIVE CONCLUSIONS?
> *WEIGHTED BY # OF MODELS SO THAT TEAMS THAT STUDIED THE ISSUE "MORE" COUNT MORE IN T
> HE NORMATIVE REGRESSION;
. *ALTERNATIVE MEASURES OF BELIEF;
. *BELIEF_BRW IS THE FACTOR INDEX IN THE ORIGINAL PAPER TIMES MINUS 1;
. *PBELIEF GIVES THE FRACTION OF THE TEAM THAT STRONGLY BELIEVES IN HYPOTHESIS;
. *HBELIEF IS A DUMMY = 1 IF BELIEF_HYPOTHESIS IS "LOW", WHICH MEANS TEAM REALLY BELIE
> VES THE HYPOTHESIS BASED ON FACTOR INDEX;
. *PB1 = 1 IF MORE THAN HALF TEH TEAM STRONGLY BELIEVES IN HYPOTHESIS;
. generate hbelief=(belief_hypothesis=="Low");

. corr pbelief hbelief;
(obs=87)

             |  pbelief  hbelief
-------------+------------------
     pbelief |   1.0000
     hbelief |   0.5695   1.0000


. *PB1 INDICATES IF MORE THAN HALF THE TEAM STRONGLY BELIEVES IN HYPOTHESIS;
. generate pb1=(pbelief>.5);

. unique teamid hrej;
Number of unique values of teamid hrej is  87
Number of records is  87

.                 *MERGING IN ALTERNATIVE MEASURES OF MEAN AND VARIANCE OF AME FROM MO
> DEL LEVEL DATA;
. sort teamid hrej;

. merge teamid hrej using /volumes/ddisk/data/junkvar.dta;
(you are using old merge syntax; see [D] merge for new syntax)

. drop _merge;

. drop if ame==.;
(1 observation deleted)

. *NOTE THAT HREJ IS NOT CONSTANT WITHIN A TEAM;
. *IT HAS TO DO WITH THE 16 TEAMS THAT PROVIDED CONFLICTING CONCLUSIONS;
. *SO HREJECT IS A MUCH BETTER VARIABLE TO USE IN ANALYSIS;
. tabulate hrej hreject;

           |        Hreject
      Hrej |         0          1 |     Total
-----------+----------------------+----------
         0 |        33          0 |        33 
         1 |        16         38 |        54 
-----------+----------------------+----------
     Total |        49         38 |        87 

. *THE MEAN AME FOR EACH OF THE 87 TEAMS IS EXACTLY EQUAL TO WHAT YOU GET BY COLLAPSIN
> G CRI.DTA INTO 87 TEAMS;
. summ meaname ame;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     meaname |         87   -.0093777    .0871169   -.391782   .3595625
         ame |         87   -.0093777    .0871169   -.391782   .3595625

. *REPLICATING BASIC REGRESSIONS AT TEAM LEVEL;
. regress ame  proindex stats_brw topic_brw i.team_size i.mdegree  , cluster(teamid);

Linear regression                               Number of obs     =         87
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3102
                                                Root MSE          =     .08077

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0126379    .006619     1.91   0.060    -.0005634    .0258392
   stats_brw |   .0781428   .0405516     1.93   0.058    -.0027348    .1590203
   topic_brw |  -.1106207   .0548564    -2.02   0.048    -.2200285    -.001213
             |
   team_size |
          2  |   .0095342   .0157819     0.60   0.548    -.0219417    .0410102
          3  |   .0195399   .0267748     0.73   0.468    -.0338607    .0729406
             |
     mdegree |
          2  |  -.1651952   .0535398    -3.09   0.003    -.2719769   -.0584135
          3  |  -.1739043   .0515987    -3.37   0.001    -.2768145    -.070994
          4  |  -.1758848   .0551528    -3.19   0.002    -.2858837   -.0658859
          5  |  -.1322835   .0680098    -1.95   0.056    -.2679247    .0033577
          6  |  -.1950932   .0552792    -3.53   0.001     -.305344   -.0848423
         20  |  -.1596099   .0538451    -2.96   0.004    -.2670005   -.0522192
         30  |  -.4561749   .0569834    -8.01   0.000    -.5698247   -.3425252
         31  |  -.1683849   .0644617    -2.61   0.011    -.2969496   -.0398201
         32  |   -.199956   .0625569    -3.20   0.002    -.3247218   -.0751902
         33  |  -.1760814   .0652658    -2.70   0.009    -.3062499   -.0459129
         34  |  -.2976156   .0955333    -3.12   0.003    -.4881508   -.1070804
         35  |   -.148131    .048509    -3.05   0.003    -.2448791   -.0513828
             |
       _cons |   .1009015   .0475369     2.12   0.037     .0060922    .1957108
------------------------------------------------------------------------------

. regress ame  group3 stats_brw topic_brw i.team_size i.mdegree  , cluster(teamid);

Linear regression                               Number of obs     =         87
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3446
                                                Root MSE          =     .07874

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |   .0464318   .0170938     2.72   0.008     .0123394    .0805243
   stats_brw |   .0735537     .03801     1.94   0.057    -.0022549    .1493623
   topic_brw |  -.1064783   .0522653    -2.04   0.045    -.2107182   -.0022383
             |
   team_size |
          2  |   .0020467   .0150337     0.14   0.892     -.027937    .0320303
          3  |   .0192735   .0257278     0.75   0.456     -.032039    .0705859
             |
     mdegree |
          2  |  -.1466047   .0503246    -2.91   0.005    -.2469738   -.0462355
          3  |  -.1684638   .0515298    -3.27   0.002    -.2712368   -.0656908
          4  |  -.1668807   .0554141    -3.01   0.004    -.2774006   -.0563608
          5  |  -.1167129   .0644549    -1.81   0.074     -.245264    .0118383
          6  |  -.1801891   .0546112    -3.30   0.002    -.2891078   -.0712704
         20  |  -.1512221   .0592978    -2.55   0.013    -.2694879   -.0329563
         30  |  -.4469402    .060448    -7.39   0.000    -.5674999   -.3263805
         31  |  -.1543256   .0639504    -2.41   0.018    -.2818707   -.0267805
         32  |  -.1889593   .0602411    -3.14   0.002    -.3091064   -.0688123
         33  |  -.1485327   .0630905    -2.35   0.021    -.2743627   -.0227027
         34  |  -.2786427   .0866008    -3.22   0.002    -.4513626   -.1059229
         35  |  -.1228555   .0479627    -2.56   0.013    -.2185141   -.0271969
             |
       _cons |   .1208335   .0426007     2.84   0.006     .0358691    .2057979
------------------------------------------------------------------------------

. regress ame  group1 group3 stats_brw topic_brw i.team_size i.mdegree  , cluster(team
> id);

Linear regression                               Number of obs     =         87
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3644
                                                Root MSE          =      .0781

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0499726   .0314847    -1.59   0.117    -.1127668    .0128217
      group3 |   .0330969   .0167899     1.97   0.053    -.0003895    .0665832
   stats_brw |   .0710091    .036925     1.92   0.059    -.0026355    .1446536
   topic_brw |  -.1113243    .052845    -2.11   0.039    -.2167203   -.0059283
             |
   team_size |
          2  |  -.0014988   .0150739    -0.10   0.921    -.0315629    .0285652
          3  |   .0175292   .0255937     0.68   0.496    -.0335158    .0685742
             |
     mdegree |
          2  |  -.1939626     .06331    -3.06   0.003    -.3202305   -.0676947
          3  |  -.1965547   .0564624    -3.48   0.001    -.3091655    -.083944
          4  |  -.1984609   .0609895    -3.25   0.002    -.3201007   -.0768211
          5  |  -.1486915   .0703796    -2.11   0.038    -.2890592   -.0083238
          6  |   -.215047   .0609124    -3.53   0.001    -.3365329   -.0935611
         20  |  -.1845527   .0609837    -3.03   0.003     -.306181   -.0629245
         30  |  -.4777392   .0646484    -7.39   0.000    -.6066763   -.3488021
         31  |  -.1861419   .0701316    -2.65   0.010     -.326015   -.0462689
         32  |  -.2082969   .0594302    -3.50   0.001    -.3268267   -.0897671
         33  |  -.1413529   .0623076    -2.27   0.026    -.2656216   -.0170842
         34  |  -.3178433   .0962053    -3.30   0.002    -.5097187    -.125968
         35  |  -.1682331   .0569114    -2.96   0.004    -.2817394   -.0547268
             |
       _cons |   .1663513   .0561716     2.96   0.004     .0543206    .2783819
------------------------------------------------------------------------------

. log close;
      name:  <unnamed>
       log:  /volumes/ddisk/mi/researcher/reg_teamlevel.log
  log type:  text
 closed on:  11 Oct 2024, 08:20:07
--------------------------------------------------------------------------------------
