--------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /volumes/ddisk/mi/researcher/reg_hours.log
  log type:  text
 opened on:  25 Sep 2024, 13:19:41

. clear matrix;

. clear mata;

. *LABOR SUPPLY REGRESSIONS;
. use "/Volumes/Ddisk/MI/Researcher/model.dta", clear;

. *GET HOURS OF WORK FOR EACH OF THE UP TO THREE TEAM MEMBERS;
. destring v_331, force replace;
v_331: contains nonnumeric characters; replaced as double
(20 missing values generated)

. destring v_332, force replace;
v_332: contains nonnumeric characters; replaced as byte
(700 missing values generated)

. destring v_333,force replace;
v_333: contains nonnumeric characters; replaced as double
(289 missing values generated)

. summ v_33*;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       v_331 |      1,233    13.87105    40.82286          0        300
       v_332 |        553    6.761302    3.019409          2         25
       v_333 |        964    8.248963    5.389815          1         30

. *NUMBER OF TEAM MEMBERS WITH NON-MISSING HOURS;
. replace team=(v_331~=.) + (v_332~=.) + (v_333~=.);
(24 real changes made)

. tabulate team_size team;

           |               team
 team_size |         1          2          3 |     Total
-----------+---------------------------------+----------
         1 |       277          0          0 |       277 
         2 |        12        367         20 |       399 
         3 |        20         24        533 |       577 
-----------+---------------------------------+----------
     Total |       309        391        553 |     1,253 

. generate hours1=v_331;
(20 missing values generated)

. generate hours2=v_332;
(700 missing values generated)

. generate hours3=v_333;
(289 missing values generated)

. replace hours1=0 if hours1==.;
(20 real changes made)

. replace hours2=0 if hours2==.;
(700 real changes made)

. replace hours3=0 if hours3==.;
(289 real changes made)

. list hours* if teamid==60;

      +--------------------------+
      | hours1   hours2   hours3 |
      |--------------------------|
 653. |    300        0        0 |
 654. |    300        0        0 |
 655. |    300        0        0 |
 656. |    300        0        0 |
 657. |    300        0        0 |
      |--------------------------|
 658. |    300        0        0 |
 659. |    300        0        0 |
 660. |    300        0        0 |
 661. |    300        0        0 |
 662. |    300        0        0 |
      |--------------------------|
 663. |    300        0        0 |
 664. |    300        0        0 |
 665. |    300        0        0 |
 666. |    300        0        0 |
 667. |    300        0        0 |
      |--------------------------|
 668. |    300        0        0 |
 669. |    300        0        0 |
 670. |    300        0        0 |
 671. |    300        0        0 |
 672. |    300        0        0 |
      |--------------------------|
 673. |    300        0        0 |
 674. |    300        0        0 |
 675. |    300        0        0 |
 676. |    300        0        0 |
      +--------------------------+

. *CHANGING HOURS WORKED FOR OUTLYING TEAM 60;
. *THE VALUE 300 MAY INCLUDE TIME LEARNING STATA;
. *CHANGE TEAM 60 HOURS AT THE BEGINNING OF ANY VARIABLE GENERATION;
. *WILL SET TO THE HIGHEST OBSERVED VALUE AMONG OTHER PARTICIPANTS, OR 30;
. replace hours1=30 if hours1==300;
(24 real changes made)

. generate sumhours=hours1+hours2+hours3;

. tabulate sumhours;

   sumhours |      Freq.     Percent        Cum.
------------+-----------------------------------
          4 |         12        0.96        0.96
          5 |         12        0.96        1.92
        5.5 |          4        0.32        2.23
          7 |        152       12.13       14.37
          8 |         12        0.96       15.32
        9.5 |         20        1.60       16.92
         10 |        150       11.97       28.89
         11 |          8        0.64       29.53
         12 |         59        4.71       34.24
         13 |         20        1.60       35.83
         14 |         28        2.23       38.07
         15 |         96        7.66       45.73
         16 |         35        2.79       48.52
         17 |         17        1.36       49.88
         18 |         26        2.08       51.96
         19 |         76        6.07       58.02
         20 |        112        8.94       66.96
         21 |         12        0.96       67.92
         22 |         60        4.79       72.71
         23 |         58        4.63       77.33
         24 |         30        2.39       79.73
         25 |         54        4.31       84.04
       25.5 |         24        1.92       85.95
         26 |         37        2.95       88.91
         27 |         20        1.60       90.50
         28 |          2        0.16       90.66
         29 |         28        2.23       92.90
         30 |         24        1.92       94.81
         32 |          2        0.16       94.97
         33 |          3        0.24       95.21
         39 |         12        0.96       96.17
         40 |         12        0.96       97.13
         46 |         36        2.87      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. generate meanhours=sumhours/team;

. summ sumhours meanhours;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    sumhours |      1,253    17.80846    8.920219          4         46
   meanhours |      1,253    8.873903    5.037831       2.75         30

. generate lsumhours=log(sumhours);

. generate lmeanhours=log(meanhours);

. *GET VARIABLES MEASURING SKILLS IN STATS & POLICY AT INDIVIDUAL LEVEL;
. rename backgr_exp_teach_stat1 teach1;

. rename backgr_exp_teach_stat2 teach2;

. rename backgr_exp_teach_stat3 teach3;

. destring teach1 teach2 teach3, force replace;
teach1: contains nonnumeric characters; replaced as byte
(20 missing values generated)
teach2: contains nonnumeric characters; replaced as byte
(676 missing values generated)
teach3: contains nonnumeric characters; replaced as byte
(289 missing values generated)

. rename v_181 pubstat1;

. rename v_182 pubstat2;

. rename v_183 pubstat3;

. destring pubstat1 pubstat2 pubstat3, force replace;
pubstat1: contains nonnumeric characters; replaced as byte
(20 missing values generated)
pubstat2: contains nonnumeric characters; replaced as byte
(676 missing values generated)
pubstat3: contains nonnumeric characters; replaced as byte
(341 missing values generated)

. rename v_211 pubreg1;

. rename v_212 pubreg2;

. rename v_213 pubreg3;

. destring pubreg1 pubreg2 pubreg3, force replace;
pubreg1: contains nonnumeric characters; replaced as byte
(20 missing values generated)
pubreg2: contains nonnumeric characters; replaced as byte
(676 missing values generated)
pubreg3: contains nonnumeric characters; replaced as byte
(337 missing values generated)

. rename v_171 pubimm1;

. rename v_172 pubimm2;

. rename v_173 pubimm3;

. destring pubimm1 pubimm2 pubimm3, force replace;
pubimm1: contains nonnumeric characters; replaced as byte
(20 missing values generated)
pubimm2: contains nonnumeric characters; replaced as byte
(676 missing values generated)
pubimm3: contains nonnumeric characters; replaced as byte
(289 missing values generated)

. rename v_191 pubpol1;

. rename v_192 pubpol2;

. rename v_193 pubpol3;

. destring pubpol1 pubpol2 pubpol3, force replace;
pubpol1: contains nonnumeric characters; replaced as byte
(20 missing values generated)
pubpol2: contains nonnumeric characters; replaced as byte
(676 missing values generated)
pubpol3: contains nonnumeric characters; replaced as byte
(341 missing values generated)

. *MAKES NO SENSE TO RUN HOURS REGRESSIONS AT MODEL LEVEL;
. *COLLAPSE TO TEAM LEVEL ;
. collapse (mean) sumhours lsumhours meanhours lmeanhours p12 p56  pmale pindex hours1
>  hours2 hours3
>         att1 att2 att3 ame degree1 degree2 degree3
>         pubstat1 pubstat2 pubstat3 pubimm1 pubimm2 pubimm3 pubpol1 pubpol2 pubpol3 t
> each1 teach2 teach3
>         pubreg1 pubreg2 pubreg3 
>         proindex dindex group1 group3 index team_size t2 t3 nmodel 
>         stats_brw topic_brw model_brw mdegree, by(teamid);

. *WEIGHING BY INVERSE OF TEAM SIZE ;
. *AVERAGE HOURS WORKED BY RESEARCHER MEANS AS JUST FOR A 1 PERSON TEAM AS FOR A 3 PER
> SON TEAM;
.         summ sumhours, detail;

                       (mean) sumhours
-------------------------------------------------------------
      Percentiles      Smallest
 1%            4              4
 5%            7              5
10%            8            5.5       Obs                  71
25%           12              7       Sum of wgt.          71

50%           17                      Mean            18.3169
                        Largest       Std. dev.      8.615285
75%           24             33
90%           29             39       Variance       74.22314
95%           33             40       Skewness       .7744528
99%           46             46       Kurtosis       3.634685

. reg lsumhours  group1 group3    team_size stats_brw topic_brw   t2 t3 i.mdegree [aw=
> 1/team_size]  ,  cluster(teamid);
(sum of wgt is 37.5)
note: t3 omitted because of collinearity.

Linear regression                               Number of obs     =         71
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5051
                                                Root MSE          =     .43928

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
   lsumhours | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .2502704   .2146541     1.17   0.248    -.1778438    .6783846
      group3 |   .2765535   .1457773     1.90   0.062    -.0141902    .5672972
   team_size |   .4503363   .1384698     3.25   0.002      .174167    .7265056
   stats_brw |  -.3532741   .1703778    -2.07   0.042    -.6930819   -.0134663
   topic_brw |   .3601789   .3127443     1.15   0.253      -.26357    .9839277
          t2 |   .0413818   .2670996     0.15   0.877    -.4913315    .5740951
          t3 |          0  (omitted)
             |
     mdegree |
          2  |   .5301638   .3538801     1.50   0.139    -.1756279    1.235955
          3  |  -.1441058    .321108    -0.45   0.655    -.7845354    .4963239
          4  |  -.2354354   .3311932    -0.71   0.480    -.8959794    .4251086
          5  |   .3829256   .4316692     0.89   0.378    -.4780114    1.243863
          6  |  -.5819217   .4565338    -1.27   0.207     -1.49245    .3286064
         20  |  -.0643637   .3833604    -0.17   0.867    -.8289518    .7002245
         30  |  -1.159525   .3147566    -3.68   0.000    -1.787288   -.5317631
         31  |  -.2063002   .4192718    -0.49   0.624    -1.042511     .629911
         32  |  -.4027128   .3191233    -1.26   0.211    -1.039184    .2337585
         33  |    -.64333   .3246695    -1.98   0.051    -1.290863    .0042029
         34  |  -.2285369   .4751571    -0.48   0.632    -1.176208    .7191342
             |
       _cons |   1.745628   .5342928     3.27   0.002     .6800143    2.811241
------------------------------------------------------------------------------

. reg lmeanhours  group1 group3    team_size stats_brw topic_brw   t2 t3 i.mdegree  [a
> w=1/team_size] ,  cluster(teamid);
(sum of wgt is 37.5)
note: t3 omitted because of collinearity.

Linear regression                               Number of obs     =         71
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4030
                                                Root MSE          =     .43285

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
  lmeanhours | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .3724246   .1907207     1.95   0.055    -.0079558     .752805
      group3 |   .2995525   .1420523     2.11   0.039     .0162382    .5828669
   team_size |   .0430707   .1442889     0.30   0.766    -.2447045    .3308458
   stats_brw |  -.3512698   .1754185    -2.00   0.049     -.701131   -.0014085
   topic_brw |   .3599866   .3255448     1.11   0.273    -.2892921    1.009265
          t2 |   .2858255   .2630357     1.09   0.281    -.2387827    .8104338
          t3 |          0  (omitted)
             |
     mdegree |
          2  |   .6498734   .3143504     2.07   0.042     .0229213    1.276826
          3  |  -.0734213    .295199    -0.25   0.804    -.6621771    .5153345
          4  |  -.1217888    .292015    -0.42   0.678    -.7041944    .4606168
          5  |   .4430208   .3910553     1.13   0.261    -.3369143    1.222956
          6  |   -.484876   .4177838    -1.16   0.250    -1.318119    .3483675
         20  |  -.0687525   .3511389    -0.20   0.845     -.769077     .631572
         30  |  -.0038311   .2991075    -0.01   0.990    -.6003823    .5927201
         31  |   -.158493   .4175314    -0.38   0.705     -.991233    .6742471
         32  |  -.3644214   .3102125    -1.17   0.244    -.9831207    .2542778
         33  |  -.6861335   .3337082    -2.06   0.044    -1.351694   -.0205736
         34  |  -.1605354   .4658392    -0.34   0.731    -1.089623    .7685516
             |
       _cons |   1.788967   .5171192     3.46   0.001     .7576053    2.820329
------------------------------------------------------------------------------

. *LABOR SUPPLY REGRESSIONS AT INDIVIDUAL LEVEL;
. replace att1=0 if att1==.;
(2 real changes made)

. replace att2=0 if att2==.;
(42 real changes made)

. replace att3=0 if att3==.;
(15 real changes made)

. keep att1 att2 att3 hours1 hours2 hours3 proindex pindex group1 group3 p12 p56 
>         nmodel stats_brw topic_brw model_brw 
>         pubstat1 pubstat2 pubstat3 pubimm1 pubimm2 pubimm3 pubpol1 pubpol2 pubpol3 t
> each1 teach2 teach3
>         pubreg1 pubreg2 pubreg3 
>         degree1 degree2 degree3 team_size t2 t3 teamid;

. reshape long att hours degree pubstat pubreg pubimm pubpol teach diff, i(teamid);
(j = 1 2 3)
(variable diff1 not found)
(variable diff2 not found)
(variable diff3 not found)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations               71   ->   213         
Number of variables                  38   ->   24          
j variable (3 values)                     ->   _j
xij variables:
                         att1 att2 att3   ->   att
                   hours1 hours2 hours3   ->   hours
                degree1 degree2 degree3   ->   degree
             pubstat1 pubstat2 pubstat3   ->   pubstat
                pubreg1 pubreg2 pubreg3   ->   pubreg
                pubimm1 pubimm2 pubimm3   ->   pubimm
                pubpol1 pubpol2 pubpol3   ->   pubpol
                   teach1 teach2 teach3   ->   teach
                      diff1 diff2 diff3   ->   diff
-----------------------------------------------------------------------------

. generate lhours=log(hours);
(59 missing values generated)

. replace att=. if att==0;
(59 real changes made, 59 to missing)

. generate anti=(att<=2 & att~=.);

. generate pro=(att>=5 & att~=.);

. replace anti=. if att==0;
(0 real changes made)

. replace pro=. if att==0;
(0 real changes made)

. replace degree=. if degree==0;
(0 real changes made)

. replace diff=. if diff==0;
(0 real changes made)

. *REGRESSIONS MEASURING STAT SKILLS AND TOPICAL EXPERIENCE AT INDIVIDUAL LEVEL;
. gen stat=(pubstat==2 | pubstat==3);

. gen reg=(pubreg==2 | pubreg==3);

. gen imm=(pubimm==2 | pubimm==3);

. gen pol=(pubpol==2 | pubpol==3);

. gen method=(stat==1 | reg==1);

. gen topic=(imm==1 | pol==1);

. replace stat=. if pubstat==.;
(59 real changes made, 59 to missing)

. replace reg=. if pubreg==.;
(58 real changes made, 58 to missing)

. replace imm=. if pubimm==.;
(57 real changes made, 57 to missing)

. replace pol=. if pubpol==.;
(59 real changes made, 59 to missing)

. replace method=. if pubstat==. | pubreg==.;
(59 real changes made, 59 to missing)

. replace topic=. if pubimm==. | pubpol==.;
(59 real changes made, 59 to missing)

. summ stat reg imm pol method topic;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        stat |        154    .3701299    .4844146          0          1
         reg |        155    .6193548    .4871194          0          1
         imm |        156    .4102564    .4934643          0          1
         pol |        154    .2922078    .4562611          0          1
      method |        154    .6948052    .4619923          0          1
-------------+---------------------------------------------------------
       topic |        154    .5064935     .501589          0          1

. regress lhours anti pro method topic i.degree, cluster(teamid);

Linear regression                               Number of obs     =        152
                                                F(9, 70)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1422
                                                Root MSE          =     .59532

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      lhours | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        anti |   .3032436   .1381798     2.19   0.032     .0276526    .5788345
         pro |   .0599161    .106627     0.56   0.576    -.1527448    .2725769
      method |  -.0194256   .1146736    -0.17   0.866    -.2481348    .2092837
       topic |   -.285491   .0950106    -3.00   0.004    -.4749836   -.0959984
             |
      degree |
          2  |  -.3253841   .4420801    -0.74   0.464    -1.207085    .5563169
          3  |   .2202336   .3165455     0.70   0.489    -.4110965    .8515637
          4  |  -.0302297   .3051673    -0.10   0.921    -.6388668    .5784073
          5  |   .5884167   .3282214     1.79   0.077    -.0662002    1.243034
          6  |   .2524208   .3211903     0.79   0.435    -.3881731    .8930147
          7  |   .1973646   .3023072     0.65   0.516    -.4055681    .8002972
             |
       _cons |   1.901503   .3195015     5.95   0.000     1.264277    2.538728
------------------------------------------------------------------------------

. regress lhours anti pro team_size method topic i.degree, cluster(teamid);

Linear regression                               Number of obs     =        152
                                                F(10, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1841
                                                Root MSE          =     .58264

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      lhours | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        anti |   .2752025   .1349748     2.04   0.045     .0060037    .5444012
         pro |   .0308758   .1048933     0.29   0.769    -.1783274    .2400789
   team_size |  -.2004433   .0692324    -2.90   0.005     -.338523   -.0623636
      method |  -.0108234   .1121501    -0.10   0.923    -.2344996    .2128529
       topic |   -.277482    .094988    -2.92   0.005    -.4669295   -.0880345
             |
      degree |
          2  |  -.3338456   .3334812    -1.00   0.320     -.998953    .3312617
          3  |   .2650449   .2306192     1.15   0.254    -.1949106    .7250004
          4  |  -.0236063    .220457    -0.11   0.915    -.4632939    .4160813
          5  |   .5464349   .2553392     2.14   0.036     .0371768    1.055693
          6  |   .1685848   .2488981     0.68   0.500    -.3278268    .6649964
          7  |   .1061212   .2214902     0.48   0.633     -.335627    .5478695
             |
       _cons |    2.38503   .2799484     8.52   0.000     1.826691     2.94337
------------------------------------------------------------------------------

. log close;
      name:  <unnamed>
       log:  /volumes/ddisk/mi/researcher/reg_hours.log
  log type:  text
 closed on:  25 Sep 2024, 13:19:41
--------------------------------------------------------------------------------------
