--------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/GitHub/ideology_specification/code/Log Files/01_Table1.log
  log type:  text
 opened on:  11 Dec 2024, 10:39:42

. clear matrix;

. clear mata;

. use "$workd/data/df.dta", clear;

. *DESCRIPTIVE TABLE AT THE MODEL LEVEL;
. tabulate topic_knowledge, sum(topic_brw);

TOPIC_KNOWL | Summary of topic_brw (standardized)
       EDGE |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |   .98677109   1.2708581         390
        Low |  -.73706552   .08243491         378
        Mid |  -.21903083   .16262347         485
------------+------------------------------------
      Total |   4.821e-09   .99999997       1,253

. tabulate statistics_skill, sum(stats_brw);

STATISTICS_ | Summary of stats_brw (standardized)
      SKILL |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |   1.8153467   .57465209         178
        Low |  -1.1522399   .59817124         282
        Mid |    .0022698   .40825837         793
------------+------------------------------------
      Total |  -2.474e-09           1       1,253

. tabulate model_score, sum(model_brw);

            |        Summary of model_brw
MODEL_SCORE |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |   .59514352   .03268489         294
        Low |   .31438404   .03962311         417
        Mid |   .46895185   .04982655         542
------------+------------------------------------
      Total |   .44712071   .11429906       1,253

. generate hmodel=(model_score=="High");

. summ ame neg10 pos10 negsig possig neg10s pos10s proindex  p12 p34 p56 group1 group2 group3 pbel
> ief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean zpeer_mean quality quality2  ;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |      1,253    .0007771    .1865197  -1.353765       2.47
       neg10 |      1,253    .1005587    .3008635          0          1
       pos10 |      1,253    .1005587    .3008635          0          1
      negsig |      1,253    .2466081    .4312087          0          1
      possig |      1,253    .1859537    .3892247          0          1
-------------+---------------------------------------------------------
      neg10s |      1,253    .0630487    .2431475          0          1
      pos10s |      1,253    .0526736    .2234702          0          1
    proindex |      1,253    4.462357    1.135022          1          6
         p12 |      1,253    .0782123    .2255071          0          1
         p34 |      1,253    .3812184    .3933172          0          1
-------------+---------------------------------------------------------
         p56 |      1,253    .5405693    .4084319          0          1
      group1 |      1,253    .1069433    .3091646          0          1
      group2 |      1,253     .434158    .4958438          0          1
      group3 |      1,253    .4588986    .4985068          0          1
     pbelief |      1,253    .5810056    .4018672          0          1
-------------+---------------------------------------------------------
      nmodel |      1,253    39.14525    32.66706          1        112
   team_size |      1,253     2.24581    .8044855          1          3
   stats_brw |      1,253   -2.47e-09           1  -3.135104   2.681392
   topic_brw |      1,253    4.82e-09           1  -.9688011   3.983361
   model_brw |      1,253    .4471207    .1142991   .1488998   .7288508
-------------+---------------------------------------------------------
   peer_mean |      1,215    4.203944    .5266504          2   5.666667
  zpeer_mean |      1,215   -8.28e-09    .9999999  -4.184832   2.777408
     quality |      1,253    .2346369    .4239409          0          1
    quality2 |      1,215    .2271605    .4191697          0          1

. summ ame neg10 pos10 negsig possig neg10s pos10s proindex  p12 p34 p56 group1 group2 group3 pbel
> ief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean zpeer_mean quality quality2  if index==1 ;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |        134   -.0188496    .0971865    -.40887     .42193
       neg10 |        134    .1492537    .3576755          0          1
       pos10 |        134    .0522388    .2233432          0          1
      negsig |        134    .2761194    .4487542          0          1
      possig |        134    .2238806    .4184071          0          1
-------------+---------------------------------------------------------
      neg10s |        134     .119403    .3254789          0          1
      pos10s |        134    .0373134    .1902399          0          1
    proindex |        134    2.422886    .9508947          1   3.666667
         p12 |        134    .6318408    .3173319   .3333333          1
         p34 |        134    .2636816    .2488894          0   .6666667
-------------+---------------------------------------------------------
         p56 |        134    .1044776    .1552098          0   .3333333
      group1 |        134           1           0          1          1
      group2 |        134           0           0          0          0
      group3 |        134           0           0          0          0
     pbelief |        134    .7263682    .3266261          0          1
-------------+---------------------------------------------------------
      nmodel |        134    18.83582     6.23499          2         24
   team_size |        134     2.19403    .9846767          1          3
   stats_brw |        134   -.3747827     1.25259  -3.135104   1.657985
   topic_brw |        134   -.0740727    .5645725  -.7924486   .8616194
   model_brw |        134    .4336417    .1041899   .2631785   .5655868
-------------+---------------------------------------------------------
   peer_mean |        134    4.221775     .463432   3.142857        5.2
  zpeer_mean |        134    .0338582    .8799613  -2.014783   1.891304
     quality |        134    .1940299    .3969359          0          1
    quality2 |        134    .1641791     .371828          0          1

. summ ame neg10 pos10 negsig possig neg10s pos10s proindex  p12 p34 p56 group1 group2 group3 pbel
> ief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean zpeer_mean quality quality2  if index==2;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |        544   -.0081035    .1192952  -1.353765   1.306339
       neg10 |        544    .1066176    .3089106          0          1
       pos10 |        544    .0882353    .2838978          0          1
      negsig |        544    .2849265    .4517949          0          1
      possig |        544    .1636029    .3702553          0          1
-------------+---------------------------------------------------------
      neg10s |        544    .0863971    .2812081          0          1
      pos10s |        544    .0496324    .2173841          0          1
    proindex |        544    3.992034      .50861          3          5
         p12 |        544           0           0          0          0
         p34 |        544    .7745098    .2141213         .5          1
-------------+---------------------------------------------------------
         p56 |        544    .2254902    .2141213          0         .5
      group1 |        544           0           0          0          0
      group2 |        544           1           0          1          1
      group3 |        544           0           0          0          0
     pbelief |        544      .46875     .398924          0          1
-------------+---------------------------------------------------------
      nmodel |        544    43.60294    37.49648          2        112
   team_size |        544    2.426471    .6551381          1          3
   stats_brw |        544   -.1757258    .8062337  -2.157197   2.003577
   topic_brw |        544   -.0944523    .7348587  -.9688011   2.794734
   model_brw |        544    .4716328    .1189273   .2382641   .6065403
-------------+---------------------------------------------------------
   peer_mean |        520    4.385812    .4162295        2.3   5.666667
  zpeer_mean |        520    .3453296    .7903335  -3.615195   2.777408
     quality |        544    .3860294    .4872855          0          1
    quality2 |        520    .3134615    .4643469          0          1

. summ ame neg10 pos10 negsig possig neg10s pos10s proindex  p12 p34 p56 group1 group2 group3 pbel
> ief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean zpeer_mean quality quality2  if index==3;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |        575    .0137527    .2447405   -1.13019       2.47
       neg10 |        575    .0834783    .2768446          0          1
       pos10 |        575    .1234783    .3292718          0          1
      negsig |        575    .2034783    .4029357          0          1
      possig |        575    .1982609    .3990369          0          1
-------------+---------------------------------------------------------
      neg10s |        575    .0278261    .1646175          0          1
      pos10s |        575    .0591304     .236074          0          1
    proindex |        575    5.382609    .5716111          4          6
         p12 |        575    .0231884    .0848781          0   .3333333
         p34 |        575    .0365217    .1042063          0   .3333333
-------------+---------------------------------------------------------
         p56 |        575    .9402899    .1279318   .6666667          1
      group1 |        575           0           0          0          0
      group2 |        575           0           0          0          0
      group3 |        575           1           0          1          1
     pbelief |        575    .6533333    .3935406          0          1
-------------+---------------------------------------------------------
      nmodel |        575    39.66087    29.54949          1         96
   team_size |        575    2.086957    .8509599          1          3
   stats_brw |        575    .2535925    1.037427  -1.973267   2.681392
   topic_brw |        575    .1066222    1.255131   -.882254   3.983361
   model_brw |        575    .4270714    .1076379   .1488998   .7288508
-------------+---------------------------------------------------------
   peer_mean |        561    4.031108    .5735789          2       5.25
  zpeer_mean |        561   -.3281789    1.089107  -4.184832   1.986244
     quality |        575    .1008696    .3014181          0          1
    quality2 |        561    .1622103    .3689727          0          1

. *SUMMARY STATS WEIGHTED BY THE INVERSE OF THE NUMBER OF MODELS;
. summ ame neg10 pos10 negsig possig neg10s pos10s proindex  p12 p34 p56 group1 group2 group3 pbel
> ief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean zpeer_mean quality quality2   [aw=1/nmodel];

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
         ame |   1,253          71   -.0085083   .2038202  -1.353765       2.47
       neg10 |   1,253          71    .1382308   .3452798          0          1
       pos10 |   1,253          71    .1143123   .3183172          0          1
      negsig |   1,253          71     .318356   .4660244          0          1
      possig |   1,253          71    .1916886   .3937865          0          1
-------------+-----------------------------------------------------------------
      neg10s |   1,253          71    .1026884   .3036726          0          1
      pos10s |   1,253          71     .069587   .2545512          0          1
    proindex |   1,253          71    4.300469    1.10691          1          6
         p12 |   1,253          71    .0938967   .2514385          0          1
         p34 |   1,253          71    .3967136   .3830483          0          1
-------------+-----------------------------------------------------------------
         p56 |   1,253          71    .5093897   .4005581          0          1
      group1 |   1,253          71    .1267606   .3328374          0          1
      group2 |   1,253          71    .4366197   .4961647          0          1
      group3 |   1,253          71    .4366197   .4961647          0          1
     pbelief |   1,253          71    .5492958    .387144          0          1
-------------+-----------------------------------------------------------------
      nmodel |   1,253          71    17.64789   19.48554          1        112
   team_size |   1,253          71    2.225352   .7730334          1          3
   stats_brw |   1,253          71    .0396539   1.039974  -3.135104   2.681392
   topic_brw |   1,253          71    .0888869   .9161063  -.9688011   3.983361
   model_brw |   1,253          71    .4356287   .1163981   .1488998   .7288508
-------------+-----------------------------------------------------------------
   peer_mean |   1,215      69.625    4.231731   .6211737          2   5.666667
  zpeer_mean |   1,215      69.625    .0527623    1.17948  -4.184832   2.777408
     quality |   1,253          71    .2042254   .4032954          0          1
    quality2 |   1,215      69.625    .3105326   .4629022          0          1

. summ ame neg10 pos10 negsig possig neg10s pos10s proindex  p12 p34 p56 group1 group2 group3 pbel
> ief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean zpeer_mean quality quality2  if index==1  [aw=1/
> nmodel];

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
         ame |     134           9   -.0444999   .1254703    -.40887     .42193
       neg10 |     134           9    .2561728   .4381564          0          1
       pos10 |     134           9     .058642    .235835          0          1
      negsig |     134           9    .3487654   .4783679          0          1
      possig |     134           9    .1867284   .3911556          0          1
-------------+-----------------------------------------------------------------
      neg10s |     134           9    .2283951   .4213737          0          1
      pos10s |     134           9    .0432099   .2040922          0          1
    proindex |     134           9     2.37037   .9256753          1   3.666667
         p12 |     134           9    .6666667   .3154489   .3333333          1
         p34 |     134           9    .2592593   .2628741          0   .6666667
-------------+-----------------------------------------------------------------
         p56 |     134           9    .0740741   .1390999          0   .3333333
      group1 |     134           9           1          0          1          1
      group2 |     134           9           0          0          0          0
      group3 |     134           9           0          0          0          0
     pbelief |     134           9    .7037037   .3325124          0          1
-------------+-----------------------------------------------------------------
      nmodel |     134           9    14.88889   7.694627          2         24
   team_size |     134           9    2.111111   .9975371          1          3
   stats_brw |     134           9   -.5470347    1.39029  -3.135104   1.657985
   topic_brw |     134           9   -.1700019   .4903741  -.7924486   .8616194
   model_brw |     134           9    .4317806   .1071579   .2631785   .5655868
-------------+-----------------------------------------------------------------
   peer_mean |     134           9    4.249944   .5633377   3.142857        5.2
  zpeer_mean |     134           9    .0873444   1.069661  -2.014783   1.891304
     quality |     134           9    .2222222   .4172997          0          1
    quality2 |     134           9    .2592593   .4398725          0          1

. summ ame neg10 pos10 negsig possig neg10s pos10s proindex  p12 p34 p56 group1 group2 group3 pbel
> ief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean zpeer_mean quality quality2  if index==2 [aw=1/n
> model];

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
         ame |     544          31   -.0124995   .2030918  -1.353765   1.306339
       neg10 |     544          31    .1548099   .3620563          0          1
       pos10 |     544          31     .127381   .3337061          0          1
      negsig |     544          31    .3712526   .4835845          0          1
      possig |     544          31    .2047395   .4038825          0          1
-------------+-----------------------------------------------------------------
      neg10s |     544          31    .1326805   .3395413          0          1
      pos10s |     544          31    .0784178   .2690754          0          1
    proindex |     544          31    3.962366   .5184506          3          5
         p12 |     544          31           0          0          0          0
         p34 |     544          31    .7580645   .2390893         .5          1
-------------+-----------------------------------------------------------------
         p56 |     544          31    .2419355   .2390893          0         .5
      group1 |     544          31           0          0          0          0
      group2 |     544          31           1          0          1          1
      group3 |     544          31           0          0          0          0
     pbelief |     544          31    .5107527    .397342          0          1
-------------+-----------------------------------------------------------------
      nmodel |     544          31    17.54839   21.40228          2        112
   team_size |     544          31    2.193548   .6441387          1          3
   stats_brw |     544          31    .0865177   .9487247  -2.157197   2.003577
   topic_brw |     544          31    .1541247     .92094  -.9688011   2.794734
   model_brw |     544          31    .4439963   .1046128   .2382641   .6065403
-------------+-----------------------------------------------------------------
   peer_mean |     520       30.25    4.369521   .5874801        2.3   5.666667
  zpeer_mean |     520       30.25    .3143978   1.115503  -3.615195   2.777408
     quality |     544          31    .2419355   .4286496          0          1
    quality2 |     520       30.25    .4165289   .4934581          0          1

. summ ame neg10 pos10 negsig possig neg10s pos10s proindex  p12 p34 p56 group1 group2 group3 pbel
> ief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean zpeer_mean quality quality2  if index==3 [aw=1/n
> model];

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
         ame |     575          31    .0059321   .2210154   -1.13019       2.47
       neg10 |     575          31    .0874104   .2826814          0          1
       pos10 |     575          31    .1174059   .3221836          0          1
      negsig |     575          31    .2566308   .4371542          0          1
      possig |     575          31    .1800777   .3845867          0          1
-------------+-----------------------------------------------------------------
      neg10s |     575          31    .0362007   .1869519          0          1
      pos10s |     575          31     .068414   .2526748          0          1
    proindex |     575          31    5.198925   .5349724          4          6
         p12 |     575          31    .0215054   .0819613          0   .3333333
         p34 |     575          31    .0752688   .1394921          0   .3333333
-------------+-----------------------------------------------------------------
         p56 |     575          31    .9032258   .1514355   .6666667          1
      group1 |     575          31           0          0          0          0
      group2 |     575          31           0          0          0          0
      group3 |     575          31           1          0          1          1
     pbelief |     575          31    .5430108   .3812562          0          1
-------------+-----------------------------------------------------------------
      nmodel |     575          31    18.54839   19.80618          1         96
   team_size |     575          31    2.290323   .8116613          1          3
   stats_brw |     575          31     .163119   .9507433  -1.973267   2.681392
   topic_brw |     575          31    .0988103   .9912889   -.882254   3.983361
   model_brw |     575          31    .4283782   .1291327   .1488998   .7288508
-------------+-----------------------------------------------------------------
   peer_mean |     561      30.375    4.089111   .6393184          2       5.25
  zpeer_mean |     561      30.375   -.2180429   1.213933  -4.184832   1.986244
     quality |     575          31    .1612903   .3681188          0          1
    quality2 |     561      30.375    .2201646   .4147273          0          1

. collapse (mean) team_size group1 group2 group3, by(teamid);

. summ team_size;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   team_size |         71    2.225352    .7782248          1          3

. summ team_size if group1==1;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   team_size |          9    2.111111    1.054093          1          3

. summ team_size if group2==1;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   team_size |         31    2.193548    .6541842          1          3

. summ team_size if group3==1;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   team_size |         31    2.290323    .8243603          1          3

. log close;
      name:  <unnamed>
       log:  C:/GitHub/ideology_specification/code/Log Files/01_Table1.log
  log type:  text
 closed on:  11 Dec 2024, 10:39:42
--------------------------------------------------------------------------------------------------
