----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/GitHub/ideology_specification/code/Log Files/02_Main_Regs.log
  log type:  text
 opened on:  30 Aug 2025, 11:36:04

. clear matrix;

. clear mata;

. use "$workd/data/df.dta", clear;

. *DESCRIPTIVE TABLE AT THE MODEL LEVEL;
. tabulate topic_knowledge, sum(topic_brw);

TOPIC_KNOWL | Summary of topic_brw (standardized)
       EDGE |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |   .98677109   1.2708581         390
        Low |  -.73706552   .08243491         378
        Mid |  -.21903083   .16262347         485
------------+------------------------------------
      Total |   4.821e-09   .99999997       1,253

. tabulate statistics_skill, sum(stats_brw);

STATISTICS_ | Summary of stats_brw (standardized)
      SKILL |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |   1.8153467   .57465209         178
        Low |  -1.1522399   .59817124         282
        Mid |    .0022698   .40825837         793
------------+------------------------------------
      Total |  -2.474e-09           1       1,253

. tabulate model_score, sum(model_brw);

            |        Summary of model_brw
MODEL_SCORE |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |   .59514352   .03268489         294
        Low |   .31438404   .03962311         417
        Mid |   .46895185   .04982655         542
------------+------------------------------------
      Total |   .44712071   .11429906       1,253

. * TABLE S1 * 
> 
> summ ame neg10 pos10 negsig possig neg10s pos10s proindex  p12 p34 p56 group1 group2 group3 
> pbelief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean zpeer_mean quality quality2  ;
. summ ame neg10 pos10 negsig possig neg10s pos10s proindex  p12 p34 p56 group1 group2 group3 
> pbelief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean zpeer_mean quality quality2  if index==1 ;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |        134   -.0188496    .0971865    -.40887     .42193
       neg10 |        134    .1492537    .3576755          0          1
       pos10 |        134    .0522388    .2233432          0          1
      negsig |        134    .2761194    .4487542          0          1
      possig |        134    .2238806    .4184071          0          1
-------------+---------------------------------------------------------
      neg10s |        134     .119403    .3254789          0          1
      pos10s |        134    .0373134    .1902399          0          1
    proindex |        134    2.422886    .9508947          1   3.666667
         p12 |        134    .6318408    .3173319   .3333333          1
         p34 |        134    .2636816    .2488894          0   .6666667
-------------+---------------------------------------------------------
         p56 |        134    .1044776    .1552098          0   .3333333
      group1 |        134           1           0          1          1
      group2 |        134           0           0          0          0
      group3 |        134           0           0          0          0
     pbelief |        134    .7263682    .3266261          0          1
-------------+---------------------------------------------------------
      nmodel |        134    18.83582     6.23499          2         24
   team_size |        134     2.19403    .9846767          1          3
   stats_brw |        134   -.3747827     1.25259  -3.135104   1.657985
   topic_brw |        134   -.0740727    .5645725  -.7924486   .8616194
   model_brw |        134    .4336417    .1041899   .2631785   .5655868
-------------+---------------------------------------------------------
   peer_mean |        134    4.221775     .463432   3.142857        5.2
  zpeer_mean |        134    .0338582    .8799613  -2.014783   1.891304
     quality |        134    .1940299    .3969359          0          1
    quality2 |        134    .1641791     .371828          0          1

. summ ame neg10 pos10 negsig possig neg10s pos10s proindex  p12 p34 p56 group1 group2 group3 
> pbelief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean zpeer_mean quality quality2  if index==2;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |        544   -.0081035    .1192952  -1.353765   1.306339
       neg10 |        544    .1066176    .3089106          0          1
       pos10 |        544    .0882353    .2838978          0          1
      negsig |        544    .2849265    .4517949          0          1
      possig |        544    .1636029    .3702553          0          1
-------------+---------------------------------------------------------
      neg10s |        544    .0863971    .2812081          0          1
      pos10s |        544    .0496324    .2173841          0          1
    proindex |        544    3.992034      .50861          3          5
         p12 |        544           0           0          0          0
         p34 |        544    .7745098    .2141213         .5          1
-------------+---------------------------------------------------------
         p56 |        544    .2254902    .2141213          0         .5
      group1 |        544           0           0          0          0
      group2 |        544           1           0          1          1
      group3 |        544           0           0          0          0
     pbelief |        544      .46875     .398924          0          1
-------------+---------------------------------------------------------
      nmodel |        544    43.60294    37.49648          2        112
   team_size |        544    2.426471    .6551381          1          3
   stats_brw |        544   -.1757258    .8062337  -2.157197   2.003577
   topic_brw |        544   -.0944523    .7348587  -.9688011   2.794734
   model_brw |        544    .4716328    .1189273   .2382641   .6065403
-------------+---------------------------------------------------------
   peer_mean |        520    4.385812    .4162295        2.3   5.666667
  zpeer_mean |        520    .3453296    .7903335  -3.615195   2.777408
     quality |        544    .3860294    .4872855          0          1
    quality2 |        520    .3134615    .4643469          0          1

. summ ame neg10 pos10 negsig possig neg10s pos10s proindex  p12 p34 p56 group1 group2 group3 
> pbelief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean zpeer_mean quality quality2  if index==3;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |        575    .0137527    .2447405   -1.13019       2.47
       neg10 |        575    .0834783    .2768446          0          1
       pos10 |        575    .1234783    .3292718          0          1
      negsig |        575    .2034783    .4029357          0          1
      possig |        575    .1982609    .3990369          0          1
-------------+---------------------------------------------------------
      neg10s |        575    .0278261    .1646175          0          1
      pos10s |        575    .0591304     .236074          0          1
    proindex |        575    5.382609    .5716111          4          6
         p12 |        575    .0231884    .0848781          0   .3333333
         p34 |        575    .0365217    .1042063          0   .3333333
-------------+---------------------------------------------------------
         p56 |        575    .9402899    .1279318   .6666667          1
      group1 |        575           0           0          0          0
      group2 |        575           0           0          0          0
      group3 |        575           1           0          1          1
     pbelief |        575    .6533333    .3935406          0          1
-------------+---------------------------------------------------------
      nmodel |        575    39.66087    29.54949          1         96
   team_size |        575    2.086957    .8509599          1          3
   stats_brw |        575    .2535925    1.037427  -1.973267   2.681392
   topic_brw |        575    .1066222    1.255131   -.882254   3.983361
   model_brw |        575    .4270714    .1076379   .1488998   .7288508
-------------+---------------------------------------------------------
   peer_mean |        561    4.031108    .5735789          2       5.25
  zpeer_mean |        561   -.3281789    1.089107  -4.184832   1.986244
     quality |        575    .1008696    .3014181          0          1
    quality2 |        561    .1622103    .3689727          0          1

. *SUMMARY STATS WEIGHTED BY THE INVERSE OF THE NUMBER OF MODELS;
. summ ame neg10 pos10 negsig possig neg10s pos10s proindex  p12 p34 p56 group1 group2 group3 
> pbelief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean zpeer_mean quality quality2   [aw=1/nmodel];

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
         ame |   1,253          71   -.0085083   .2038202  -1.353765       2.47
       neg10 |   1,253          71    .1382308   .3452798          0          1
       pos10 |   1,253          71    .1143123   .3183172          0          1
      negsig |   1,253          71     .318356   .4660244          0          1
      possig |   1,253          71    .1916886   .3937865          0          1
-------------+-----------------------------------------------------------------
      neg10s |   1,253          71    .1026884   .3036726          0          1
      pos10s |   1,253          71     .069587   .2545512          0          1
    proindex |   1,253          71    4.300469    1.10691          1          6
         p12 |   1,253          71    .0938967   .2514385          0          1
         p34 |   1,253          71    .3967136   .3830483          0          1
-------------+-----------------------------------------------------------------
         p56 |   1,253          71    .5093897   .4005581          0          1
      group1 |   1,253          71    .1267606   .3328374          0          1
      group2 |   1,253          71    .4366197   .4961647          0          1
      group3 |   1,253          71    .4366197   .4961647          0          1
     pbelief |   1,253          71    .5492958    .387144          0          1
-------------+-----------------------------------------------------------------
      nmodel |   1,253          71    17.64789   19.48554          1        112
   team_size |   1,253          71    2.225352   .7730334          1          3
   stats_brw |   1,253          71    .0396539   1.039974  -3.135104   2.681392
   topic_brw |   1,253          71    .0888869   .9161063  -.9688011   3.983361
   model_brw |   1,253          71    .4356287   .1163981   .1488998   .7288508
-------------+-----------------------------------------------------------------
   peer_mean |   1,215      69.625    4.231731   .6211737          2   5.666667
  zpeer_mean |   1,215      69.625    .0527623    1.17948  -4.184832   2.777408
     quality |   1,253          71    .2042254   .4032954          0          1
    quality2 |   1,215      69.625    .3105326   .4629022          0          1

. summ ame neg10 pos10 negsig possig neg10s pos10s proindex  p12 p34 p56 group1 group2 group3 
> pbelief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean zpeer_mean quality quality2  if index==1  [a
> w=1/nmodel];

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
         ame |     134           9   -.0444999   .1254703    -.40887     .42193
       neg10 |     134           9    .2561728   .4381564          0          1
       pos10 |     134           9     .058642    .235835          0          1
      negsig |     134           9    .3487654   .4783679          0          1
      possig |     134           9    .1867284   .3911556          0          1
-------------+-----------------------------------------------------------------
      neg10s |     134           9    .2283951   .4213737          0          1
      pos10s |     134           9    .0432099   .2040922          0          1
    proindex |     134           9     2.37037   .9256753          1   3.666667
         p12 |     134           9    .6666667   .3154489   .3333333          1
         p34 |     134           9    .2592593   .2628741          0   .6666667
-------------+-----------------------------------------------------------------
         p56 |     134           9    .0740741   .1390999          0   .3333333
      group1 |     134           9           1          0          1          1
      group2 |     134           9           0          0          0          0
      group3 |     134           9           0          0          0          0
     pbelief |     134           9    .7037037   .3325124          0          1
-------------+-----------------------------------------------------------------
      nmodel |     134           9    14.88889   7.694627          2         24
   team_size |     134           9    2.111111   .9975371          1          3
   stats_brw |     134           9   -.5470347    1.39029  -3.135104   1.657985
   topic_brw |     134           9   -.1700019   .4903741  -.7924486   .8616194
   model_brw |     134           9    .4317806   .1071579   .2631785   .5655868
-------------+-----------------------------------------------------------------
   peer_mean |     134           9    4.249944   .5633377   3.142857        5.2
  zpeer_mean |     134           9    .0873444   1.069661  -2.014783   1.891304
     quality |     134           9    .2222222   .4172997          0          1
    quality2 |     134           9    .2592593   .4398725          0          1

. summ ame neg10 pos10 negsig possig neg10s pos10s proindex  p12 p34 p56 group1 group2 group3 
> pbelief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean zpeer_mean quality quality2  if index==2 [aw
> =1/nmodel];

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
         ame |     544          31   -.0124995   .2030918  -1.353765   1.306339
       neg10 |     544          31    .1548099   .3620563          0          1
       pos10 |     544          31     .127381   .3337061          0          1
      negsig |     544          31    .3712526   .4835845          0          1
      possig |     544          31    .2047395   .4038825          0          1
-------------+-----------------------------------------------------------------
      neg10s |     544          31    .1326805   .3395413          0          1
      pos10s |     544          31    .0784178   .2690754          0          1
    proindex |     544          31    3.962366   .5184506          3          5
         p12 |     544          31           0          0          0          0
         p34 |     544          31    .7580645   .2390893         .5          1
-------------+-----------------------------------------------------------------
         p56 |     544          31    .2419355   .2390893          0         .5
      group1 |     544          31           0          0          0          0
      group2 |     544          31           1          0          1          1
      group3 |     544          31           0          0          0          0
     pbelief |     544          31    .5107527    .397342          0          1
-------------+-----------------------------------------------------------------
      nmodel |     544          31    17.54839   21.40228          2        112
   team_size |     544          31    2.193548   .6441387          1          3
   stats_brw |     544          31    .0865177   .9487247  -2.157197   2.003577
   topic_brw |     544          31    .1541247     .92094  -.9688011   2.794734
   model_brw |     544          31    .4439963   .1046128   .2382641   .6065403
-------------+-----------------------------------------------------------------
   peer_mean |     520       30.25    4.369521   .5874801        2.3   5.666667
  zpeer_mean |     520       30.25    .3143978   1.115503  -3.615195   2.777408
     quality |     544          31    .2419355   .4286496          0          1
    quality2 |     520       30.25    .4165289   .4934581          0          1

. summ ame neg10 pos10 negsig possig neg10s pos10s proindex  p12 p34 p56 group1 group2 group3 
> pbelief  nmodel team_size
>         stats_brw topic_brw model_brw peer_mean zpeer_mean quality quality2  if index==3 [aw
> =1/nmodel];

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
         ame |     575          31    .0059321   .2210154   -1.13019       2.47
       neg10 |     575          31    .0874104   .2826814          0          1
       pos10 |     575          31    .1174059   .3221836          0          1
      negsig |     575          31    .2566308   .4371542          0          1
      possig |     575          31    .1800777   .3845867          0          1
-------------+-----------------------------------------------------------------
      neg10s |     575          31    .0362007   .1869519          0          1
      pos10s |     575          31     .068414   .2526748          0          1
    proindex |     575          31    5.198925   .5349724          4          6
         p12 |     575          31    .0215054   .0819613          0   .3333333
         p34 |     575          31    .0752688   .1394921          0   .3333333
-------------+-----------------------------------------------------------------
         p56 |     575          31    .9032258   .1514355   .6666667          1
      group1 |     575          31           0          0          0          0
      group2 |     575          31           0          0          0          0
      group3 |     575          31           1          0          1          1
     pbelief |     575          31    .5430108   .3812562          0          1
-------------+-----------------------------------------------------------------
      nmodel |     575          31    18.54839   19.80618          1         96
   team_size |     575          31    2.290323   .8116613          1          3
   stats_brw |     575          31     .163119   .9507433  -1.973267   2.681392
   topic_brw |     575          31    .0988103   .9912889   -.882254   3.983361
   model_brw |     575          31    .4283782   .1291327   .1488998   .7288508
-------------+-----------------------------------------------------------------
   peer_mean |     561      30.375    4.089111   .6393184          2       5.25
  zpeer_mean |     561      30.375   -.2180429   1.213933  -4.184832   1.986244
     quality |     575          31    .1612903   .3681188          0          1
    quality2 |     561      30.375    .2201646   .4147273          0          1

. preserve;

. collapse (mean) team_size group1 group2 group3, by(teamid);

. summ team_size;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   team_size |         71    2.225352    .7782248          1          3

. summ team_size if group1==1;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   team_size |          9    2.111111    1.054093          1          3

. summ team_size if group2==1;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   team_size |         31    2.193548    .6541842          1          3

. summ team_size if group3==1;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   team_size |         31    2.290323    .8243603          1          3

. restore;

. ***************************************************************************;
. ********************* Table 1 & Table S2 **********************************;
. ***************************************************************************;
. *ALL REGRESSIONS WILL BE WEIGHTED BY 1/NMODEL SO THEY ARE NUMERICALLY EQUIVALENT TO TEAM LEV
> EL REGRESSIONS;
. *WILL LEAVE OUT PMALE FROM ALL REGRESSIONS;
. *WILL INCLUDE TEAM_SIZE IN THE REFEREE SCORE, QUALITY REGRESSIONS;
. *Table 1, Model 1 & Table S2, Model 1;
. reg ame  proindex       stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  cluster(teami
> d);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0617
                                                Root MSE          =     .19878

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0108737   .0056998     1.91   0.061    -.0004943    .0222416
   stats_brw |   .0384442   .0176848     2.17   0.033     .0031731    .0737154
   topic_brw |  -.0410347   .0168102    -2.44   0.017    -.0745616   -.0075078
          t2 |   .0093166   .0148151     0.63   0.531    -.0202313    .0388644
          t3 |    .012971    .023955     0.54   0.590    -.0348057    .0607477
             |
     mdegree |
          1  |   .4545994   .0506109     8.98   0.000     .3536592    .5555396
          2  |   .2734257   .0208276    13.13   0.000     .2318864    .3149651
          3  |   .2742735   .0197721    13.87   0.000     .2348392    .3137077
          4  |   .2734748   .0198543    13.77   0.000     .2338766     .313073
          5  |   .3211411   .0343558     9.35   0.000     .2526206    .3896615
          6  |   .2508457   .0218756    11.47   0.000     .2072162    .2944751
         20  |   .2775809   .0320121     8.67   0.000     .2137348    .3414271
         33  |   .2778045   .0274814    10.11   0.000     .2229947    .3326143
         34  |   .2877794   .0198662    14.49   0.000     .2481574    .3274014
         35  |   .1854928    .074674     2.48   0.015     .0365602    .3344255
         36  |   .2727957   .0187552    14.55   0.000     .2353896    .3102018
         40  |   .2540658   .0402514     6.31   0.000     .1737869    .3343448
             |
       _cons |  -.3348635    .027718   -12.08   0.000    -.3901454   -.2795817
------------------------------------------------------------------------------

. *Table 1, Model 2 & Table S2, Model 2;
. reg ame  p12 p56        stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  cluster(teami
> d);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0648
                                                Root MSE          =     .19853

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0503799   .0252584    -1.99   0.050    -.1007562   -3.69e-06
         p56 |   .0234775   .0193443     1.21   0.229    -.0151034    .0620584
   stats_brw |    .037143   .0166456     2.23   0.029     .0039445    .0703415
   topic_brw |  -.0418866   .0165861    -2.53   0.014    -.0749666   -.0088066
          t2 |   .0011216   .0162283     0.07   0.945    -.0312447    .0334879
          t3 |   .0087989   .0224903     0.39   0.697    -.0360565    .0536543
             |
     mdegree |
          1  |   .4764457    .058257     8.18   0.000     .3602557    .5926357
          2  |   .2592396   .0291878     8.88   0.000     .2010265    .3174528
          3  |   .2730058   .0203962    13.39   0.000     .2323269    .3136846
          4  |   .2712758    .019403    13.98   0.000     .2325777    .3099739
          5  |   .3222416   .0299225    10.77   0.000      .262563    .3819201
          6  |   .2516072   .0224161    11.22   0.000     .2068996    .2963148
         20  |   .2742799   .0338085     8.11   0.000     .2068511    .3417088
         33  |   .2751979   .0261161    10.54   0.000      .223111    .3272847
         34  |   .2847723   .0215027    13.24   0.000     .2418866     .327658
         35  |   .1800135   .0745509     2.41   0.018     .0313264    .3287007
         36  |   .2812386   .0133591    21.05   0.000     .2545947    .3078825
         40  |   .2544392   .0381109     6.68   0.000     .1784294    .3304489
             |
       _cons |   -.289131   .0262677   -11.01   0.000    -.3415202   -.2367418
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0738574   .0242554     3.04   0.003     .0254815    .1222334
------------------------------------------------------------------------------

. *Table S2, Model 3;
. reg ame  group3                 stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  clust
> er(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0661
                                                Root MSE          =     .19832

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |   .0400274   .0158054     2.53   0.014     .0085044    .0715503
   stats_brw |   .0366518   .0162719     2.25   0.027     .0041984    .0691051
   topic_brw |  -.0397766   .0154963    -2.57   0.012    -.0706829   -.0088703
          t2 |   .0240041   .0153349     1.57   0.122    -.0065805    .0545887
          t3 |   .0152444   .0221752     0.69   0.494    -.0289826    .0594714
             |
     mdegree |
          1  |     .44895   .0562755     7.98   0.000     .3367121    .5611879
          2  |   .2841817   .0217026    13.09   0.000     .2408972    .3274663
          3  |   .2718073    .022274    12.20   0.000     .2273833    .3162314
          4  |   .2728777   .0193381    14.11   0.000     .2343091    .3114464
          5  |   .3293892   .0305213    10.79   0.000     .2685162    .3902621
          6  |   .2677352   .0246948    10.84   0.000     .2184829    .3169874
         20  |   .2726566   .0376655     7.24   0.000      .197535    .3477781
         33  |   .2852015   .0236278    12.07   0.000     .2380774    .3323256
         34  |   .2822144   .0168685    16.73   0.000     .2485712    .3158576
         35  |   .1885997    .062192     3.03   0.003     .0645617    .3126376
         36  |   .2887058    .015035    19.20   0.000     .2587195    .3186922
         40  |   .2671305    .040801     6.55   0.000     .1857555    .3485056
             |
       _cons |  -.3123935   .0230896   -13.53   0.000    -.3584442   -.2663428
------------------------------------------------------------------------------

. *Table 1, Model 3 & Table S2, Model 4;
. reg ame  group1 group3  stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  cluster(teami
> d);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0710
                                                Root MSE          =     .19788

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0572476   .0306365    -1.87   0.066    -.1183502    .0038549
      group3 |   .0272754   .0147459     1.85   0.069    -.0021343    .0566851
   stats_brw |   .0341011   .0156414     2.18   0.033     .0029053     .065297
   topic_brw |  -.0406176   .0155892    -2.61   0.011    -.0717092    -.009526
          t2 |   .0063886   .0160686     0.40   0.692    -.0256592    .0384365
          t3 |   .0079756   .0229581     0.35   0.729    -.0378128     .053764
             |
     mdegree |
          1  |   .4781822   .0593708     8.05   0.000     .3597709    .5965935
          2  |   .2632302   .0264194     9.96   0.000     .2105383     .315922
          3  |   .2761151   .0200568    13.77   0.000     .2361131    .3161171
          4  |   .2729049   .0187597    14.55   0.000     .2354899    .3103199
          5  |   .3308497   .0292276    11.32   0.000     .2725571    .3891424
          6  |    .260214    .024832    10.48   0.000     .2106882    .3097399
         20  |   .2746755   .0345734     7.94   0.000      .205721      .34363
         33  |   .2877058    .026143    11.01   0.000     .2355652    .3398464
         34  |   .2763302   .0143112    19.31   0.000     .2477874     .304873
         35  |   .1839868   .0675415     2.72   0.008     .0492795    .3186942
         36  |   .3356711   .0298616    11.24   0.000      .276114    .3952282
         40  |   .2824761   .0246236    11.47   0.000      .233366    .3315862
             |
       _cons |  -.2928377   .0268678   -10.90   0.000    -.3464238   -.2392515
------------------------------------------------------------------------------

. * as Stata is our main software for analysis, we save these results as the file stata_adj_me
> ans.csv for Fig1;
. margins, dydx(group1 group3) level(90);

Average marginal effects                                 Number of obs = 1,253
Model VCE: Robust

Expression: Linear prediction, predict()
dy/dx wrt:  group1 group3

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      t    P>|t|     [90% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0572476   .0306365    -1.87   0.066    -.1083161   -.0061792
      group3 |   .0272754   .0147459     1.85   0.069     .0026953    .0518555
------------------------------------------------------------------------------

. margins, at(group1 == 0 group3 == 0) level(90);

Predictive margins                                       Number of obs = 1,253
Model VCE: Robust

Expression: Linear prediction, predict()
At: group1 = 0
    group3 = 0

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      t    P>|t|     [90% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.0131605   .0101858    -1.29   0.201    -.0301393    .0038183
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |    .084523    .031027     2.72   0.008     .0226417    .1464043
------------------------------------------------------------------------------

. *ADDING BELIEF;
. *Not shown in Table S2;
. reg ame  proindex pbelief  stats_brw topic_brw t2 t3 i.mdegree    [aw=1/nmodel] ,  cluster(t
> eamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0624
                                                Root MSE          =     .19879

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0113848   .0055162     2.06   0.043     .0003831    .0223865
     pbelief |  -.0154633   .0153958    -1.00   0.319    -.0461692    .0152425
   stats_brw |   .0381325     .01731     2.20   0.031     .0036089    .0726561
   topic_brw |  -.0413342   .0166233    -2.49   0.015    -.0744883   -.0081801
          t2 |    .011424   .0136359     0.84   0.405    -.0157719    .0386198
          t3 |    .014834   .0240947     0.62   0.540    -.0332213    .0628893
             |
     mdegree |
          1  |   .4728694   .0609936     7.75   0.000     .3512215    .5945172
          2  |   .2765242    .019777    13.98   0.000     .2370801    .3159683
          3  |   .2843993   .0233639    12.17   0.000     .2378016    .3309971
          4  |   .2812742   .0215197    13.07   0.000     .2383545    .3241938
          5  |   .3389768   .0342148     9.91   0.000     .2707376     .407216
          6  |   .2570401   .0228378    11.26   0.000     .2114916    .3025887
         20  |   .2857246   .0349241     8.18   0.000     .2160706    .3553785
         33  |   .2875518    .025811    11.14   0.000     .2360735    .3390301
         34  |   .3004199   .0242248    12.40   0.000     .2521051    .3487347
         35  |   .1942942   .0758132     2.56   0.013     .0430895    .3454989
         36  |   .2846501   .0148766    19.13   0.000     .2549796    .3143207
         40  |    .262948   .0412183     6.38   0.000     .1807407    .3451553
             |
       _cons |  -.3398345   .0270176   -12.58   0.000    -.3937195   -.2859496
------------------------------------------------------------------------------

. *Table S2, Model 5;
. reg ame  p12 p56  pbelief  stats_brw topic_brw t2 t3 i.mdegree    [aw=1/nmodel] ,  cluster(t
> eamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(15, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0652
                                                Root MSE          =     .19857

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0479692   .0245364    -1.96   0.055    -.0969054     .000967
         p56 |   .0248227   .0193319     1.28   0.203    -.0137335    .0633789
     pbelief |  -.0121928   .0156684    -0.78   0.439    -.0434424    .0190569
   stats_brw |   .0369708   .0164024     2.25   0.027     .0042573    .0696844
   topic_brw |  -.0420345   .0163983    -2.56   0.013    -.0747399   -.0093292
          t2 |   .0035046   .0149906     0.23   0.816    -.0263931    .0334023
          t3 |    .010861   .0230491     0.47   0.639     -.035109    .0568309
             |
     mdegree |
          1  |   .4890379   .0674258     7.25   0.000     .3545614    .6235144
          2  |   .2624987   .0286902     9.15   0.000      .205278    .3197194
          3  |   .2807249   .0248409    11.30   0.000     .2311813    .3302685
          4  |   .2774102   .0220001    12.61   0.000     .2335324     .321288
          5  |   .3359848   .0321004    10.47   0.000     .2719625    .4000072
          6  |   .2568645   .0244863    10.49   0.000     .2080281    .3057009
         20  |    .280535   .0373247     7.52   0.000     .2060931    .3549768
         33  |   .2827401   .0254664    11.10   0.000     .2319489    .3335312
         34  |   .2944574   .0265708    11.08   0.000     .2414636    .3474512
         35  |   .1869026   .0755531     2.47   0.016     .0362167    .3375886
         36  |   .2896507   .0125191    23.14   0.000     .2646821    .3146193
         40  |     .26119   .0400122     6.53   0.000     .1813881    .3409919
             |
       _cons |  -.2925625   .0268072   -10.91   0.000    -.3460277   -.2390973
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0727919   .0239089     3.04   0.003      .025107    .1204768
------------------------------------------------------------------------------

. *Not shown in Table S2;
. reg ame  group3  pbelief  stats_brw topic_brw t2 t3 i.mdegree    [aw=1/nmodel] ,  cluster(te
> amid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0668
                                                Root MSE          =     .19832

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |   .0410243   .0160921     2.55   0.013     .0089296     .073119
     pbelief |  -.0163775   .0158075    -1.04   0.304    -.0479045    .0151496
   stats_brw |   .0363352   .0158764     2.29   0.025     .0046707    .0679998
   topic_brw |  -.0401176   .0152811    -2.63   0.011    -.0705947   -.0096405
          t2 |   .0266627   .0143464     1.86   0.067    -.0019504    .0552757
          t3 |   .0173014   .0222383     0.78   0.439    -.0270515    .0616542
             |
     mdegree |
          1  |   .4672403   .0669188     6.98   0.000     .3337749    .6007057
          2  |   .2868986   .0212988    13.47   0.000     .2444195    .3293777
          3  |   .2820393   .0267071    10.56   0.000     .2287738    .3353049
          4  |   .2806987   .0220032    12.76   0.000     .2368147    .3245827
          5  |   .3476591   .0345408    10.07   0.000     .2787697    .4165485
          6  |   .2742213   .0264415    10.37   0.000     .2214853    .3269572
         20  |   .2807247   .0409274     6.86   0.000     .1990976    .3623517
         33  |   .2951953   .0250386    11.79   0.000     .2452574    .3451332
         34  |   .2950355   .0238487    12.37   0.000     .2474708    .3426002
         35  |   .1975086    .063808     3.10   0.003     .0702477    .3247696
         36  |   .3009891    .016844    17.87   0.000     .2673947    .3345835
         40  |   .2761751   .0434972     6.35   0.000     .1894227    .3629276
             |
       _cons |  -.3154865   .0235283   -13.41   0.000    -.3624122   -.2685609
------------------------------------------------------------------------------

. *Table S2, Model 6;
. reg ame  group1 group3  pbelief  stats_brw topic_brw t2 t3 i.mdegree    [aw=1/nmodel] ,  clu
> ster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(15, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0713
                                                Root MSE          =     .19792

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0552946    .031184    -1.77   0.081    -.1174892    .0068999
      group3 |   .0283834   .0151864     1.87   0.066    -.0019049    .0586718
     pbelief |  -.0110571   .0163631    -0.68   0.501    -.0436923    .0215781
   stats_brw |   .0339745   .0154449     2.20   0.031     .0031705    .0647784
   topic_brw |  -.0408192   .0154994    -2.63   0.010    -.0717317   -.0099066
          t2 |   .0087845   .0155369     0.57   0.574    -.0222029    .0397719
          t3 |   .0096123   .0237473     0.40   0.687    -.0377503    .0569749
             |
     mdegree |
          1  |   .4895336    .068765     7.12   0.000     .3523862    .6266809
          2  |   .2657792   .0270472     9.83   0.000     .2118352    .3197232
          3  |   .2828762   .0259431    10.90   0.000     .2311343    .3346181
          4  |   .2781842   .0223365    12.45   0.000     .2336355    .3227329
          5  |   .3431347   .0345109     9.94   0.000      .274305    .4119645
          6  |   .2648497   .0280925     9.43   0.000      .208821    .3208783
         20  |   .2800538   .0385478     7.27   0.000     .2031727    .3569348
         33  |   .2943676     .02654    11.09   0.000     .2414352       .3473
         34  |    .285187   .0220677    12.92   0.000     .2411744    .3291996
         35  |    .190159    .068551     2.77   0.007     .0534384    .3268796
         36  |   .3423618   .0306289    11.18   0.000     .2812745    .4034492
         40  |    .288059   .0272466    10.57   0.000     .2337173    .3424007
             |
       _cons |   -.295593   .0282945   -10.45   0.000    -.3520247   -.2391614
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0836781   .0313824     2.67   0.010     .0210879    .1462683
------------------------------------------------------------------------------

. ***************** Lower portion of Table S2 *******************************;
. ***************************************************************************;
. *WEIGHTED REGRESSIONS USING PSCORE/NMODEL;
. *WEIGHTING BY QUALITY HELPS ADDRESS PUBLICATION BIAS PROBLEM;
. reg ame  proindex    stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel] ,  cluster(tea
> mid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0631
                                                Root MSE          =     .20018

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0113823    .005618     2.03   0.047     .0001776    .0225871
   stats_brw |   .0391653   .0181567     2.16   0.034     .0029529    .0753776
   topic_brw |  -.0414328    .017194    -2.41   0.019    -.0757251   -.0071404
          t2 |   .0087255   .0146966     0.59   0.555    -.0205859    .0380369
          t3 |   .0119852   .0246031     0.49   0.628    -.0370841    .0610544
             |
     mdegree |
          1  |   .4575084   .0520426     8.79   0.000     .3537127     .561304
          2  |    .273634   .0211764    12.92   0.000      .231399    .3158689
          3  |   .2734949   .0210531    12.99   0.000     .2315059    .3154839
          4  |   .2703089   .0198575    13.61   0.000     .2307043    .3099135
          5  |   .3236678    .035149     9.21   0.000     .2535654    .3937703
          6  |   .2509542    .023532    10.66   0.000     .2040211    .2978872
         20  |   .2786136   .0329363     8.46   0.000     .2129241     .344303
         33  |   .2737398   .0245488    11.15   0.000     .2247788    .3227008
         34  |   .2888588   .0206671    13.98   0.000     .2476396     .330078
         35  |   .1780349   .0740114     2.41   0.019     .0304238     .325646
         36  |   .2734497   .0179724    15.21   0.000     .2376048    .3092946
         40  |   .2599358   .0397411     6.54   0.000     .1806747     .339197
             |
       _cons |  -.3367484    .026792   -12.57   0.000    -.3901834   -.2833134
------------------------------------------------------------------------------

. reg ame  p12 p56    stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel] ,  cluster(team
> id);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0666
                                                Root MSE          =     .19989

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0516617   .0261416    -1.98   0.052    -.1037995    .0004762
         p56 |   .0259294   .0193446     1.34   0.184    -.0126521     .064511
   stats_brw |     .03755    .017038     2.20   0.031     .0035689    .0715311
   topic_brw |  -.0419997   .0167832    -2.50   0.015    -.0754728   -.0085266
          t2 |   .0001315   .0161841     0.01   0.994    -.0321467    .0324098
          t3 |   .0080016   .0233349     0.34   0.733    -.0385384    .0545415
             |
     mdegree |
          1  |   .4805021   .0595689     8.07   0.000     .3616956    .5993086
          2  |   .2608113   .0289467     9.01   0.000     .2030788    .3185437
          3  |   .2730819    .021381    12.77   0.000     .2304389    .3157249
          4  |   .2689926   .0191167    14.07   0.000     .2308654    .3071197
          5  |   .3261398   .0300943    10.84   0.000     .2661185    .3861611
          6  |   .2533505   .0233359    10.86   0.000     .2068085    .2998925
         20  |   .2760177   .0346695     7.96   0.000     .2068716    .3451637
         33  |   .2721161   .0232172    11.72   0.000     .2258109    .3184214
         34  |   .2861176    .022347    12.80   0.000     .2415479    .3306874
         35  |   .1731348   .0737648     2.35   0.022     .0260155    .3202541
         36  |   .2829707    .013312    21.26   0.000     .2564207    .3095207
         40  |    .261034   .0383023     6.82   0.000     .1846426    .3374255
             |
       _cons |   -.290692   .0263835   -11.02   0.000    -.3433123   -.2380718
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0775911    .026312     2.95   0.004     .0251135    .1300687
------------------------------------------------------------------------------

. reg ame  group3    stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel] ,  cluster(teami
> d);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0681
                                                Root MSE          =     .19965

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |   .0425567   .0161913     2.63   0.011     .0102641    .0748492
   stats_brw |   .0371753   .0166199     2.24   0.028     .0040279    .0703227
   topic_brw |  -.0400893   .0157721    -2.54   0.013    -.0715457   -.0086329
          t2 |   .0237072   .0155839     1.52   0.133    -.0073739    .0547883
          t3 |   .0144569   .0227108     0.64   0.526    -.0308385    .0597522
             |
     mdegree |
          1  |   .4520275   .0571492     7.91   0.000      .338047    .5660079
          2  |   .2856604   .0218783    13.06   0.000     .2420254    .3292953
          3  |   .2720781    .023606    11.53   0.000     .2249974    .3191588
          4  |   .2700212    .018722    14.42   0.000     .2326813    .3073611
          5  |   .3329414   .0311552    10.69   0.000     .2708042    .3950785
          6  |    .270186   .0257111    10.51   0.000     .2189068    .3214652
         20  |   .2737801   .0387783     7.06   0.000     .1964393    .3511209
         33  |   .2831327   .0212578    13.32   0.000     .2407354    .3255299
         34  |   .2827972   .0173193    16.33   0.000      .248255    .3173395
         35  |   .1830432   .0610361     3.00   0.004     .0613105    .3047758
         36  |   .2908544    .014531    20.02   0.000     .2618732    .3198357
         40  |   .2743366   .0407135     6.74   0.000     .1931361     .355537
             |
       _cons |  -.3140019   .0234006   -13.42   0.000     -.360673   -.2673308
------------------------------------------------------------------------------

. reg ame  group1 group3    stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel] ,  cluste
> r(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0739
                                                Root MSE          =     .19911

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0612237   .0335927    -1.82   0.073    -.1282222    .0057748
      group3 |   .0289914   .0145722     1.99   0.051     -.000072    .0580549
   stats_brw |   .0339442   .0157978     2.15   0.035     .0024366    .0654519
   topic_brw |  -.0407224   .0158489    -2.57   0.012    -.0723322   -.0091127
          t2 |   .0048151   .0162263     0.30   0.768    -.0275472    .0371774
          t3 |   .0073001   .0234384     0.31   0.756    -.0394462    .0540465
             |
     mdegree |
          1  |   .4826737   .0606109     7.96   0.000     .3617891    .6035582
          2  |   .2641638   .0268537     9.84   0.000     .2106058    .3177219
          3  |   .2773822   .0205898    13.47   0.000     .2363171    .3184474
          4  |   .2706116   .0180237    15.01   0.000     .2346644    .3065587
          5  |    .335401   .0292041    11.48   0.000     .2771553    .3936468
          6  |   .2626786   .0257244    10.21   0.000     .2113729    .3139843
         20  |   .2766724   .0349883     7.91   0.000     .2068904    .3464545
         33  |   .2860567   .0247775    11.55   0.000     .2366395    .3354739
         34  |   .2763643     .01433    19.29   0.000     .2477841    .3049445
         35  |   .1778665   .0667929     2.66   0.010     .0446524    .3110807
         36  |    .341529    .032623    10.47   0.000     .2764644    .4065935
         40  |   .2877489    .023661    12.16   0.000     .2405585    .3349392
             |
       _cons |  -.2939027   .0274166   -10.72   0.000    -.3485835    -.239222
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0902151   .0340102     2.65   0.010      .022384    .1580462
------------------------------------------------------------------------------

. *ADDING BELIEF;
. reg ame  proindex  pbelief  stats_brw topic_brw t2 t3 i.mdegree    [aw=pscore/nmodel] ,  clu
> ster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0639
                                                Root MSE          =     .20017

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0120401   .0054301     2.22   0.030     .0012101    .0228701
     pbelief |  -.0173951   .0153183    -1.14   0.260    -.0479464    .0131563
   stats_brw |    .038885   .0177739     2.19   0.032      .003436     .074334
   topic_brw |  -.0418756   .0169819    -2.47   0.016     -.075745   -.0080062
          t2 |   .0109059   .0134332     0.81   0.420    -.0158857    .0376976
          t3 |   .0141268   .0246477     0.57   0.568    -.0350315    .0632852
             |
     mdegree |
          1  |   .4785775   .0625944     7.65   0.000     .3537368    .6034181
          2  |   .2773188    .020071    13.82   0.000     .2372884    .3173491
          3  |   .2853061   .0245312    11.63   0.000     .2363801    .3342321
          4  |   .2796856   .0217112    12.88   0.000      .236384    .3229873
          5  |   .3439632   .0349959     9.83   0.000     .2741661    .4137603
          6  |   .2579976   .0243128    10.61   0.000     .2095072    .3064881
         20  |   .2879936   .0357669     8.05   0.000     .2166587    .3593284
         33  |   .2844977   .0227971    12.48   0.000     .2390303    .3299651
         34  |   .3031724   .0252029    12.03   0.000     .2529069    .3534379
         35  |   .1878002   .0752185     2.50   0.015     .0377817    .3378187
         36  |   .2869438    .014121    20.32   0.000     .2587803    .3151072
         40  |   .2703581   .0412354     6.56   0.000     .1881167    .3525995
             |
       _cons |  -.3428605     .02611   -13.13   0.000    -.3949351   -.2907858
------------------------------------------------------------------------------

. reg ame  p12 p56  pbelief  stats_brw topic_brw t2 t3 i.mdegree    [aw=pscore/nmodel] ,  clus
> ter(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(15, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0672
                                                Root MSE          =     .19991

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0491459   .0254439    -1.93   0.057    -.0998922    .0016003
         p56 |   .0275696   .0194101     1.42   0.160    -.0111426    .0662817
     pbelief |  -.0143784   .0156759    -0.92   0.362    -.0456431    .0168863
   stats_brw |   .0374182   .0167943     2.23   0.029      .003923    .0709134
   topic_brw |  -.0422827   .0165781    -2.55   0.013    -.0753466   -.0092188
          t2 |   .0027065   .0149002     0.18   0.856    -.0270111     .032424
          t3 |   .0104075   .0237445     0.44   0.663    -.0369494    .0577645
             |
     mdegree |
          1  |    .495847   .0690125     7.18   0.000     .3582058    .6334881
          2  |   .2645851   .0284117     9.31   0.000     .2079196    .3212505
          3  |   .2824817   .0259012    10.91   0.000     .2308234    .3341399
          4  |   .2766577   .0220411    12.55   0.000     .2326981    .3206174
          5  |   .3424133   .0324433    10.55   0.000     .2777071    .4071194
          6  |   .2595566   .0253658    10.23   0.000     .2089662     .310147
         20  |   .2835078   .0381262     7.44   0.000     .2074676    .3595481
         33  |   .2807699   .0228377    12.29   0.000     .2352216    .3263183
         34  |   .2975513    .027571    10.79   0.000     .2425627    .3525399
         35  |   .1810624   .0748965     2.42   0.018     .0316861    .3304387
         36  |   .2930011   .0127768    22.93   0.000     .2675185    .3184837
         40  |   .2693542   .0408887     6.59   0.000     .1878042    .3509042
             |
       _cons |  -.2947434   .0269483   -10.94   0.000      -.34849   -.2409968
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0767155   .0258925     2.96   0.004     .0250744    .1283565
------------------------------------------------------------------------------

. reg ame  group3  pbelief  stats_brw topic_brw t2 t3 i.mdegree    [aw=pscore/nmodel] ,  clust
> er(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0690
                                                Root MSE          =     .19964

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |   .0436266   .0165119     2.64   0.010     .0106947    .0765584
     pbelief |  -.0178794   .0158854    -1.13   0.264    -.0495619     .013803
   stats_brw |   .0369251   .0162347     2.27   0.026      .004546    .0693042
   topic_brw |  -.0405919   .0155495    -2.61   0.011    -.0716045   -.0095793
          t2 |    .026386   .0145586     1.81   0.074    -.0026502    .0554221
          t3 |   .0167254   .0226732     0.74   0.463    -.0284948    .0619456
             |
     mdegree |
          1  |    .472197   .0677708     6.97   0.000     .3370323    .6073617
          2  |   .2885144   .0214284    13.46   0.000     .2457768     .331252
          3  |   .2835335   .0279763    10.13   0.000     .2277366    .3393305
          4  |   .2790169   .0218515    12.77   0.000     .2354355    .3225983
          5  |   .3528133    .035248    10.01   0.000     .2825133    .4231133
          6  |   .2771664   .0274406    10.10   0.000     .2224378     .331895
         20  |   .2826643    .041993     6.73   0.000     .1989119    .3664167
         33  |   .2936537   .0230653    12.73   0.000     .2476514     .339656
         34  |    .296744   .0243395    12.19   0.000     .2482004    .3452876
         35  |   .1924869   .0627671     3.07   0.003     .0673019     .317672
         36  |   .3041954   .0169674    17.93   0.000     .2703551    .3380358
         40  |   .2844301   .0439284     6.47   0.000     .1968177    .3720426
             |
       _cons |  -.3173531   .0238121   -13.33   0.000    -.3648448   -.2698613
------------------------------------------------------------------------------

. reg ame  group1 group3  pbelief  stats_brw topic_brw t2 t3 i.mdegree    [aw=pscore/nmodel] ,
>   cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(15, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0743
                                                Root MSE          =     .19914

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0592232   .0341456    -1.73   0.087    -.1273244     .008878
      group3 |   .0301744   .0150478     2.01   0.049     .0001626    .0601862
     pbelief |  -.0123609   .0164856    -0.75   0.456    -.0452404    .0205186
   stats_brw |   .0338768   .0156225     2.17   0.034     .0027187     .065035
   topic_brw |  -.0410492   .0157788    -2.60   0.011     -.072519   -.0095794
          t2 |   .0072843   .0156463     0.47   0.643    -.0239213    .0384899
          t3 |   .0091023   .0241503     0.38   0.707    -.0390639    .0572685
             |
     mdegree |
          1  |   .4956165   .0701136     7.07   0.000     .3557793    .6354537
          2  |   .2668394   .0274094     9.74   0.000     .2121731    .3215056
          3  |   .2851286   .0268084    10.64   0.000     .2316609    .3385963
          4  |   .2768115   .0221652    12.49   0.000     .2326044    .3210185
          5  |   .3490591   .0347041    10.06   0.000     .2798439    .4182743
          6  |   .2677498   .0290275     9.22   0.000     .2098563    .3256433
         20  |     .28272   .0389713     7.25   0.000     .2049941    .3604459
         33  |   .2932348   .0251859    11.64   0.000     .2430032    .3434665
         34  |   .2862166   .0221434    12.93   0.000     .2420529    .3303803
         35  |   .1845646   .0678749     2.72   0.008     .0491925    .3199367
         36  |   .3490965   .0337334    10.35   0.000     .2818173    .4163756
         40  |   .2942888   .0267985    10.98   0.000     .2408409    .3477368
             |
       _cons |  -.2968763   .0287884   -10.31   0.000    -.3542929   -.2394597
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0893976   .0343886     2.60   0.011     .0208117    .1579834
------------------------------------------------------------------------------

. *GETTING PERCENTILE DIFFERENCE BETWEEN PRO AND ANTI IMMIGRATION TEAMS;
. reg ame  group1 group3    stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  cluster(tea
> mid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0710
                                                Root MSE          =     .19788

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0572476   .0306365    -1.87   0.066    -.1183502    .0038549
      group3 |   .0272754   .0147459     1.85   0.069    -.0021343    .0566851
   stats_brw |   .0341011   .0156414     2.18   0.033     .0029053     .065297
   topic_brw |  -.0406176   .0155892    -2.61   0.011    -.0717092    -.009526
          t2 |   .0063886   .0160686     0.40   0.692    -.0256592    .0384365
          t3 |   .0079756   .0229581     0.35   0.729    -.0378128     .053764
             |
     mdegree |
          1  |   .4781822   .0593708     8.05   0.000     .3597709    .5965935
          2  |   .2632302   .0264194     9.96   0.000     .2105383     .315922
          3  |   .2761151   .0200568    13.77   0.000     .2361131    .3161171
          4  |   .2729049   .0187597    14.55   0.000     .2354899    .3103199
          5  |   .3308497   .0292276    11.32   0.000     .2725571    .3891424
          6  |    .260214    .024832    10.48   0.000     .2106882    .3097399
         20  |   .2746755   .0345734     7.94   0.000      .205721      .34363
         33  |   .2877058    .026143    11.01   0.000     .2355652    .3398464
         34  |   .2763302   .0143112    19.31   0.000     .2477874     .304873
         35  |   .1839868   .0675415     2.72   0.008     .0492795    .3186942
         36  |   .3356711   .0298616    11.24   0.000      .276114    .3952282
         40  |   .2824761   .0246236    11.47   0.000      .233366    .3315862
             |
       _cons |  -.2928377   .0268678   -10.90   0.000    -.3464238   -.2392515
------------------------------------------------------------------------------

. predict rame, resid;
(1 missing value generated)

. xtile prame=rame [aw=1/nmodel], n(100);

. tabulate mdegree, gen(dum);

    mdegree |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         20        1.60        1.60
          1 |         12        0.96        2.55
          2 |         24        1.92        4.47
          3 |        537       42.86       47.33
          4 |        248       19.79       67.12
          5 |         52        4.15       71.27
          6 |         16        1.28       72.55
         20 |         79        6.30       78.85
         33 |        121        9.66       88.51
         34 |         60        4.79       93.30
         35 |         22        1.76       95.05
         36 |         24        1.92       96.97
         40 |         38        3.03      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. center stats_brw topic_brw t2 t3 dum* [aw=1/nmodel];
(generated variables: c_stats_brw c_topic_brw c_t2 c_t3 c_dum1 c_dum2 c_dum3 c_dum4 c_dum5 c_d
> um6 c_dum7 c_dum8 c_dum9 c_dum10 c_dum11 c_dum12 c_dum13)

. reg ame group1 group3 c_* [aw=1/nmodel], cluster(teamid);
(sum of wgt is 71)
note: c_dum3 omitted because of collinearity.

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0710
                                                Root MSE          =     .19788

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0572476   .0306365    -1.87   0.066    -.1183502    .0038549
      group3 |   .0272754   .0147459     1.85   0.069    -.0021343    .0566851
 c_stats_brw |   .0341011   .0156414     2.18   0.033     .0029053     .065297
 c_topic_brw |  -.0406176   .0155892    -2.61   0.011    -.0717092    -.009526
        c_t2 |   .0063886   .0160686     0.40   0.692    -.0256592    .0384365
        c_t3 |   .0079756   .0229581     0.35   0.729    -.0378128     .053764
      c_dum1 |  -.2632302   .0264194    -9.96   0.000     -.315922   -.2105383
      c_dum2 |   .2149521   .0617087     3.48   0.001     .0918779    .3380262
      c_dum3 |          0  (omitted)
      c_dum4 |    .012885   .0224519     0.57   0.568    -.0318939    .0576639
      c_dum5 |   .0096747   .0213332     0.45   0.652     -.032873    .0522224
      c_dum6 |   .0676196   .0309487     2.18   0.032     .0058944    .1293448
      c_dum7 |  -.0030161   .0168554    -0.18   0.859    -.0366332     .030601
      c_dum8 |   .0114454   .0311726     0.37   0.715    -.0507265    .0736172
      c_dum9 |   .0244756    .032433     0.75   0.453    -.0402099    .0891612
     c_dum10 |      .0131   .0264967     0.49   0.623     -.039746    .0659461
     c_dum11 |  -.0792433   .0709248    -1.12   0.268    -.2206983    .0622117
     c_dum12 |    .072441   .0458547     1.58   0.119    -.0190133    .1638952
     c_dum13 |   .0192459   .0359402     0.54   0.594    -.0524344    .0909263
       _cons |  -.0131605   .0101858    -1.29   0.201    -.0334754    .0071544
------------------------------------------------------------------------------

. reg ame group1 group2 group3 c_* [aw=1/nmodel], cluster(teamid) nocons;
(sum of wgt is 71)
note: c_dum12 omitted because of collinearity.

Linear regression                               Number of obs     =      1,253
                                                F(15, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0726
                                                Root MSE          =     .19788

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0704081   .0285362    -2.47   0.016    -.1273219   -.0134944
      group2 |  -.0131605   .0101858    -1.29   0.201    -.0334754    .0071544
      group3 |   .0141149   .0105315     1.34   0.184    -.0068895    .0351192
 c_stats_brw |   .0341011   .0156414     2.18   0.033     .0029053     .065297
 c_topic_brw |  -.0406176   .0155892    -2.61   0.011    -.0717092    -.009526
        c_t2 |   .0063886   .0160686     0.40   0.692    -.0256592    .0384365
        c_t3 |   .0079756   .0229581     0.35   0.729    -.0378128     .053764
      c_dum1 |  -.3356711   .0298616   -11.24   0.000    -.3952282    -.276114
      c_dum2 |   .1425111   .0597364     2.39   0.020     .0233707    .2616516
      c_dum3 |   -.072441   .0458547    -1.58   0.119    -.1638952    .0190133
      c_dum4 |   -.059556   .0413175    -1.44   0.154    -.1419611    .0228492
      c_dum5 |  -.0627662   .0395258    -1.59   0.117    -.1415979    .0160655
      c_dum6 |  -.0048214   .0390471    -0.12   0.902    -.0826983    .0730556
      c_dum7 |  -.0754571   .0441115    -1.71   0.092    -.1634347    .0125206
      c_dum8 |  -.0609956   .0488391    -1.25   0.216    -.1584021     .036411
      c_dum9 |  -.0479653   .0347715    -1.38   0.172    -.1173149    .0213842
     c_dum10 |  -.0593409   .0324739    -1.83   0.072    -.1241081    .0054263
     c_dum11 |  -.1516843   .0729891    -2.08   0.041    -.2972564   -.0061122
     c_dum12 |          0  (omitted)
     c_dum13 |   -.053195   .0229214    -2.32   0.023    -.0989103   -.0074797
------------------------------------------------------------------------------

. tabulate prame, sum(rame);

        100 |
  quantiles |        Summary of Residuals
   of rame  |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |  -.76756256   .23867965          10
          2 |   -.4824008   .07617804           9
          3 |  -.33042468   .03200516           9
          4 |  -.24835741   .02505569           8
          5 |  -.19126281   .01632189           9
          6 |  -.15822358   .00588541           5
          7 |  -.14128675   .00714974          13
          8 |   -.1225745   .00575249          12
          9 |  -.10575817   .00213788          11
         10 |  -.09820167   .00301477          14
         11 |  -.08990468   .00199053          13
         12 |  -.08427445    .0014953           7
         13 |   -.0808199    .0007172           7
         14 |  -.07773009   .00171315           6
         15 |  -.07408816   .00074352           7
         16 |  -.07045817   .00082252          13
         17 |  -.06639036   .00253799          19
         18 |  -.05875869   .00152034          15
         19 |  -.05548286   .00057293           9
         20 |  -.05146621   .00193321          22
         21 |  -.04790812   .00046006           9
         22 |  -.04712553   .00014294           5
         23 |  -.04559307   .00078294          23
         24 |  -.04373358   .00040909          10
         25 |  -.04187735   .00083057          24
         26 |  -.03992494   .00053663          20
         27 |  -.03799867   .00058451          11
         28 |  -.03643698   .00054553           7
         29 |  -.03317415   .00144974          10
         30 |  -.03128814   .00012419           4
         31 |  -.03029994   .00047662           9
         32 |  -.02794632   .00053876          11
         33 |  -.02678291    .0002137          11
         35 |   -.0257125   .00039612           8
         36 |   -.0246574   .00034159          12
         37 |  -.02367308   .00039213          12
         38 |  -.02175371   .00061211          10
         39 |   -.0204015   .00048026          16
         40 |  -.01835554   .00083539          15
         41 |  -.01623523   .00040689          10
         42 |  -.01490466   .00035308          12
         43 |  -.01332226   .00051561          13
         44 |  -.01217825   .00032719          14
         45 |   -.0108095   .00053889          17
         46 |  -.00892453   .00074237          21
         47 |  -.00690041   .00054723          25
         48 |  -.00600946   .00006012           6
         49 |  -.00538748   .00024998          18
         50 |   -.0042523   .00053212          24
         51 |   -.0027918   .00046621          23
         52 |  -.00048775   .00070798          27
         53 |   .00105457   .00033007          18
         54 |   .00238494   .00035775          18
         55 |   .00369111   .00045533          20
         56 |   .00514484   .00026635          11
         57 |   .00643375    .0004453          13
         58 |   .00767386   .00016624           9
         59 |   .00881586   .00047562          17
         60 |    .0099879   .00026001          10
         61 |    .0112326   .00039009          15
         62 |   .01227383   .00040001          11
         63 |   .01374075   .00034085          17
         64 |   .01521022   .00047789          10
         65 |   .01695365   .00069487          19
         66 |   .01898921   .00060572          18
         67 |   .02090057   .00042895          10
         68 |   .02171381   .00014076           4
         69 |   .02372986   .00090889          16
         70 |     .025209   .00028774          11
         71 |   .02630279   .00048319          12
         72 |   .02778919    .0003897           8
         73 |   .02993824   .00048998          10
         74 |   .03238613   .00077493           9
         75 |    .0342715   .00050107           8
         76 |   .03806601   .00177364          14
         77 |   .04163906   .00042174          11
         78 |   .04353161   .00073337          13
         79 |   .04695668   .00142259          12
         80 |   .04973557   .00076444          13
         81 |     .051887   .00075619          10
         82 |   .05602678   .00180971          23
         83 |    .0608797   .00086193          20
         84 |   .06430961   .00120057          15
         85 |   .06675764   .00055315          14
         86 |   .06885005   .00083958          17
         87 |   .07227367   .00138163          10
         88 |   .07917118   .00463551           8
         89 |   .09153814   .00537626          14
         90 |   .10409822   .00208011          12
         91 |   .11071211   .00262738          10
         92 |   .12064088   .00281979           6
         93 |   .13237248   .00563549          10
         94 |   .14668011   .00237605           4
         95 |   .15970285    .0095443          12
         96 |   .20287823    .0120882          10
         97 |   .24512698   .00966065          15
         98 |     .270222   .00925371           9
         99 |   .36808939   .05649177           8
        100 |   1.1517476   .62188881          14
------------+------------------------------------
      Total |   .00596487   .17962077       1,253

. ********************************************************************;
. ***************** Table 1 & Tables S3-S4 ***************************;
. ********************************************************************;
. *OLS REGRESSIONS ON OUTLYING NEGATIVE & SIGNIFICANT OUTCOMES;
. summ pos10-neg10s;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       pos10 |      1,253    .1005587    .3008635          0          1
       neg10 |      1,253    .1005587    .3008635          0          1
      pos10s |      1,253    .0526736    .2234702          0          1
      neg10s |      1,253    .0630487    .2431475          0          1

. summ pos10-neg10s [aw=model_brw];

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
       pos10 |   1,253  560.242243    .1000907   .3002407          0          1
       neg10 |   1,253  560.242243    .1076047   .3100043          0          1
      pos10s |   1,253  560.242243    .0478909   .2136206          0          1
      neg10s |   1,253  560.242243    .0661285   .2486058          0          1

. *Table 1, Model 4 & Table S3, Model 1;
. reg neg10s proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(teamid)
> ;
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0957
                                                Root MSE          =     .29076

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0514097   .0206502    -2.49   0.015    -.0925954   -.0102241
   stats_brw |   -.070603   .0325733    -2.17   0.034    -.1355684   -.0056375
   topic_brw |   .0704311   .0269834     2.61   0.011     .0166145    .1242478
          t2 |   .0121625   .0566233     0.21   0.831     -.100769    .1250941
          t3 |   .0394081   .0782831     0.50   0.616    -.1167227    .1955389
             |
     mdegree |
          1  |  -.2952664    .134752    -2.19   0.032    -.5640208   -.0265119
          2  |  -.1028941   .0934569    -1.10   0.275    -.2892881    .0834999
          3  |   .0254023   .0612526     0.41   0.680     -.096762    .1475667
          4  |   .0534134   .0753051     0.71   0.480    -.0967779    .2036047
          5  |  -.1053593   .0846884    -1.24   0.218     -.274265    .0635465
          6  |   .0377933   .1017515     0.37   0.711    -.1651436    .2407303
         20  |  -.0804554   .0706388    -1.14   0.259    -.2213402    .0604293
         33  |  -.0050147   .0652855    -0.08   0.939    -.1352226    .1251932
         34  |  -.1347088   .0598728    -2.25   0.028    -.2541214   -.0152961
         35  |    .161953   .1713399     0.95   0.348    -.1797737    .5036796
         36  |  -.1259628   .0494257    -2.55   0.013    -.2245392   -.0273863
         40  |  -.0520105   .1157094    -0.45   0.654    -.2827856    .1787645
             |
       _cons |   .2988547   .1269035     2.35   0.021     .0457535    .5519558
------------------------------------------------------------------------------

. *Table 1, Model 5 & Table S3, Model 2;
. reg neg10s p12 p56   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1151
                                                Root MSE          =     .28774

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |   .0809324   .1028085     0.79   0.434    -.1241127    .2859775
         p56 |  -.1606565   .0642693    -2.50   0.015    -.2888376   -.0324754
   stats_brw |  -.0664848   .0311382    -2.14   0.036    -.1285881   -.0043816
   topic_brw |   .0669809   .0244665     2.74   0.008      .018184    .1157777
          t2 |   .0116382   .0625634     0.19   0.853    -.1131407     .136417
          t3 |   .0277276   .0770932     0.36   0.720      -.12603    .1814851
             |
     mdegree |
          1  |  -.3330125   .1321903    -2.52   0.014    -.5966579   -.0693672
          2  |  -.1239984   .0956794    -1.30   0.199     -.314825    .0668282
          3  |   .0244739   .0529718     0.46   0.646    -.0811751    .1301228
          4  |   .0440525   .0658996     0.67   0.506      -.08738    .1754851
          5  |  -.1305601   .0733674    -1.78   0.079    -.2768867    .0157666
          6  |  -.0058648   .0822818    -0.07   0.943    -.1699707     .158241
         20  |  -.0783415   .0722181    -1.08   0.282     -.222376    .0656929
         33  |  -.0103473   .0580669    -0.18   0.859    -.1261582    .1054635
         34  |  -.1277286   .0638258    -2.00   0.049    -.2550251   -.0004321
         35  |   .1645209   .1638627     1.00   0.319     -.162293    .4913348
         36  |  -.1428256   .0500535    -2.85   0.006    -.2426542   -.0429971
         40  |  -.0715434   .1287275    -0.56   0.580    -.3282823    .1851956
             |
       _cons |   .1638598   .0875085     1.87   0.065    -.0106704      .33839
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
      neg10s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.2415889   .1074294    -2.25   0.028    -.4558501   -.0273277
------------------------------------------------------------------------------

. *Table S3, Model 3;
. reg neg10s group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1179
                                                Root MSE          =     .28716

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |  -.1573043   .0507644    -3.10   0.003    -.2585507   -.0560578
   stats_brw |  -.0654272   .0303373    -2.16   0.034    -.1259331   -.0049214
   topic_brw |    .067257   .0250645     2.68   0.009     .0172674    .1172465
          t2 |  -.0475072    .058734    -0.81   0.421    -.1646485     .069634
          t3 |    .029602   .0729754     0.41   0.686    -.1159429    .1751469
             |
     mdegree |
          1  |  -.2435842   .1162299    -2.10   0.040    -.4753975   -.0117709
          2  |  -.1184538   .0711488    -1.66   0.100    -.2603555     .023448
          3  |   .0489217    .057117     0.86   0.395    -.0649945    .1628379
          4  |   .0693801   .0641217     1.08   0.283    -.0585067    .1972668
          5  |  -.1112886   .0573502    -1.94   0.056    -.2256699    .0030926
          6  |  -.0126963   .0829546    -0.15   0.879    -.1781441    .1527514
         20  |  -.0471713   .0784474    -0.60   0.550    -.2036298    .1092871
         33  |  -.0175965   .0503481    -0.35   0.728    -.1180125    .0828196
         34  |  -.0991049   .0506376    -1.96   0.054    -.2000984    .0018886
         35  |   .1654668   .1266058     1.31   0.196    -.0870405    .4179742
         36  |  -.1670532    .048255    -3.46   0.001    -.2632948   -.0708117
         40  |  -.0812835   .1189473    -0.68   0.497    -.3185164    .1559494
             |
       _cons |   .1588316   .0654604     2.43   0.018      .028275    .2893882
------------------------------------------------------------------------------

. *Table 1, Model 6 & Table S3, Model 4;
. reg neg10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(te
> amid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1331
                                                Root MSE          =     .28479

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .1499767   .1231782     1.22   0.227    -.0956945    .3956478
      group3 |  -.1238967   .0439937    -2.82   0.006    -.2116394   -.0361541
   stats_brw |  -.0587452   .0288513    -2.04   0.046    -.1162873    -.001203
   topic_brw |   .0694603   .0267588     2.60   0.011     .0160915    .1228291
          t2 |  -.0013585   .0631055    -0.02   0.983    -.1272186    .1245015
          t3 |   .0486447   .0798961     0.61   0.545     -.110703    .2079925
             |
     mdegree |
          1  |  -.3201665   .1375127    -2.33   0.023    -.5944268   -.0459062
          2  |  -.0635652   .0910883    -0.70   0.488     -.245235    .1181047
          3  |   .0376362    .048464     0.78   0.440    -.0590221    .1342946
          4  |   .0693089   .0656209     1.06   0.295    -.0615678    .2001856
          5  |  -.1151151   .0721569    -1.60   0.115    -.2590274    .0287973
          6  |   .0070074   .0952643     0.07   0.942    -.1829913    .1970061
         20  |  -.0524606    .070178    -0.75   0.457    -.1924263    .0875051
         33  |  -.0241572   .0654989    -0.37   0.713    -.1547906    .1064762
         34  |  -.0836895   .0398353    -2.10   0.039    -.1631384   -.0042405
         35  |   .1775515   .1410087     1.26   0.212    -.1036816    .4587845
         36  |  -.2900922   .1251741    -2.32   0.023    -.5397441   -.0404403
         40  |  -.1214856   .0873134    -1.39   0.169    -.2956267    .0526554
             |
       _cons |   .1075995   .0838129     1.28   0.203    -.0595601    .2747591
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
      neg10s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.2738734   .1252005    -2.19   0.032    -.5235778    -.024169
------------------------------------------------------------------------------

. *Table S3, Model 5;
. reg neg10s p12 p56 pbelief  stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(t
> eamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(15, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1233
                                                Root MSE          =     .28652

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |   .0970898   .0949447     1.02   0.310    -.0922714     .286451
         p56 |  -.1516408   .0648077    -2.34   0.022    -.2808957    -.022386
     pbelief |   -.081718   .0464331    -1.76   0.083    -.1743259    .0108899
   stats_brw |  -.0676388   .0301001    -2.25   0.028    -.1276716   -.0076059
   topic_brw |   .0659893   .0239898     2.75   0.008     .0181432    .1138355
          t2 |   .0276096   .0597366     0.46   0.645    -.0915314    .1467505
          t3 |   .0415476   .0744419     0.56   0.579     -.106922    .1900172
             |
     mdegree |
          1  |  -.2486173    .131936    -1.88   0.064    -.5117553    .0145207
          2  |  -.1021555   .0968987    -1.05   0.295    -.2954138    .0911028
          3  |   .0762086    .060993     1.25   0.216    -.0454381    .1978553
          4  |   .0851661   .0727691     1.17   0.246    -.0599673    .2302994
          5  |  -.0384501   .0931219    -0.41   0.681    -.2241759    .1472757
          6  |   .0293707   .0804285     0.37   0.716    -.1310389    .1897804
         20  |  -.0364193   .0763789    -0.48   0.635    -.1887523    .1159136
         33  |   .0402018   .0607015     0.66   0.510    -.0808636    .1612672
         34  |  -.0628176   .0751226    -0.84   0.406    -.2126448    .0870097
         35  |    .210693    .158238     1.33   0.187    -.1049027    .5262887
         36  |  -.0864461   .0631347    -1.37   0.175    -.2123642     .039472
         40  |  -.0262977   .1227139    -0.21   0.831    -.2710429    .2184475
             |
       _cons |   .1408614   .0874328     1.61   0.112    -.0335178    .3152406
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
      neg10s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.2487306    .096823    -2.57   0.012    -.4418381   -.0556232
------------------------------------------------------------------------------

. *Table S3, Model 6;
. reg neg10s group1 group3 pbelief stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  clus
> ter(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(15, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1430
                                                Root MSE          =     .28329

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .1658316   .1177303     1.41   0.163    -.0689741    .4006373
      group3 |  -.1149011   .0446993    -2.57   0.012     -.204051   -.0257512
     pbelief |  -.0897649   .0484864    -1.85   0.068    -.1864679    .0069381
   stats_brw |  -.0597737   .0272556    -2.19   0.032    -.1141333   -.0054141
   topic_brw |    .067824   .0254989     2.66   0.010      .016968      .11868
          t2 |   .0180917   .0596005     0.30   0.762    -.1007777    .1369611
          t3 |    .061932   .0772992     0.80   0.426    -.0922364    .2161004
             |
     mdegree |
          1  |  -.2280131   .1365554    -1.67   0.099    -.5003642    .0443381
          2  |  -.0428714   .0903828    -0.47   0.637    -.2231342    .1373915
          3  |   .0925248   .0614184     1.51   0.136    -.0299704      .21502
          4  |   .1121681   .0739262     1.52   0.134     -.035273    .2596092
          5  |  -.0153821   .0957795    -0.16   0.873    -.2064082    .1756441
          6  |   .0446408   .0931117     0.48   0.633    -.1410647    .2303462
         20  |  -.0087984   .0744362    -0.12   0.906    -.1572567    .1396599
         33  |   .0299252   .0657983     0.45   0.651    -.1013053    .1611557
         34  |  -.0117874   .0501037    -0.24   0.815    -.1117161    .0881413
         35  |    .227659   .1371461     1.66   0.101    -.0458703    .5011883
         36  |  -.2357751   .1270487    -1.86   0.068    -.4891656    .0176155
         40  |   -.076162   .0842944    -0.90   0.369     -.244282    .0919579
             |
       _cons |   .0852305   .0824897     1.03   0.305      -.07929    .2497509
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
      neg10s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.2807327    .118737    -2.36   0.021     -.517546   -.0439193
------------------------------------------------------------------------------

. *REGRESSIONS ON OUTLYING POSITIVE & SIGNIFICANT COEFFICIENTS;
. *Table 1, Model 7 & Table S4, Model 1;
. reg pos10s proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(teamid)
> ;
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0869
                                                Root MSE          =      .2449

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0192455   .0115145     1.67   0.099    -.0037194    .0422103
   stats_brw |   .0209144   .0168047     1.24   0.217    -.0126015    .0544303
   topic_brw |  -.0209403   .0134953    -1.55   0.125    -.0478558    .0059751
          t2 |   .0278721   .0372607     0.75   0.457     -.046442    .1021861
          t3 |   .0218568   .0313074     0.70   0.487    -.0405838    .0842974
             |
     mdegree |
          1  |   .4802214   .0696325     6.90   0.000     .3413438     .619099
          2  |   .0611769   .0501873     1.22   0.227    -.0389185    .1612723
          3  |   .0549283   .0242916     2.26   0.027     .0064803    .1033763
          4  |   .1082576   .0415449     2.61   0.011     .0253989    .1911163
          5  |   .2922169   .1067966     2.74   0.008     .0792178     .505216
          6  |   .0359115   .0383373     0.94   0.352    -.0405499    .1123729
         20  |   .1453303   .0743141     1.96   0.055    -.0028845    .2935452
         33  |   .1123582    .068277     1.65   0.104     -.023816    .2485324
         34  |   .0400006   .0223524     1.79   0.078    -.0045798     .084581
         35  |   .2262991   .1465304     1.54   0.127    -.0659465    .5185448
         36  |   .0318941   .0292981     1.09   0.280    -.0265391    .0903274
         40  |   .0963042   .0290565     3.31   0.001     .0383528    .1542556
             |
       _cons |  -.1313411   .0771212    -1.70   0.093    -.2851545    .0224723
------------------------------------------------------------------------------

. *Table 1, Model 8 & Table S4, Model 2;
. reg pos10s p12 p56   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0909
                                                Root MSE          =     .24447

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.1303656   .0568758    -2.29   0.025    -.2438009   -.0169303
         p56 |  -.0161202   .0412526    -0.39   0.697    -.0983958    .0661554
   stats_brw |   .0214705   .0163152     1.32   0.192    -.0110691    .0540101
   topic_brw |  -.0286732   .0149169    -1.92   0.059     -.058424    .0010775
          t2 |   .0008766   .0390577     0.02   0.982    -.0770216    .0787748
          t3 |   .0008057   .0324458     0.02   0.980    -.0639055    .0655169
             |
     mdegree |
          1  |   .4931991   .0646379     7.63   0.000     .3642828    .6221154
          2  |  -.0409355   .0679387    -0.60   0.549    -.1764351     .094564
          3  |   .0301434   .0242925     1.24   0.219    -.0183064    .0785932
          4  |   .0751496   .0395665     1.90   0.062    -.0037633    .1540625
          5  |   .2427746    .092813     2.62   0.011     .0576649    .4278844
          6  |  -.0112252   .0454809    -0.25   0.806    -.1019339    .0794836
         20  |    .114996   .0731845     1.57   0.121    -.0309658    .2609578
         33  |   .0762296   .0746332     1.02   0.311    -.0726217    .2250809
         34  |    .014046   .0241156     0.58   0.562     -.034051     .062143
         35  |   .1858776   .1551776     1.20   0.235    -.1236143    .4953696
         36  |   .0212165   .0258179     0.82   0.414    -.0302758    .0727087
         40  |   .0540677   .0328363     1.65   0.104    -.0114223    .1195577
             |
       _cons |   .0220231   .0624401     0.35   0.725    -.1025097    .1465559
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
      pos10s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1142454   .0458145     2.49   0.015     .0228713    .2056195
------------------------------------------------------------------------------

. *Table S4, Model 3;
. reg pos10s group1   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0886
                                                Root MSE          =     .24468

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   -.079337   .0312599    -2.54   0.013    -.1416829   -.0169912
   stats_brw |   .0196986   .0166176     1.19   0.240    -.0134442    .0528415
   topic_brw |  -.0244971   .0137417    -1.78   0.079     -.051904    .0029099
          t2 |   .0131887   .0369941     0.36   0.723    -.0605937     .086971
          t3 |   .0142382   .0304584     0.47   0.642    -.0465091    .0749856
             |
     mdegree |
          1  |   .4691629   .0577056     8.13   0.000     .3540727    .5842531
          2  |  -.0075748   .0351633    -0.22   0.830    -.0777058    .0625562
          3  |   .0367904   .0185457     1.98   0.051    -.0001977    .0737786
          4  |   .0853581   .0377603     2.26   0.027     .0100475    .1606687
          5  |   .2537934   .0911905     2.78   0.007     .0719196    .4356671
          6  |    .006502   .0310403     0.21   0.835    -.0554059      .06841
         20  |    .122762   .0715496     1.72   0.091    -.0199391    .2654631
         33  |   .0916475    .061225     1.50   0.139     -.030462    .2137569
         34  |   .0065261   .0100545     0.65   0.518     -.013527    .0265791
         35  |   .1951032   .1509671     1.29   0.200    -.1059911    .4961975
         36  |   .0683229   .0335116     2.04   0.045     .0014861    .1351596
         40  |   .0865989    .027245     3.18   0.002     .0322604    .1409374
             |
       _cons |  -.0082247   .0314766    -0.26   0.795    -.0710029    .0545535
------------------------------------------------------------------------------

. *Table 1, Model 9 & Table S4, Model 4;
. reg pos10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(te
> amid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0893
                                                Root MSE          =     .24468

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0695299    .037774    -1.84   0.070    -.1448677    .0058078
      group3 |   .0173149   .0339734     0.51   0.612    -.0504429    .0850727
   stats_brw |   .0185729   .0169578     1.10   0.277    -.0152483    .0523941
   topic_brw |  -.0230389   .0144269    -1.60   0.115    -.0518126    .0057347
          t2 |   .0208351   .0384056     0.54   0.589    -.0557625    .0974326
          t3 |   .0159298   .0304898     0.52   0.603    -.0448801    .0767398
             |
     mdegree |
          1  |   .4759843   .0590043     8.07   0.000      .358304    .5936647
          2  |   .0127327   .0526397     0.24   0.810    -.0922539    .1177194
          3  |   .0416704   .0213894     1.95   0.055    -.0009893    .0843301
          4  |   .0915796   .0359785     2.55   0.013     .0198228    .1633364
          5  |   .2692067   .0973468     2.77   0.007     .0750546    .4633587
          6  |   .0216992   .0434747     0.50   0.619    -.0650084    .1084067
         20  |   .1271541   .0726923     1.75   0.085    -.0178262    .2721344
         33  |   .1018247   .0693412     1.47   0.146    -.0364719    .2401213
         34  |   .0119362   .0131417     0.91   0.367    -.0142741    .0381465
         35  |   .2045159   .1460032     1.40   0.166    -.0866782    .4957101
         36  |   .0764449   .0370088     2.07   0.043     .0026333    .1502566
         40  |   .0993631    .035338     2.81   0.006     .0288837    .1698425
             |
       _cons |  -.0275794   .0477481    -0.58   0.565      -.12281    .0676511
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
      pos10s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0868448   .0346823     2.50   0.015     .0176731    .1560166
------------------------------------------------------------------------------

. *Table S4, Model 5;
. reg pos10s p12 p56 pbelief  stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(t
> eamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(15, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0914
                                                Root MSE          =     .24451

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.1271995    .057451    -2.21   0.030    -.2417819    -.012617
         p56 |  -.0143535    .040546    -0.35   0.724    -.0952199    .0665129
     pbelief |  -.0160132   .0302813    -0.53   0.599    -.0764074     .044381
   stats_brw |   .0212444   .0163403     1.30   0.198    -.0113453     .053834
   topic_brw |  -.0288675   .0151473    -1.91   0.061    -.0590779    .0013428
          t2 |   .0040063   .0397994     0.10   0.920    -.0753711    .0833837
          t3 |   .0035138    .033224     0.11   0.916    -.0627493    .0697769
             |
     mdegree |
          1  |   .5097369   .0739368     6.89   0.000     .3622746    .6571993
          2  |  -.0366553   .0674455    -0.54   0.589    -.1711711    .0978606
          3  |   .0402812   .0279574     1.44   0.154    -.0154781    .0960405
          4  |   .0832061   .0409758     2.03   0.046     .0014825    .1649296
          5  |   .2608242   .0943573     2.76   0.007     .0726345    .4490139
          6  |  -.0043205   .0445577    -0.10   0.923     -.093188    .0845469
         20  |   .1232109    .074822     1.65   0.104    -.0260168    .2724386
         33  |    .086135   .0698583     1.23   0.222    -.0531929    .2254629
         34  |   .0267657   .0307714     0.87   0.387    -.0346058    .0881373
         35  |   .1949254   .1569595     1.24   0.218    -.1181206    .5079713
         36  |   .0322644   .0259146     1.25   0.217    -.0194207    .0839495
         40  |   .0629339   .0312504     2.01   0.048      .000607    .1252608
             |
       _cons |   .0175164   .0619919     0.28   0.778    -.1061225    .1411553
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
      pos10s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1128459   .0467086     2.42   0.018     .0196885    .2060034
------------------------------------------------------------------------------

. *Table S4, Model 6;
. reg pos10s group1 group3 pbelief stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  clus
> ter(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(15, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0900
                                                Root MSE          =     .24469

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0661129   .0386616    -1.71   0.092    -.1432211    .0109953
      group3 |   .0192536   .0335447     0.57   0.568    -.0476492    .0861564
     pbelief |   -.019346   .0288505    -0.67   0.505    -.0768865    .0381944
   stats_brw |   .0183513   .0169817     1.08   0.284    -.0155177    .0522202
   topic_brw |  -.0233916   .0146659    -1.59   0.115    -.0526418    .0058586
          t2 |    .025027   .0389696     0.64   0.523    -.0526954    .1027493
          t3 |   .0187935   .0311479     0.60   0.548     -.043329     .080916
             |
     mdegree |
          1  |   .4958451   .0686207     7.23   0.000     .3589854    .6327049
          2  |   .0171927   .0523893     0.33   0.744    -.0872946    .1216799
          3  |   .0534999   .0256498     2.09   0.041     .0023431    .1046568
          4  |   .1008165   .0371163     2.72   0.008     .0267904    .1748426
          5  |    .290701   .0988089     2.94   0.004     .0936329    .4877691
          6  |   .0298099    .042506     0.70   0.485    -.0549657    .1145855
         20  |   .1365642   .0742106     1.84   0.070    -.0114441    .2845724
         33  |   .1134805   .0658452     1.72   0.089    -.0178437    .2448046
         34  |   .0274325   .0263899     1.04   0.302    -.0252005    .0800654
         35  |    .215315   .1478615     1.46   0.150    -.0795855    .5102155
         36  |   .0881513   .0339918     2.59   0.012     .0203568    .1559458
         40  |   .1091312   .0324515     3.36   0.001     .0444086    .1738537
             |
       _cons |  -.0324004   .0475731    -0.68   0.498     -.127282    .0624812
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
      pos10s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0853665   .0357731     2.39   0.020     .0140194    .1567137
------------------------------------------------------------------------------

. *make a pscore that averages 1 for balanced weighting;
. gen pscore_1 = pscore - 3.190467;
(1 missing value generated)

. ************************** Lower Portion of Tables S3 & S4 *********************************
> *****;
. *WEIGHTED BY PEER REFEREE SCORES;
. reg neg10s proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/(pscore_1*nmodel)] ,  clus
> ter(teamid);
(sum of wgt is 93.49361655574957)

Linear regression                               Number of obs     =      1,178
                                                F(13, 66)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0989
                                                Root MSE          =     .24534

                                (Std. err. adjusted for 67 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0465462   .0210721    -2.21   0.031    -.0886181   -.0044742
   stats_brw |  -.0800458   .0296744    -2.70   0.009    -.1392926   -.0207989
   topic_brw |   .0711008   .0258572     2.75   0.008     .0194753    .1227263
          t2 |  -.0105973   .0522731    -0.20   0.840    -.1149638    .0937693
          t3 |  -.0037455   .0726281    -0.05   0.959    -.1487522    .1412612
             |
     mdegree |
          2  |  -.1313624   .0864616    -1.52   0.133    -.3039886    .0412637
          3  |    .017905   .0459529     0.39   0.698     -.073843    .1096529
          4  |  -.0163943   .0640422    -0.26   0.799    -.1442587    .1114701
          5  |  -.1074173   .0830133    -1.29   0.200    -.2731587     .058324
          6  |  -.0191412   .0769557    -0.25   0.804    -.1727881    .1345057
         20  |  -.0992259    .060696    -1.63   0.107    -.2204095    .0219576
         33  |  -.0645836   .0377589    -1.71   0.092    -.1399716    .0108044
         34  |  -.1263344   .0537945    -2.35   0.022    -.2337385   -.0189303
         35  |   .1161334   .1597213     0.73   0.470    -.2027605    .4350274
         36  |  -.1064552   .0532291    -2.00   0.050    -.2127305   -.0001799
         40  |   .0019868   .1132166     0.02   0.986    -.2240574    .2280311
             |
       _cons |   .3108095   .1256457     2.47   0.016     .0599497    .5616693
------------------------------------------------------------------------------

. reg neg10s p12 p56   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/(pscore_1*nmodel)] ,  clust
> er(teamid);
(sum of wgt is 93.49361655574957)

Linear regression                               Number of obs     =      1,178
                                                F(14, 66)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1114
                                                Root MSE          =     .24374

                                (Std. err. adjusted for 67 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |    .051285   .1017669     0.50   0.616    -.1518992    .2544692
         p56 |  -.1358752   .0544966    -2.49   0.015    -.2446812   -.0270691
   stats_brw |  -.0783249   .0292999    -2.67   0.009     -.136824   -.0198258
   topic_brw |   .0699986   .0243328     2.88   0.005     .0214165    .1185806
          t2 |  -.0349007   .0564324    -0.62   0.538    -.1475716    .0777701
          t3 |  -.0328399   .0726039    -0.45   0.653    -.1777981    .1121184
             |
     mdegree |
          2  |  -.1576279   .0925591    -1.70   0.093    -.3424282    .0271723
          3  |   .0261512   .0389551     0.67   0.504    -.0516251    .1039276
          4  |  -.0174139    .063651    -0.27   0.785    -.1444972    .1096694
          5  |  -.1247997   .0740996    -1.68   0.097    -.2727444    .0231449
          6  |  -.0413217   .0637394    -0.65   0.519    -.1685815     .085938
         20  |  -.0895059   .0641235    -1.40   0.167    -.2175327    .0385209
         33  |  -.0423324   .0253936    -1.67   0.100    -.0930324    .0083677
         34  |  -.1216707   .0559458    -2.17   0.033    -.2333702   -.0099713
         35  |   .1264116   .1530565     0.83   0.412    -.1791756    .4319987
         36  |  -.1067581   .0492523    -2.17   0.034    -.2050934   -.0084227
         40  |   .0023344    .119725     0.02   0.985    -.2367042     .241373
             |
       _cons |   .1969464    .085967     2.29   0.025     .0253077    .3685851
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
      neg10s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.1871602   .1012407    -1.85   0.069    -.3892938    .0149734
------------------------------------------------------------------------------

. reg neg10s group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/(pscore_1*nmodel)] ,  cluste
> r(teamid);
(sum of wgt is 93.49361655574957)

Linear regression                               Number of obs     =      1,178
                                                F(13, 66)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1080
                                                Root MSE          =      .2441

                                (Std. err. adjusted for 67 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |  -.1171104   .0421151    -2.78   0.007    -.2011959    -.033025
   stats_brw |  -.0770725   .0288292    -2.67   0.009    -.1346319   -.0195131
   topic_brw |   .0690069    .025406     2.72   0.008     .0182822    .1197316
          t2 |   -.075691   .0552917    -1.37   0.176    -.1860845    .0347025
          t3 |  -.0179422   .0693502    -0.26   0.797    -.1564044    .1205199
             |
     mdegree |
          2  |   -.124823   .0693442    -1.80   0.076    -.2632732    .0136272
          3  |   .0585809   .0402443     1.46   0.150    -.0217695    .1389313
          4  |   .0057459   .0625449     0.09   0.927     -.119129    .1306208
          5  |  -.0896463   .0564913    -1.59   0.117    -.2024347    .0231421
          6  |  -.0281624   .0644516    -0.44   0.664    -.1568442    .1005194
         20  |   -.055195   .0677629    -0.81   0.418     -.190488    .0800979
         33  |  -.0402773   .0256917    -1.57   0.122    -.0915724    .0110178
         34  |  -.0979165   .0436638    -2.24   0.028     -.185094    -.010739
         35  |   .1442689   .1283843     1.12   0.265    -.1120586    .4005963
         36  |  -.1170374   .0441976    -2.65   0.010    -.2052809    -.028794
         40  |     .00259   .1113161     0.02   0.982    -.2196597    .2248398
             |
       _cons |   .1636221   .0644708     2.54   0.014     .0349019    .2923423
------------------------------------------------------------------------------

. reg neg10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/(pscore_1*nmodel)] , 
>  cluster(teamid);
(sum of wgt is 93.49361655574957)

Linear regression                               Number of obs     =      1,178
                                                F(14, 66)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1167
                                                Root MSE          =     .24301

                                (Std. err. adjusted for 67 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .1148949   .0956985     1.20   0.234    -.0761733    .3059632
      group3 |  -.0895392   .0383693    -2.33   0.023     -.166146   -.0129324
   stats_brw |  -.0744307   .0295229    -2.52   0.014     -.133375   -.0154864
   topic_brw |   .0718007   .0265312     2.71   0.009     .0188295    .1247719
          t2 |  -.0433521   .0570976    -0.76   0.450    -.1573511    .0706469
          t3 |   -.003659   .0757419    -0.05   0.962    -.1548825    .1475645
             |
     mdegree |
          2  |  -.0802053   .0840889    -0.95   0.344    -.2480943    .0876837
          3  |   .0541153   .0386987     1.40   0.167    -.0231493    .1313798
          4  |   .0137743   .0663312     0.21   0.836    -.1186603    .1462089
          5  |  -.0891165   .0743284    -1.20   0.235     -.237518     .059285
          6  |  -.0124423   .0724334    -0.17   0.864    -.1570602    .1321757
         20  |  -.0544799   .0636929    -0.86   0.395    -.1816468     .072687
         33  |  -.0420479   .0273076    -1.54   0.128    -.0965692    .0124735
         34  |  -.0836426   .0362155    -2.31   0.024    -.1559493    -.011336
         35  |   .1521796   .1387813     1.10   0.277    -.1249062    .4292654
         36  |   -.207419   .1015461    -2.04   0.045    -.4101623   -.0046758
         40  |  -.0429334   .0943158    -0.46   0.650     -.231241    .1453742
             |
       _cons |    .122099    .077697     1.57   0.121     -.033028     .277226
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
      neg10s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.2044342   .0965348    -2.12   0.038    -.3971721   -.0116962
------------------------------------------------------------------------------

. reg neg10s p12 p56 pbelief  stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/(pscore_1*nmodel)] ,
>   cluster(teamid);
(sum of wgt is 93.49361655574957)

Linear regression                               Number of obs     =      1,178
                                                F(15, 66)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1232
                                                Root MSE          =     .24223

                                (Std. err. adjusted for 67 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |   .0876503   .0911167     0.96   0.340      -.09427    .2695706
         p56 |  -.1236214   .0532218    -2.32   0.023    -.2298822   -.0173606
     pbelief |  -.0922486   .0410199    -2.25   0.028    -.1741474   -.0103497
   stats_brw |  -.0815242    .028154    -2.90   0.005    -.1377355    -.025313
   topic_brw |   .0727756   .0252171     2.89   0.005      .022428    .1231232
          t2 |    .003029   .0523357     0.06   0.954    -.1014625    .1075205
          t3 |   .0040406   .0683728     0.06   0.953      -.13247    .1405512
             |
     mdegree |
          2  |  -.1060753   .0928323    -1.14   0.257     -.291421    .0792704
          3  |   .0842005   .0504981     1.67   0.100    -.0166222    .1850232
          4  |   .0351823   .0669245     0.53   0.601    -.0984368    .1688013
          5  |  -.0090089   .0909846    -0.10   0.921    -.1906656    .1726478
          6  |   .0107908   .0684925     0.16   0.875    -.1259589    .1475404
         20  |  -.0368671   .0686598    -0.54   0.593    -.1739509    .1002166
         33  |   .0380712    .041058     0.93   0.357    -.0439037    .1200461
         34  |  -.0431259   .0643407    -0.67   0.505    -.1715864    .0853345
         35  |   .1843243   .1482627     1.24   0.218    -.1116918    .4803404
         36  |  -.0471103   .0546335    -0.86   0.392    -.1561896     .061969
         40  |   .0470167   .1077822     0.44   0.664    -.1681775    .2622109
             |
       _cons |   .1469293   .0840397     1.75   0.085    -.0208614      .31472
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
      neg10s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.2112717   .0863378    -2.45   0.017    -.3836506   -.0388927
------------------------------------------------------------------------------

. reg neg10s group1 group3 pbelief stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/(pscore_1*nmode
> l)] ,  cluster(teamid);
(sum of wgt is 93.49361655574957)

Linear regression                               Number of obs     =      1,178
                                                F(15, 66)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1296
                                                Root MSE          =     .24133

                                (Std. err. adjusted for 67 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |    .139583   .0887911     1.57   0.121    -.0376941    .3168601
      group3 |  -.0797523   .0380478    -2.10   0.040    -.1557172   -.0037874
     pbelief |  -.0961504   .0428931    -2.24   0.028    -.1817893   -.0105115
   stats_brw |  -.0775516   .0280384    -2.77   0.007    -.1335321   -.0215712
   topic_brw |   .0737104   .0266884     2.76   0.007     .0204253    .1269955
          t2 |  -.0034236   .0527557    -0.06   0.948    -.1087538    .1019067
          t3 |   .0310002   .0714251     0.43   0.666    -.1116047     .173605
             |
     mdegree |
          2  |  -.0341481   .0832766    -0.41   0.683    -.2004151    .1321189
          3  |   .1126811   .0520686     2.16   0.034     .0087228    .2166395
          4  |   .0651275   .0690483     0.94   0.349    -.0727319    .2029869
          5  |   .0300431   .0911132     0.33   0.743    -.1518702    .2119565
          6  |   .0395947   .0761617     0.52   0.605    -.1124672    .1916565
         20  |  -.0026502   .0675055    -0.04   0.969    -.1374293    .1321289
         33  |   .0409798   .0425424     0.96   0.339    -.0439589    .1259184
         34  |  -.0012524   .0472991    -0.03   0.979     -.095688    .0931833
         35  |   .2102586   .1353431     1.55   0.125    -.0599627    .4804798
         36  |  -.1559623   .0956031    -1.63   0.108      -.34684    .0349155
         40  |  -.0046799   .0802795    -0.06   0.954     -.164963    .1556032
             |
       _cons |   .0768542   .0752682     1.02   0.311    -.0734236    .2271321
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
      neg10s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.2193353     .08769    -2.50   0.015     -.394414   -.0442566
------------------------------------------------------------------------------

. *REGRESSIONS ON OUTLYING POSITIVE & SIGNIFICANT COEFFICIENTS;
. reg pos10s proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/(pscore_1*nmodel)] ,  clus
> ter(teamid);
(sum of wgt is 93.49361655574957)

Linear regression                               Number of obs     =      1,178
                                                F(13, 66)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1194
                                                Root MSE          =     .31353

                                (Std. err. adjusted for 67 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0351749   .0159658     2.20   0.031     .0032981    .0670517
   stats_brw |   .0154422    .019114     0.81   0.422    -.0227201    .0536045
   topic_brw |  -.0162385   .0172212    -0.94   0.349    -.0506217    .0181447
          t2 |   .0762606   .0828234     0.92   0.361    -.0891017    .2416228
          t3 |   .0458988    .050642     0.91   0.368    -.0552113    .1470089
             |
     mdegree |
          2  |   .1370986   .0768166     1.78   0.079    -.0162706    .2904678
          3  |   .0706587   .0263462     2.68   0.009     .0180568    .1232607
          4  |   .2407676   .0803844     3.00   0.004      .080275    .4012601
          5  |   .3363176   .1281305     2.62   0.011     .0804969    .5921384
          6  |    .041046   .0500986     0.82   0.416     -.058979     .141071
         20  |   .1218455   .0781094     1.56   0.124     -.034105     .277796
         33  |   .3157411   .0752661     4.19   0.000     .1654676    .4660146
         34  |   .0649582   .0310644     2.09   0.040     .0029362    .1269803
         35  |   .3077899   .1346633     2.29   0.025     .0389259    .5766539
         36  |   .0726694   .0403198     1.80   0.076    -.0078317    .1531706
         40  |   .1348948    .041739     3.23   0.002     .0515602    .2182294
             |
       _cons |  -.2524659   .1141022    -2.21   0.030    -.4802782   -.0246535
------------------------------------------------------------------------------

. reg pos10s p12 p56   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/(pscore_1*nmodel)] ,  clust
> er(teamid);
(sum of wgt is 93.49361655574957)

Linear regression                               Number of obs     =      1,178
                                                F(14, 66)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1160
                                                Root MSE          =     .31426

                                (Std. err. adjusted for 67 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.1152686   .0743141    -1.55   0.126    -.2636416    .0331043
         p56 |   .0089354   .0620838     0.14   0.886    -.1150189    .1328898
   stats_brw |   .0135218   .0193327     0.70   0.487    -.0250772    .0521208
   topic_brw |  -.0194527   .0190191    -1.02   0.310    -.0574256    .0185202
          t2 |   .0653919   .0851535     0.77   0.445    -.1046225    .2354064
          t3 |   .0433954   .0531358     0.82   0.417    -.0626935    .1494844
             |
     mdegree |
          2  |     .03489   .0962148     0.36   0.718     -.157209    .2269891
          3  |   .0338326   .0292335     1.16   0.251     -.024534    .0921992
          4  |   .2070813   .0760303     2.72   0.008     .0552818    .3588807
          5  |   .2754028   .1159939     2.37   0.020     .0438134    .5069921
          6  |  -.0032399    .064185    -0.05   0.960    -.1313893    .1249096
         20  |   .0810267   .0826701     0.98   0.331    -.0840294    .2460828
         33  |   .2843868   .0801163     3.55   0.001     .1244294    .4443442
         34  |   .0159845   .0324583     0.49   0.624    -.0488206    .0807896
         35  |   .2580702   .1432327     1.80   0.076    -.0279031    .5440436
         36  |    .037505   .0371152     1.01   0.316    -.0365979    .1116079
         40  |    .076103   .0459205     1.66   0.102    -.0155803    .1677864
             |
       _cons |  -.0479969   .0895724    -0.54   0.594    -.2268339    .1308401
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
      pos10s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1242041    .063034     1.97   0.053    -.0016474    .2500555
------------------------------------------------------------------------------

. reg pos10s group1   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/(pscore_1*nmodel)] ,  cluste
> r(teamid);
(sum of wgt is 93.49361655574957)

Linear regression                               Number of obs     =      1,178
                                                F(13, 66)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1172
                                                Root MSE          =     .31392

                                (Std. err. adjusted for 67 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.1111983   .0495061    -2.25   0.028    -.2100404   -.0123561
   stats_brw |   .0114977   .0194437     0.59   0.556    -.0273228    .0503183
   topic_brw |  -.0176942   .0178195    -0.99   0.324     -.053272    .0178835
          t2 |   .0641144   .0858847     0.75   0.458      -.10736    .2355887
          t3 |   .0428656   .0522838     0.82   0.415    -.0615223    .1472536
             |
     mdegree |
          2  |   .0269562    .055231     0.49   0.627    -.0833161    .1372286
          3  |   .0306613   .0175711     1.74   0.086    -.0044206    .0657432
          4  |   .2057321   .0765971     2.69   0.009     .0528011    .3586631
          5  |   .2684597    .103178     2.60   0.011     .0624583    .4744612
          6  |  -.0075673   .0426413    -0.18   0.860    -.0927035    .0775688
         20  |   .0780266   .0755695     1.03   0.306    -.0728528     .228906
         33  |   .2865515   .0767593     3.73   0.000     .1332966    .4398064
         34  |    .001544   .0077747     0.20   0.843    -.0139787    .0170668
         35  |   .2553772   .1415054     1.80   0.076    -.0271474    .5379018
         36  |   .1056525   .0522628     2.02   0.047     .0013064    .2099985
         40  |   .1165187   .0499435     2.33   0.023     .0168033     .216234
             |
       _cons |  -.0390903   .0535244    -0.73   0.468    -.1459553    .0677747
------------------------------------------------------------------------------

. reg pos10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/(pscore_1*nmodel)] , 
>  cluster(teamid);
(sum of wgt is 93.49361655574957)

Linear regression                               Number of obs     =      1,178
                                                F(14, 66)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1177
                                                Root MSE          =     .31397

                                (Std. err. adjusted for 67 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.1258313    .063437    -1.98   0.051    -.2524873    .0008247
      group3 |  -.0203365   .0632568    -0.32   0.749    -.1466328    .1059599
   stats_brw |   .0113951   .0195765     0.58   0.562    -.0276906    .0504809
   topic_brw |   -.018141   .0183776    -0.99   0.327    -.0548331    .0185511
          t2 |   .0518197   .0750705     0.69   0.492    -.0980633    .2017027
          t3 |   .0410634   .0495478     0.83   0.410     -.057862    .1399888
             |
     mdegree |
          2  |   .0043937   .0770485     0.06   0.955    -.1494385    .1582259
          3  |   .0275337   .0212351     1.30   0.199    -.0148636     .069931
          4  |   .2018425   .0707055     2.85   0.006     .0606745    .3430105
          5  |   .2537176   .1091318     2.32   0.023     .0358289    .4716064
          6  |  -.0205154   .0632051    -0.32   0.747    -.1467086    .1056777
         20  |   .0752538   .0791574     0.95   0.345     -.082789    .2332966
         33  |   .2833653   .0809249     3.50   0.001     .1217935    .4449372
         34  |  -.0079287   .0321584    -0.25   0.806    -.0721351    .0562777
         35  |    .247975   .1494755     1.66   0.102    -.0504625    .5464125
         36  |   .1001558   .0566781     1.77   0.082    -.0130057    .2133172
         40  |   .1054472   .0662531     1.59   0.116    -.0268314    .2377258
             |
       _cons |   -.016938   .0713356    -0.24   0.813    -.1593641    .1254881
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
      pos10s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1054949   .0540269     1.95   0.055    -.0023733     .213363
------------------------------------------------------------------------------

. reg pos10s p12 p56 pbelief  stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/(pscore_1*nmodel)] ,
>   cluster(teamid);
(sum of wgt is 93.49361655574957)

Linear regression                               Number of obs     =      1,178
                                                F(15, 66)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1161
                                                Root MSE          =      .3144

                                (Std. err. adjusted for 67 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.1169218   .0712291    -1.64   0.105    -.2591353    .0252917
         p56 |   .0083784   .0602538     0.14   0.890    -.1119223     .128679
     pbelief |   .0041937   .0512743     0.08   0.935    -.0981788    .1065661
   stats_brw |   .0136673   .0190175     0.72   0.475    -.0243025     .051637
   topic_brw |   -.019579   .0187761    -1.04   0.301    -.0570666    .0179086
          t2 |   .0636676   .0849913     0.75   0.456     -.106023    .2333583
          t3 |   .0417188   .0545913     0.76   0.447    -.0672762    .1507138
             |
     mdegree |
          2  |   .0325464   .0915885     0.36   0.723    -.1503159    .2154087
          3  |   .0311937    .039727     0.79   0.435    -.0481239    .1105113
          4  |   .2046902   .0733827     2.79   0.007     .0581769    .3512035
          5  |   .2701389   .1202698     2.25   0.028     .0300124    .5102653
          6  |  -.0056089   .0652207    -0.09   0.932    -.1358262    .1246084
         20  |   .0786338   .0891651     0.88   0.381    -.0993901    .2566577
         33  |   .2807316   .0854101     3.29   0.002     .1102048    .4512585
         34  |   .0124138   .0473308     0.26   0.794    -.0820851    .1069128
         35  |   .2554375   .1445595     1.77   0.082    -.0331848    .5440598
         36  |   .0347934    .043366     0.80   0.425    -.0517897    .1213765
         40  |   .0740718   .0458283     1.62   0.111    -.0174274    .1655709
             |
       _cons |  -.0457231   .0852996    -0.54   0.594    -.2160291     .124583
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
      pos10s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1253002    .063962     1.96   0.054    -.0024041    .2530045
------------------------------------------------------------------------------

. reg pos10s group1 group3 pbelief stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/(pscore_1*nmode
> l)] ,  cluster(teamid);
(sum of wgt is 93.49361655574957)

Linear regression                               Number of obs     =      1,178
                                                F(15, 66)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1177
                                                Root MSE          =      .3141

                                (Std. err. adjusted for 67 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.1275002   .0622256    -2.05   0.044    -.2517377   -.0032626
      group3 |   -.020998   .0622678    -0.34   0.737    -.1453197    .1033236
     pbelief |   .0064995   .0503439     0.13   0.898    -.0940153    .1070143
   stats_brw |   .0116061   .0191082     0.61   0.546    -.0265446    .0497568
   topic_brw |  -.0182701   .0181641    -1.01   0.318    -.0545358    .0179957
          t2 |   .0491207   .0731226     0.67   0.504    -.0968733    .1951146
          t3 |   .0387206   .0511918     0.76   0.452    -.0634871    .1409282
             |
     mdegree |
          2  |   .0012804   .0736029     0.02   0.986    -.1456725    .1482333
          3  |   .0235748   .0363259     0.65   0.519    -.0489522    .0961019
          4  |   .1983712   .0680652     2.91   0.005     .0624746    .3342678
          5  |   .2456628   .1151306     2.13   0.037     .0157972    .4755284
          6  |   -.024033   .0650999    -0.37   0.713    -.1540091    .1059432
         20  |   .0717503   .0878646     0.82   0.417     -.103677    .2471776
         33  |   .2777529   .0857292     3.24   0.002     .1065891    .4489167
         34  |   -.013498   .0491262    -0.27   0.784    -.1115816    .0845857
         35  |    .244049   .1507999     1.62   0.110    -.0570327    .5451308
         36  |   .0966775   .0590544     1.64   0.106    -.0212284    .2145833
         40  |   .1028614   .0667972     1.54   0.128    -.0305036    .2362264
             |
       _cons |  -.0138796   .0682679    -0.20   0.840    -.1501809    .1224218
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
      pos10s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1065021   .0547233     1.95   0.056    -.0027566    .2157608
------------------------------------------------------------------------------

. *RELATIONSHIP BETWEEN NEW MEASURE OF QUALITY OF RESEARCH AND PRO-IMMIGRATION INDEX;
. *NOTE THESE REGRESSIONS LOSE A FEW OBSERVATIONS BECAUSE PEER_MEAN IS NOT AVAILABLE FOR 38 OB
> SERVATIONS;
. summ quality2;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    quality2 |      1,215    .2271605    .4191697          0          1

. *WEIGHT ALSO BY PEER_N, NUMBER OF REVIEWERS THAT MODEL HAD;
. *NEW REFEREE SCORE MEASURE AS DEPENDENT VARIABLE;
. reg zpeer_mean p12 p56     stats_brw topic_brw t2 t3 i.mdegree  [aw=peer_n/nmodel] ,  cluste
> r(teamid);
(sum of wgt is 647.0125)

Linear regression                               Number of obs     =      1,215
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3250
                                                Root MSE          =     .86586

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
  zpeer_mean | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.9714526   .3744682    -2.59   0.012    -1.718306   -.2245993
         p56 |  -1.162185   .3330606    -3.49   0.001    -1.826454   -.4979169
   stats_brw |  -.2839056   .1035207    -2.74   0.008    -.4903712     -.07744
   topic_brw |   .2347752   .1148748     2.04   0.045     .0056646    .4638858
          t2 |  -.7029084   .3649609    -1.93   0.058      -1.4308    .0249831
          t3 |  -.0464912    .374486    -0.12   0.902    -.7933801    .7003976
             |
     mdegree |
          1  |  -3.756453   .5318257    -7.06   0.000    -4.817146    -2.69576
          2  |  -.9474463   .5801871    -1.63   0.107    -2.104593    .2097003
          3  |   -.924478    .289933    -3.19   0.002    -1.502731   -.3462249
          4  |  -.8382434    .469665    -1.78   0.079    -1.774961    .0984739
          5  |  -.9217533    .387705    -2.38   0.020    -1.695006   -.1485002
          6  |   -1.49584   .4346329    -3.44   0.001    -2.362688   -.6289922
         20  |  -.5368824    .516404    -1.04   0.302    -1.566818     .493053
         33  |  -1.025859   .4098736    -2.50   0.015    -1.843326   -.2083916
         34  |  -.7520685   .1543082    -4.87   0.000    -1.059827   -.4443104
         35  |  -.3253878   .3172985    -1.03   0.309    -.9582196     .307444
         36  |  -.6560276   .1907684    -3.44   0.001    -1.036503   -.2755521
         40  |   -1.59042   .2704602    -5.88   0.000    -2.129836   -1.051004
             |
       _cons |   1.952328   .5573289     3.50   0.001     .8407709    3.063886
------------------------------------------------------------------------------

. reg zpeer_mean group1 group3     stats_brw topic_brw t2 t3 i.mdegree   [aw=peer_n/nmodel] , 
>  cluster(teamid);
(sum of wgt is 647.0125)

Linear regression                               Number of obs     =      1,215
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2664
                                                Root MSE          =     .90262

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
  zpeer_mean | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.4349382   .2664985    -1.63   0.107    -.9664527    .0965763
      group3 |  -.6481386   .2560087    -2.53   0.014    -1.158732   -.1375454
   stats_brw |  -.2856609   .1016715    -2.81   0.006    -.4884383   -.0828835
   topic_brw |   .2950443   .1200307     2.46   0.016     .0556506     .534438
          t2 |  -.6917726   .3425085    -2.02   0.047    -1.374884   -.0086609
          t3 |   .2182218    .355763     0.61   0.542    -.4913251    .9277687
             |
     mdegree |
          1  |  -3.481448   .4931658    -7.06   0.000    -4.465036   -2.497859
          2  |  -.1123885    .432805    -0.26   0.796    -.9755908    .7508138
          3  |  -.6581722   .2733243    -2.41   0.019      -1.2033   -.1130441
          4  |   -.490127    .448945    -1.09   0.279     -1.38552    .4052656
          5  |  -.4490535   .3005919    -1.49   0.140    -1.048565    .1504581
          6  |  -1.064393   .4584404    -2.32   0.023    -1.978724   -.1500623
         20  |  -.1496891   .4772541    -0.31   0.755    -1.101542    .8021643
         33  |  -.6988368   .4528993    -1.54   0.127    -1.602116    .2044424
         34  |   -.598207   .1689285    -3.54   0.001    -.9351244   -.2612897
         35  |  -.1250375   .2816495    -0.44   0.658    -.6867697    .4366946
         36  |  -.4323779   .2994506    -1.44   0.153    -1.029613    .1648575
         40  |  -1.200167   .3183699    -3.77   0.000    -1.835136   -.5651982
             |
       _cons |   1.168493   .4171776     2.80   0.007     .3364581    2.000527
------------------------------------------------------------------------------

. *QUALITY MODELS LOSE A LOT OF SINGLETON OBSERVATIONS IF WE USE LOGIT;
. *SO WILL DO LINEAR PROBABILITY MODEL INSTEAD;
. *OLS MODELS ON HIGH quality2;
. reg quality2 p12 p56     stats_brw topic_brw t2 t3 i.mdegree   [aw=peer_n/nmodel] , cluster(
> teamid);
(sum of wgt is 647.0125)

Linear regression                               Number of obs     =      1,215
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3040
                                                Root MSE          =     .38857

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
    quality2 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.4972039   .2619605    -1.90   0.062    -1.019668    .0252599
         p56 |  -.4670665   .1636317    -2.85   0.006    -.7934196   -.1407135
   stats_brw |   -.099628   .0589207    -1.69   0.095    -.2171417    .0178857
   topic_brw |   .0251877   .0521672     0.48   0.631    -.0788565    .1292318
          t2 |  -.2322691   .2196477    -1.06   0.294    -.6703427    .2058044
          t3 |   .0397394   .2259301     0.18   0.861    -.4108639    .4903428
             |
     mdegree |
          1  |  -1.205899    .259094    -4.65   0.000    -1.722646    -.689152
          2  |  -.4093724   .3321878    -1.23   0.222      -1.0719    .2531552
          3  |  -.7229027   .1264743    -5.72   0.000    -.9751477   -.4706578
          4  |  -.7026546   .1856194    -3.79   0.000    -1.072861   -.3324484
          5  |  -.7383678   .2145582    -3.44   0.001    -1.166291   -.3104449
          6  |  -1.101474   .2190743    -5.03   0.000    -1.538404   -.6645436
         20  |  -.7095437   .1839414    -3.86   0.000    -1.076403   -.3426841
         33  |  -.7115517   .2116562    -3.36   0.001    -1.133687   -.2894167
         34  |  -.7177271   .1134924    -6.32   0.000    -.9440805   -.4913736
         35  |  -.4617273   .2389516    -1.93   0.057    -.9383013    .0148466
         36  |   -1.06427   .1115516    -9.54   0.000    -1.286753   -.8417878
         40  |  -1.042176   .1220097    -8.54   0.000    -1.285517   -.7988357
             |
       _cons |   1.404628   .3049102     4.61   0.000     .7965039    2.012752
------------------------------------------------------------------------------

. reg quality2 group1 group3     stats_brw topic_brw t2 t3 i.mdegree   [aw=peer_n/nmodel] , cl
> uster(teamid);
(sum of wgt is 647.0125)

Linear regression                               Number of obs     =      1,215
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2659
                                                Root MSE          =     .39905

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
    quality2 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.3030888   .1974538    -1.53   0.129    -.6968979    .0907203
      group3 |  -.2945444   .1193587    -2.47   0.016    -.5325978    -.056491
   stats_brw |  -.1026881   .0602879    -1.70   0.093    -.2229286    .0175524
   topic_brw |   .0495604   .0477998     1.04   0.303    -.0457732    .1448941
          t2 |  -.2457261   .2114129    -1.16   0.249    -.6673757    .1759236
          t3 |    .145201   .2099938     0.69   0.492    -.2736185    .5640205
             |
     mdegree |
          1  |  -1.115661   .2554425    -4.37   0.000    -1.625125   -.6061974
          2  |  -.1087544   .2615977    -0.42   0.679    -.6304946    .4129859
          3  |  -.6199228   .1260347    -4.92   0.000     -.871291   -.3685546
          4  |  -.5695603   .1796946    -3.17   0.002    -.9279499   -.2111706
          5  |  -.5719548    .192606    -2.97   0.004    -.9560953   -.1878143
          6  |  -.9515151     .16656    -5.71   0.000    -1.283709   -.6193215
         20  |  -.5620014   .2113219    -2.66   0.010    -.9834695   -.1405332
         33  |   -.592559   .2147675    -2.76   0.007    -1.020899   -.1642188
         34  |  -.6856508   .1289963    -5.32   0.000    -.9429258   -.4283757
         35  |  -.4056538    .209425    -1.94   0.057    -.8233388    .0120312
         36  |  -.9137202   .2032878    -4.49   0.000    -1.319165   -.5082754
         40  |  -.8716003   .1230761    -7.08   0.000    -1.117068   -.6261327
             |
       _cons |   1.124103   .2370345     4.74   0.000     .6513523    1.596853
------------------------------------------------------------------------------

. *USING MEDIAN;
. generate y1=att1;
(75 missing values generated)

. generate y2=att2;
(685 missing values generated)

. generate y3=att3;
(290 missing values generated)

. gen median = y1 + y2 + y3 - min(y1, y2, y3) - max(y1, y2, y3);
(739 missing values generated)

. replace median = max(y1, y2, y3) if 
>         (missing(y1) + missing(y2) + missing(y3)) == 2 ;
(309 real changes made)

. replace median = (         cond(missing(y1), 0, y1) + 
>         cond(missing(y2), 0, y2) + 
>         cond(missing(y3), 0, y3) ) / 2 
>         if (missing(y1) + missing(y2) + missing(y3)) == 1       ;
(429 real changes made)

. * For later loading;
. save "$workd/data/newmodel.dta", replace;
file /GitHub/ideology_specification/data/newmodel.dta saved

. log close;
      name:  <unnamed>
       log:  C:/GitHub/ideology_specification/code/Log Files/02_Main_Regs.log
  log type:  text
 closed on:  30 Aug 2025, 11:36:05
----------------------------------------------------------------------------------------------
