--------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/GitHub/ideology_specification/code/Log Files/03_Regressions.log
  log type:  text
 opened on:  11 Dec 2024, 10:42:10

. clear matrix;

. clear mata;

. use "$workd/data/df.dta", clear;

. ***************************************************************************;
. *ALL REGRESSIONS WILL BE WEIGHTED BY 1/NMODEL SO THEY ARE NUMERICALLY EQUIVALENT TO TEAM LEVEL R
> EGRESSIONS;
. *WILL LEAVE OUT PMALE FROM ALL REGRESSIONS;
. *WILL INCLUDE TEAM_SIZE IN THE REFEREE SCORE, QUALITY REGRESSIONS;
. reg ame  proindex    stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0617
                                                Root MSE          =     .19878

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0108737   .0056998     1.91   0.061    -.0004943    .0222416
   stats_brw |   .0384442   .0176848     2.17   0.033     .0031731    .0737154
   topic_brw |  -.0410347   .0168102    -2.44   0.017    -.0745616   -.0075078
          t2 |   .0093166   .0148151     0.63   0.531    -.0202313    .0388644
          t3 |    .012971    .023955     0.54   0.590    -.0348057    .0607477
             |
     mdegree |
          1  |   .4545994   .0506109     8.98   0.000     .3536592    .5555396
          2  |   .2734257   .0208276    13.13   0.000     .2318864    .3149651
          3  |   .2742735   .0197721    13.87   0.000     .2348392    .3137077
          4  |   .2734748   .0198543    13.77   0.000     .2338766     .313073
          5  |   .3211411   .0343558     9.35   0.000     .2526206    .3896615
          6  |   .2508457   .0218756    11.47   0.000     .2072162    .2944751
         20  |   .2775809   .0320121     8.67   0.000     .2137348    .3414271
         33  |   .2778045   .0274814    10.11   0.000     .2229947    .3326143
         34  |   .2877794   .0198662    14.49   0.000     .2481574    .3274014
         35  |   .1854928    .074674     2.48   0.015     .0365602    .3344255
         36  |   .2727957   .0187552    14.55   0.000     .2353896    .3102018
         40  |   .2540658   .0402514     6.31   0.000     .1737869    .3343448
             |
       _cons |  -.3348635    .027718   -12.08   0.000    -.3901454   -.2795817
------------------------------------------------------------------------------

. reg ame  p12 p56    stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0648
                                                Root MSE          =     .19853

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0503799   .0252584    -1.99   0.050    -.1007562   -3.69e-06
         p56 |   .0234775   .0193443     1.21   0.229    -.0151034    .0620584
   stats_brw |    .037143   .0166456     2.23   0.029     .0039445    .0703415
   topic_brw |  -.0418866   .0165861    -2.53   0.014    -.0749666   -.0088066
          t2 |   .0011216   .0162283     0.07   0.945    -.0312447    .0334879
          t3 |   .0087989   .0224903     0.39   0.697    -.0360565    .0536543
             |
     mdegree |
          1  |   .4764457    .058257     8.18   0.000     .3602557    .5926357
          2  |   .2592396   .0291878     8.88   0.000     .2010265    .3174528
          3  |   .2730058   .0203962    13.39   0.000     .2323269    .3136846
          4  |   .2712758    .019403    13.98   0.000     .2325777    .3099739
          5  |   .3222416   .0299225    10.77   0.000      .262563    .3819201
          6  |   .2516072   .0224161    11.22   0.000     .2068996    .2963148
         20  |   .2742799   .0338085     8.11   0.000     .2068511    .3417088
         33  |   .2751979   .0261161    10.54   0.000      .223111    .3272847
         34  |   .2847723   .0215027    13.24   0.000     .2418866     .327658
         35  |   .1800135   .0745509     2.41   0.018     .0313264    .3287007
         36  |   .2812386   .0133591    21.05   0.000     .2545947    .3078825
         40  |   .2544392   .0381109     6.68   0.000     .1784294    .3304489
             |
       _cons |   -.289131   .0262677   -11.01   0.000    -.3415202   -.2367418
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0738574   .0242554     3.04   0.003     .0254815    .1222334
------------------------------------------------------------------------------

. reg ame  group3    stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0661
                                                Root MSE          =     .19832

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |   .0400274   .0158054     2.53   0.014     .0085044    .0715503
   stats_brw |   .0366518   .0162719     2.25   0.027     .0041984    .0691051
   topic_brw |  -.0397766   .0154963    -2.57   0.012    -.0706829   -.0088703
          t2 |   .0240041   .0153349     1.57   0.122    -.0065805    .0545887
          t3 |   .0152444   .0221752     0.69   0.494    -.0289826    .0594714
             |
     mdegree |
          1  |     .44895   .0562755     7.98   0.000     .3367121    .5611879
          2  |   .2841817   .0217026    13.09   0.000     .2408972    .3274663
          3  |   .2718073    .022274    12.20   0.000     .2273833    .3162314
          4  |   .2728777   .0193381    14.11   0.000     .2343091    .3114464
          5  |   .3293892   .0305213    10.79   0.000     .2685162    .3902621
          6  |   .2677352   .0246948    10.84   0.000     .2184829    .3169874
         20  |   .2726566   .0376655     7.24   0.000      .197535    .3477781
         33  |   .2852015   .0236278    12.07   0.000     .2380774    .3323256
         34  |   .2822144   .0168685    16.73   0.000     .2485712    .3158576
         35  |   .1885997    .062192     3.03   0.003     .0645617    .3126376
         36  |   .2887058    .015035    19.20   0.000     .2587195    .3186922
         40  |   .2671305    .040801     6.55   0.000     .1857555    .3485056
             |
       _cons |  -.3123935   .0230896   -13.53   0.000    -.3584442   -.2663428
------------------------------------------------------------------------------

. reg ame  group1 group3    stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  cluster(teamid)
> ;
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0710
                                                Root MSE          =     .19788

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0572476   .0306365    -1.87   0.066    -.1183502    .0038549
      group3 |   .0272754   .0147459     1.85   0.069    -.0021343    .0566851
   stats_brw |   .0341011   .0156414     2.18   0.033     .0029053     .065297
   topic_brw |  -.0406176   .0155892    -2.61   0.011    -.0717092    -.009526
          t2 |   .0063886   .0160686     0.40   0.692    -.0256592    .0384365
          t3 |   .0079756   .0229581     0.35   0.729    -.0378128     .053764
             |
     mdegree |
          1  |   .4781822   .0593708     8.05   0.000     .3597709    .5965935
          2  |   .2632302   .0264194     9.96   0.000     .2105383     .315922
          3  |   .2761151   .0200568    13.77   0.000     .2361131    .3161171
          4  |   .2729049   .0187597    14.55   0.000     .2354899    .3103199
          5  |   .3308497   .0292276    11.32   0.000     .2725571    .3891424
          6  |    .260214    .024832    10.48   0.000     .2106882    .3097399
         20  |   .2746755   .0345734     7.94   0.000      .205721      .34363
         33  |   .2877058    .026143    11.01   0.000     .2355652    .3398464
         34  |   .2763302   .0143112    19.31   0.000     .2477874     .304873
         35  |   .1839868   .0675415     2.72   0.008     .0492795    .3186942
         36  |   .3356711   .0298616    11.24   0.000      .276114    .3952282
         40  |   .2824761   .0246236    11.47   0.000      .233366    .3315862
             |
       _cons |  -.2928377   .0268678   -10.90   0.000    -.3464238   -.2392515
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |    .084523    .031027     2.72   0.008     .0226417    .1464043
------------------------------------------------------------------------------

. *ADDING BELIEF;
. reg ame  proindex pbelief  stats_brw topic_brw t2 t3 i.mdegree    [aw=1/nmodel] ,  cluster(teami
> d);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0624
                                                Root MSE          =     .19879

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0113848   .0055162     2.06   0.043     .0003831    .0223865
     pbelief |  -.0154633   .0153958    -1.00   0.319    -.0461692    .0152425
   stats_brw |   .0381325     .01731     2.20   0.031     .0036089    .0726561
   topic_brw |  -.0413342   .0166233    -2.49   0.015    -.0744883   -.0081801
          t2 |    .011424   .0136359     0.84   0.405    -.0157719    .0386198
          t3 |    .014834   .0240947     0.62   0.540    -.0332213    .0628893
             |
     mdegree |
          1  |   .4728694   .0609936     7.75   0.000     .3512215    .5945172
          2  |   .2765242    .019777    13.98   0.000     .2370801    .3159683
          3  |   .2843993   .0233639    12.17   0.000     .2378016    .3309971
          4  |   .2812742   .0215197    13.07   0.000     .2383545    .3241938
          5  |   .3389768   .0342148     9.91   0.000     .2707376     .407216
          6  |   .2570401   .0228378    11.26   0.000     .2114916    .3025887
         20  |   .2857246   .0349241     8.18   0.000     .2160706    .3553785
         33  |   .2875518    .025811    11.14   0.000     .2360735    .3390301
         34  |   .3004199   .0242248    12.40   0.000     .2521051    .3487347
         35  |   .1942942   .0758132     2.56   0.013     .0430895    .3454989
         36  |   .2846501   .0148766    19.13   0.000     .2549796    .3143207
         40  |    .262948   .0412183     6.38   0.000     .1807407    .3451553
             |
       _cons |  -.3398345   .0270176   -12.58   0.000    -.3937195   -.2859496
------------------------------------------------------------------------------

. reg ame  p12 p56  pbelief  stats_brw topic_brw t2 t3 i.mdegree    [aw=1/nmodel] ,  cluster(teami
> d);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(15, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0652
                                                Root MSE          =     .19857

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0479692   .0245364    -1.96   0.055    -.0969054     .000967
         p56 |   .0248227   .0193319     1.28   0.203    -.0137335    .0633789
     pbelief |  -.0121928   .0156684    -0.78   0.439    -.0434424    .0190569
   stats_brw |   .0369708   .0164024     2.25   0.027     .0042573    .0696844
   topic_brw |  -.0420345   .0163983    -2.56   0.013    -.0747399   -.0093292
          t2 |   .0035046   .0149906     0.23   0.816    -.0263931    .0334023
          t3 |    .010861   .0230491     0.47   0.639     -.035109    .0568309
             |
     mdegree |
          1  |   .4890379   .0674258     7.25   0.000     .3545614    .6235144
          2  |   .2624987   .0286902     9.15   0.000      .205278    .3197194
          3  |   .2807249   .0248409    11.30   0.000     .2311813    .3302685
          4  |   .2774102   .0220001    12.61   0.000     .2335324     .321288
          5  |   .3359848   .0321004    10.47   0.000     .2719625    .4000072
          6  |   .2568645   .0244863    10.49   0.000     .2080281    .3057009
         20  |    .280535   .0373247     7.52   0.000     .2060931    .3549768
         33  |   .2827401   .0254664    11.10   0.000     .2319489    .3335312
         34  |   .2944574   .0265708    11.08   0.000     .2414636    .3474512
         35  |   .1869026   .0755531     2.47   0.016     .0362167    .3375886
         36  |   .2896507   .0125191    23.14   0.000     .2646821    .3146193
         40  |     .26119   .0400122     6.53   0.000     .1813881    .3409919
             |
       _cons |  -.2925625   .0268072   -10.91   0.000    -.3460277   -.2390973
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0727919   .0239089     3.04   0.003      .025107    .1204768
------------------------------------------------------------------------------

. reg ame  group3  pbelief  stats_brw topic_brw t2 t3 i.mdegree    [aw=1/nmodel] ,  cluster(teamid
> );
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0668
                                                Root MSE          =     .19832

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |   .0410243   .0160921     2.55   0.013     .0089296     .073119
     pbelief |  -.0163775   .0158075    -1.04   0.304    -.0479045    .0151496
   stats_brw |   .0363352   .0158764     2.29   0.025     .0046707    .0679998
   topic_brw |  -.0401176   .0152811    -2.63   0.011    -.0705947   -.0096405
          t2 |   .0266627   .0143464     1.86   0.067    -.0019504    .0552757
          t3 |   .0173014   .0222383     0.78   0.439    -.0270515    .0616542
             |
     mdegree |
          1  |   .4672403   .0669188     6.98   0.000     .3337749    .6007057
          2  |   .2868986   .0212988    13.47   0.000     .2444195    .3293777
          3  |   .2820393   .0267071    10.56   0.000     .2287738    .3353049
          4  |   .2806987   .0220032    12.76   0.000     .2368147    .3245827
          5  |   .3476591   .0345408    10.07   0.000     .2787697    .4165485
          6  |   .2742213   .0264415    10.37   0.000     .2214853    .3269572
         20  |   .2807247   .0409274     6.86   0.000     .1990976    .3623517
         33  |   .2951953   .0250386    11.79   0.000     .2452574    .3451332
         34  |   .2950355   .0238487    12.37   0.000     .2474708    .3426002
         35  |   .1975086    .063808     3.10   0.003     .0702477    .3247696
         36  |   .3009891    .016844    17.87   0.000     .2673947    .3345835
         40  |   .2761751   .0434972     6.35   0.000     .1894227    .3629276
             |
       _cons |  -.3154865   .0235283   -13.41   0.000    -.3624122   -.2685609
------------------------------------------------------------------------------

. reg ame  group1 group3  pbelief  stats_brw topic_brw t2 t3 i.mdegree    [aw=1/nmodel] ,  cluster
> (teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(15, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0713
                                                Root MSE          =     .19792

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0552946    .031184    -1.77   0.081    -.1174892    .0068999
      group3 |   .0283834   .0151864     1.87   0.066    -.0019049    .0586718
     pbelief |  -.0110571   .0163631    -0.68   0.501    -.0436923    .0215781
   stats_brw |   .0339745   .0154449     2.20   0.031     .0031705    .0647784
   topic_brw |  -.0408192   .0154994    -2.63   0.010    -.0717317   -.0099066
          t2 |   .0087845   .0155369     0.57   0.574    -.0222029    .0397719
          t3 |   .0096123   .0237473     0.40   0.687    -.0377503    .0569749
             |
     mdegree |
          1  |   .4895336    .068765     7.12   0.000     .3523862    .6266809
          2  |   .2657792   .0270472     9.83   0.000     .2118352    .3197232
          3  |   .2828762   .0259431    10.90   0.000     .2311343    .3346181
          4  |   .2781842   .0223365    12.45   0.000     .2336355    .3227329
          5  |   .3431347   .0345109     9.94   0.000      .274305    .4119645
          6  |   .2648497   .0280925     9.43   0.000      .208821    .3208783
         20  |   .2800538   .0385478     7.27   0.000     .2031727    .3569348
         33  |   .2943676     .02654    11.09   0.000     .2414352       .3473
         34  |    .285187   .0220677    12.92   0.000     .2411744    .3291996
         35  |    .190159    .068551     2.77   0.007     .0534384    .3268796
         36  |   .3423618   .0306289    11.18   0.000     .2812745    .4034492
         40  |    .288059   .0272466    10.57   0.000     .2337173    .3424007
             |
       _cons |   -.295593   .0282945   -10.45   0.000    -.3520247   -.2391614
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0836781   .0313824     2.67   0.010     .0210879    .1462683
------------------------------------------------------------------------------

. ***************************************************************************;
. *WEIGHTED REGRESSIONS USING PSCORE/NMODEL;
. *WEIGHTING BY QUALITY HELPS ADDRESS PUBLICATION BIAS PROBLEM;
. reg ame  proindex    stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel] ,  cluster(teamid)
> ;
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0631
                                                Root MSE          =     .20018

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0113823    .005618     2.03   0.047     .0001776    .0225871
   stats_brw |   .0391653   .0181567     2.16   0.034     .0029529    .0753776
   topic_brw |  -.0414328    .017194    -2.41   0.019    -.0757251   -.0071404
          t2 |   .0087255   .0146966     0.59   0.555    -.0205859    .0380369
          t3 |   .0119852   .0246031     0.49   0.628    -.0370841    .0610544
             |
     mdegree |
          1  |   .4575084   .0520426     8.79   0.000     .3537127     .561304
          2  |    .273634   .0211764    12.92   0.000      .231399    .3158689
          3  |   .2734949   .0210531    12.99   0.000     .2315059    .3154839
          4  |   .2703089   .0198575    13.61   0.000     .2307043    .3099135
          5  |   .3236678    .035149     9.21   0.000     .2535654    .3937703
          6  |   .2509542    .023532    10.66   0.000     .2040211    .2978872
         20  |   .2786136   .0329363     8.46   0.000     .2129241     .344303
         33  |   .2737398   .0245488    11.15   0.000     .2247788    .3227008
         34  |   .2888588   .0206671    13.98   0.000     .2476396     .330078
         35  |   .1780349   .0740114     2.41   0.019     .0304238     .325646
         36  |   .2734497   .0179724    15.21   0.000     .2376048    .3092946
         40  |   .2599358   .0397411     6.54   0.000     .1806747     .339197
             |
       _cons |  -.3367484    .026792   -12.57   0.000    -.3901834   -.2833134
------------------------------------------------------------------------------

. reg ame  p12 p56    stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0666
                                                Root MSE          =     .19989

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0516617   .0261416    -1.98   0.052    -.1037995    .0004762
         p56 |   .0259294   .0193446     1.34   0.184    -.0126521     .064511
   stats_brw |     .03755    .017038     2.20   0.031     .0035689    .0715311
   topic_brw |  -.0419997   .0167832    -2.50   0.015    -.0754728   -.0085266
          t2 |   .0001315   .0161841     0.01   0.994    -.0321467    .0324098
          t3 |   .0080016   .0233349     0.34   0.733    -.0385384    .0545415
             |
     mdegree |
          1  |   .4805021   .0595689     8.07   0.000     .3616956    .5993086
          2  |   .2608113   .0289467     9.01   0.000     .2030788    .3185437
          3  |   .2730819    .021381    12.77   0.000     .2304389    .3157249
          4  |   .2689926   .0191167    14.07   0.000     .2308654    .3071197
          5  |   .3261398   .0300943    10.84   0.000     .2661185    .3861611
          6  |   .2533505   .0233359    10.86   0.000     .2068085    .2998925
         20  |   .2760177   .0346695     7.96   0.000     .2068716    .3451637
         33  |   .2721161   .0232172    11.72   0.000     .2258109    .3184214
         34  |   .2861176    .022347    12.80   0.000     .2415479    .3306874
         35  |   .1731348   .0737648     2.35   0.022     .0260155    .3202541
         36  |   .2829707    .013312    21.26   0.000     .2564207    .3095207
         40  |    .261034   .0383023     6.82   0.000     .1846426    .3374255
             |
       _cons |   -.290692   .0263835   -11.02   0.000    -.3433123   -.2380718
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0775911    .026312     2.95   0.004     .0251135    .1300687
------------------------------------------------------------------------------

. reg ame  group3    stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0681
                                                Root MSE          =     .19965

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |   .0425567   .0161913     2.63   0.011     .0102641    .0748492
   stats_brw |   .0371753   .0166199     2.24   0.028     .0040279    .0703227
   topic_brw |  -.0400893   .0157721    -2.54   0.013    -.0715457   -.0086329
          t2 |   .0237072   .0155839     1.52   0.133    -.0073739    .0547883
          t3 |   .0144569   .0227108     0.64   0.526    -.0308385    .0597522
             |
     mdegree |
          1  |   .4520275   .0571492     7.91   0.000      .338047    .5660079
          2  |   .2856604   .0218783    13.06   0.000     .2420254    .3292953
          3  |   .2720781    .023606    11.53   0.000     .2249974    .3191588
          4  |   .2700212    .018722    14.42   0.000     .2326813    .3073611
          5  |   .3329414   .0311552    10.69   0.000     .2708042    .3950785
          6  |    .270186   .0257111    10.51   0.000     .2189068    .3214652
         20  |   .2737801   .0387783     7.06   0.000     .1964393    .3511209
         33  |   .2831327   .0212578    13.32   0.000     .2407354    .3255299
         34  |   .2827972   .0173193    16.33   0.000      .248255    .3173395
         35  |   .1830432   .0610361     3.00   0.004     .0613105    .3047758
         36  |   .2908544    .014531    20.02   0.000     .2618732    .3198357
         40  |   .2743366   .0407135     6.74   0.000     .1931361     .355537
             |
       _cons |  -.3140019   .0234006   -13.42   0.000     -.360673   -.2673308
------------------------------------------------------------------------------

. reg ame  group1 group3    stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel] ,  cluster(te
> amid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0739
                                                Root MSE          =     .19911

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0612237   .0335927    -1.82   0.073    -.1282222    .0057748
      group3 |   .0289914   .0145722     1.99   0.051     -.000072    .0580549
   stats_brw |   .0339442   .0157978     2.15   0.035     .0024366    .0654519
   topic_brw |  -.0407224   .0158489    -2.57   0.012    -.0723322   -.0091127
          t2 |   .0048151   .0162263     0.30   0.768    -.0275472    .0371774
          t3 |   .0073001   .0234384     0.31   0.756    -.0394462    .0540465
             |
     mdegree |
          1  |   .4826737   .0606109     7.96   0.000     .3617891    .6035582
          2  |   .2641638   .0268537     9.84   0.000     .2106058    .3177219
          3  |   .2773822   .0205898    13.47   0.000     .2363171    .3184474
          4  |   .2706116   .0180237    15.01   0.000     .2346644    .3065587
          5  |    .335401   .0292041    11.48   0.000     .2771553    .3936468
          6  |   .2626786   .0257244    10.21   0.000     .2113729    .3139843
         20  |   .2766724   .0349883     7.91   0.000     .2068904    .3464545
         33  |   .2860567   .0247775    11.55   0.000     .2366395    .3354739
         34  |   .2763643     .01433    19.29   0.000     .2477841    .3049445
         35  |   .1778665   .0667929     2.66   0.010     .0446524    .3110807
         36  |    .341529    .032623    10.47   0.000     .2764644    .4065935
         40  |   .2877489    .023661    12.16   0.000     .2405585    .3349392
             |
       _cons |  -.2939027   .0274166   -10.72   0.000    -.3485835    -.239222
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0902151   .0340102     2.65   0.010      .022384    .1580462
------------------------------------------------------------------------------

. *ADDING BELIEF;
. reg ame  proindex  pbelief  stats_brw topic_brw t2 t3 i.mdegree    [aw=pscore/nmodel] ,  cluster
> (teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0639
                                                Root MSE          =     .20017

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0120401   .0054301     2.22   0.030     .0012101    .0228701
     pbelief |  -.0173951   .0153183    -1.14   0.260    -.0479464    .0131563
   stats_brw |    .038885   .0177739     2.19   0.032      .003436     .074334
   topic_brw |  -.0418756   .0169819    -2.47   0.016     -.075745   -.0080062
          t2 |   .0109059   .0134332     0.81   0.420    -.0158857    .0376976
          t3 |   .0141268   .0246477     0.57   0.568    -.0350315    .0632852
             |
     mdegree |
          1  |   .4785775   .0625944     7.65   0.000     .3537368    .6034181
          2  |   .2773188    .020071    13.82   0.000     .2372884    .3173491
          3  |   .2853061   .0245312    11.63   0.000     .2363801    .3342321
          4  |   .2796856   .0217112    12.88   0.000      .236384    .3229873
          5  |   .3439632   .0349959     9.83   0.000     .2741661    .4137603
          6  |   .2579976   .0243128    10.61   0.000     .2095072    .3064881
         20  |   .2879936   .0357669     8.05   0.000     .2166587    .3593284
         33  |   .2844977   .0227971    12.48   0.000     .2390303    .3299651
         34  |   .3031724   .0252029    12.03   0.000     .2529069    .3534379
         35  |   .1878002   .0752185     2.50   0.015     .0377817    .3378187
         36  |   .2869438    .014121    20.32   0.000     .2587803    .3151072
         40  |   .2703581   .0412354     6.56   0.000     .1881167    .3525995
             |
       _cons |  -.3428605     .02611   -13.13   0.000    -.3949351   -.2907858
------------------------------------------------------------------------------

. reg ame  p12 p56  pbelief  stats_brw topic_brw t2 t3 i.mdegree    [aw=pscore/nmodel] ,  cluster(
> teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(15, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0672
                                                Root MSE          =     .19991

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0491459   .0254439    -1.93   0.057    -.0998922    .0016003
         p56 |   .0275696   .0194101     1.42   0.160    -.0111426    .0662817
     pbelief |  -.0143784   .0156759    -0.92   0.362    -.0456431    .0168863
   stats_brw |   .0374182   .0167943     2.23   0.029      .003923    .0709134
   topic_brw |  -.0422827   .0165781    -2.55   0.013    -.0753466   -.0092188
          t2 |   .0027065   .0149002     0.18   0.856    -.0270111     .032424
          t3 |   .0104075   .0237445     0.44   0.663    -.0369494    .0577645
             |
     mdegree |
          1  |    .495847   .0690125     7.18   0.000     .3582058    .6334881
          2  |   .2645851   .0284117     9.31   0.000     .2079196    .3212505
          3  |   .2824817   .0259012    10.91   0.000     .2308234    .3341399
          4  |   .2766577   .0220411    12.55   0.000     .2326981    .3206174
          5  |   .3424133   .0324433    10.55   0.000     .2777071    .4071194
          6  |   .2595566   .0253658    10.23   0.000     .2089662     .310147
         20  |   .2835078   .0381262     7.44   0.000     .2074676    .3595481
         33  |   .2807699   .0228377    12.29   0.000     .2352216    .3263183
         34  |   .2975513    .027571    10.79   0.000     .2425627    .3525399
         35  |   .1810624   .0748965     2.42   0.018     .0316861    .3304387
         36  |   .2930011   .0127768    22.93   0.000     .2675185    .3184837
         40  |   .2693542   .0408887     6.59   0.000     .1878042    .3509042
             |
       _cons |  -.2947434   .0269483   -10.94   0.000      -.34849   -.2409968
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0767155   .0258925     2.96   0.004     .0250744    .1283565
------------------------------------------------------------------------------

. reg ame  group3  pbelief  stats_brw topic_brw t2 t3 i.mdegree    [aw=pscore/nmodel] ,  cluster(t
> eamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0690
                                                Root MSE          =     .19964

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |   .0436266   .0165119     2.64   0.010     .0106947    .0765584
     pbelief |  -.0178794   .0158854    -1.13   0.264    -.0495619     .013803
   stats_brw |   .0369251   .0162347     2.27   0.026      .004546    .0693042
   topic_brw |  -.0405919   .0155495    -2.61   0.011    -.0716045   -.0095793
          t2 |    .026386   .0145586     1.81   0.074    -.0026502    .0554221
          t3 |   .0167254   .0226732     0.74   0.463    -.0284948    .0619456
             |
     mdegree |
          1  |    .472197   .0677708     6.97   0.000     .3370323    .6073617
          2  |   .2885144   .0214284    13.46   0.000     .2457768     .331252
          3  |   .2835335   .0279763    10.13   0.000     .2277366    .3393305
          4  |   .2790169   .0218515    12.77   0.000     .2354355    .3225983
          5  |   .3528133    .035248    10.01   0.000     .2825133    .4231133
          6  |   .2771664   .0274406    10.10   0.000     .2224378     .331895
         20  |   .2826643    .041993     6.73   0.000     .1989119    .3664167
         33  |   .2936537   .0230653    12.73   0.000     .2476514     .339656
         34  |    .296744   .0243395    12.19   0.000     .2482004    .3452876
         35  |   .1924869   .0627671     3.07   0.003     .0673019     .317672
         36  |   .3041954   .0169674    17.93   0.000     .2703551    .3380358
         40  |   .2844301   .0439284     6.47   0.000     .1968177    .3720426
             |
       _cons |  -.3173531   .0238121   -13.33   0.000    -.3648448   -.2698613
------------------------------------------------------------------------------

. reg ame  group1 group3  pbelief  stats_brw topic_brw t2 t3 i.mdegree    [aw=pscore/nmodel] ,  cl
> uster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(15, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0743
                                                Root MSE          =     .19914

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0592232   .0341456    -1.73   0.087    -.1273244     .008878
      group3 |   .0301744   .0150478     2.01   0.049     .0001626    .0601862
     pbelief |  -.0123609   .0164856    -0.75   0.456    -.0452404    .0205186
   stats_brw |   .0338768   .0156225     2.17   0.034     .0027187     .065035
   topic_brw |  -.0410492   .0157788    -2.60   0.011     -.072519   -.0095794
          t2 |   .0072843   .0156463     0.47   0.643    -.0239213    .0384899
          t3 |   .0091023   .0241503     0.38   0.707    -.0390639    .0572685
             |
     mdegree |
          1  |   .4956165   .0701136     7.07   0.000     .3557793    .6354537
          2  |   .2668394   .0274094     9.74   0.000     .2121731    .3215056
          3  |   .2851286   .0268084    10.64   0.000     .2316609    .3385963
          4  |   .2768115   .0221652    12.49   0.000     .2326044    .3210185
          5  |   .3490591   .0347041    10.06   0.000     .2798439    .4182743
          6  |   .2677498   .0290275     9.22   0.000     .2098563    .3256433
         20  |     .28272   .0389713     7.25   0.000     .2049941    .3604459
         33  |   .2932348   .0251859    11.64   0.000     .2430032    .3434665
         34  |   .2862166   .0221434    12.93   0.000     .2420529    .3303803
         35  |   .1845646   .0678749     2.72   0.008     .0491925    .3199367
         36  |   .3490965   .0337334    10.35   0.000     .2818173    .4163756
         40  |   .2942888   .0267985    10.98   0.000     .2408409    .3477368
             |
       _cons |  -.2968763   .0287884   -10.31   0.000    -.3542929   -.2394597
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0893976   .0343886     2.60   0.011     .0208117    .1579834
------------------------------------------------------------------------------

. *GETTING PERCENTILE DIFFERENCE BETWEEN PRO AND ANTI IMMIGRATION TEAMS;
. reg ame  group1 group3    stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  cluster(teamid)
> ;
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0710
                                                Root MSE          =     .19788

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0572476   .0306365    -1.87   0.066    -.1183502    .0038549
      group3 |   .0272754   .0147459     1.85   0.069    -.0021343    .0566851
   stats_brw |   .0341011   .0156414     2.18   0.033     .0029053     .065297
   topic_brw |  -.0406176   .0155892    -2.61   0.011    -.0717092    -.009526
          t2 |   .0063886   .0160686     0.40   0.692    -.0256592    .0384365
          t3 |   .0079756   .0229581     0.35   0.729    -.0378128     .053764
             |
     mdegree |
          1  |   .4781822   .0593708     8.05   0.000     .3597709    .5965935
          2  |   .2632302   .0264194     9.96   0.000     .2105383     .315922
          3  |   .2761151   .0200568    13.77   0.000     .2361131    .3161171
          4  |   .2729049   .0187597    14.55   0.000     .2354899    .3103199
          5  |   .3308497   .0292276    11.32   0.000     .2725571    .3891424
          6  |    .260214    .024832    10.48   0.000     .2106882    .3097399
         20  |   .2746755   .0345734     7.94   0.000      .205721      .34363
         33  |   .2877058    .026143    11.01   0.000     .2355652    .3398464
         34  |   .2763302   .0143112    19.31   0.000     .2477874     .304873
         35  |   .1839868   .0675415     2.72   0.008     .0492795    .3186942
         36  |   .3356711   .0298616    11.24   0.000      .276114    .3952282
         40  |   .2824761   .0246236    11.47   0.000      .233366    .3315862
             |
       _cons |  -.2928377   .0268678   -10.90   0.000    -.3464238   -.2392515
------------------------------------------------------------------------------

. predict rame, resid;

. xtile prame=rame [aw=1/nmodel], n(100);

. tabulate mdegree, gen(dum);

    mdegree |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         20        1.60        1.60
          1 |         12        0.96        2.55
          2 |         24        1.92        4.47
          3 |        537       42.86       47.33
          4 |        248       19.79       67.12
          5 |         52        4.15       71.27
          6 |         16        1.28       72.55
         20 |         79        6.30       78.85
         33 |        121        9.66       88.51
         34 |         60        4.79       93.30
         35 |         22        1.76       95.05
         36 |         24        1.92       96.97
         40 |         38        3.03      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. center stats_brw topic_brw t2 t3 dum* [aw=1/nmodel];
(generated variables: c_stats_brw c_topic_brw c_t2 c_t3 c_dum1 c_dum2 c_dum3 c_dum4 c_dum5 c_dum6 
> c_dum7 c_dum8 c_dum9 c_dum10 c_dum11 c_dum12 c_dum13)

. reg ame group1 group3 c_* [aw=1/nmodel], cluster(teamid);
(sum of wgt is 71)
note: c_dum12 omitted because of collinearity.

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0710
                                                Root MSE          =     .19788

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0572476   .0306365    -1.87   0.066    -.1183502    .0038549
      group3 |   .0272754   .0147459     1.85   0.069    -.0021343    .0566851
 c_stats_brw |   .0341011   .0156414     2.18   0.033     .0029053     .065297
 c_topic_brw |  -.0406176   .0155892    -2.61   0.011    -.0717092    -.009526
        c_t2 |   .0063886   .0160686     0.40   0.692    -.0256592    .0384365
        c_t3 |   .0079756   .0229581     0.35   0.729    -.0378128     .053764
      c_dum1 |  -.3356711   .0298616   -11.24   0.000    -.3952282    -.276114
      c_dum2 |   .1425111   .0597364     2.39   0.020     .0233707    .2616516
      c_dum3 |   -.072441   .0458547    -1.58   0.119    -.1638952    .0190133
      c_dum4 |   -.059556   .0413175    -1.44   0.154    -.1419611    .0228492
      c_dum5 |  -.0627662   .0395258    -1.59   0.117    -.1415979    .0160655
      c_dum6 |  -.0048214   .0390471    -0.12   0.902    -.0826983    .0730556
      c_dum7 |  -.0754571   .0441115    -1.71   0.092    -.1634347    .0125206
      c_dum8 |  -.0609956   .0488391    -1.25   0.216    -.1584021     .036411
      c_dum9 |  -.0479653   .0347715    -1.38   0.172    -.1173149    .0213842
     c_dum10 |  -.0593409   .0324739    -1.83   0.072    -.1241081    .0054263
     c_dum11 |  -.1516843   .0729891    -2.08   0.041    -.2972564   -.0061122
     c_dum12 |          0  (omitted)
     c_dum13 |   -.053195   .0229214    -2.32   0.023    -.0989103   -.0074797
       _cons |  -.0131605   .0101858    -1.29   0.201    -.0334754    .0071544
------------------------------------------------------------------------------

. reg ame group1 group2 group3 c_* [aw=1/nmodel], cluster(teamid) nocons;
(sum of wgt is 71)
note: c_dum12 omitted because of collinearity.

Linear regression                               Number of obs     =      1,253
                                                F(15, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0726
                                                Root MSE          =     .19788

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0704081   .0285362    -2.47   0.016    -.1273219   -.0134944
      group2 |  -.0131605   .0101858    -1.29   0.201    -.0334754    .0071544
      group3 |   .0141149   .0105315     1.34   0.184    -.0068895    .0351192
 c_stats_brw |   .0341011   .0156414     2.18   0.033     .0029053     .065297
 c_topic_brw |  -.0406176   .0155892    -2.61   0.011    -.0717092    -.009526
        c_t2 |   .0063886   .0160686     0.40   0.692    -.0256592    .0384365
        c_t3 |   .0079756   .0229581     0.35   0.729    -.0378128     .053764
      c_dum1 |  -.3356711   .0298616   -11.24   0.000    -.3952282    -.276114
      c_dum2 |   .1425111   .0597364     2.39   0.020     .0233707    .2616516
      c_dum3 |   -.072441   .0458547    -1.58   0.119    -.1638952    .0190133
      c_dum4 |   -.059556   .0413175    -1.44   0.154    -.1419611    .0228492
      c_dum5 |  -.0627662   .0395258    -1.59   0.117    -.1415979    .0160655
      c_dum6 |  -.0048214   .0390471    -0.12   0.902    -.0826983    .0730556
      c_dum7 |  -.0754571   .0441115    -1.71   0.092    -.1634347    .0125206
      c_dum8 |  -.0609956   .0488391    -1.25   0.216    -.1584021     .036411
      c_dum9 |  -.0479653   .0347715    -1.38   0.172    -.1173149    .0213842
     c_dum10 |  -.0593409   .0324739    -1.83   0.072    -.1241081    .0054263
     c_dum11 |  -.1516843   .0729891    -2.08   0.041    -.2972564   -.0061122
     c_dum12 |          0  (omitted)
     c_dum13 |   -.053195   .0229214    -2.32   0.023    -.0989103   -.0074797
------------------------------------------------------------------------------

. tabulate prame, sum(rame);

        100 |
  quantiles |        Summary of Residuals
   of rame  |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |  -.76756256   .23867965          10
          2 |   -.4824008   .07617804           9
          3 |  -.33042468   .03200516           9
          4 |  -.24835741   .02505569           8
          5 |  -.19126281   .01632189           9
          6 |  -.15822358   .00588541           5
          7 |  -.14128675   .00714974          13
          8 |   -.1225745   .00575249          12
          9 |  -.10575817   .00213788          11
         10 |  -.09820167   .00301477          14
         11 |  -.08990468   .00199053          13
         12 |  -.08427445    .0014953           7
         13 |   -.0808199    .0007172           7
         14 |  -.07773009   .00171315           6
         15 |  -.07408816   .00074352           7
         16 |  -.07045817   .00082252          13
         17 |  -.06639036   .00253799          19
         18 |  -.05875869   .00152034          15
         19 |  -.05548286   .00057293           9
         20 |  -.05146621   .00193321          22
         21 |  -.04790812   .00046006           9
         22 |  -.04712553   .00014294           5
         23 |  -.04559307   .00078294          23
         24 |  -.04373358   .00040909          10
         25 |  -.04187735   .00083057          24
         26 |  -.03992494   .00053663          20
         27 |  -.03799867   .00058451          11
         28 |  -.03643698   .00054553           7
         29 |  -.03317415   .00144974          10
         30 |  -.03128814   .00012419           4
         31 |  -.03029994   .00047662           9
         32 |  -.02794632   .00053876          11
         33 |  -.02678291    .0002137          11
         35 |   -.0257125   .00039612           8
         36 |   -.0246574   .00034159          12
         37 |  -.02367308   .00039213          12
         38 |  -.02175371   .00061211          10
         39 |   -.0204015   .00048026          16
         40 |  -.01835554   .00083539          15
         41 |  -.01623523   .00040689          10
         42 |  -.01490466   .00035308          12
         43 |  -.01332226   .00051561          13
         44 |  -.01217825   .00032719          14
         45 |   -.0108095   .00053889          17
         46 |  -.00892453   .00074237          21
         47 |  -.00690041   .00054723          25
         48 |  -.00600946   .00006012           6
         49 |  -.00538748   .00024998          18
         50 |   -.0042523   .00053212          24
         51 |   -.0027918   .00046621          23
         52 |  -.00048775   .00070798          27
         53 |   .00105457   .00033007          18
         54 |   .00238494   .00035775          18
         55 |   .00369111   .00045533          20
         56 |   .00514484   .00026635          11
         57 |   .00643375    .0004453          13
         58 |   .00767386   .00016624           9
         59 |   .00881586   .00047562          17
         60 |    .0099879   .00026001          10
         61 |    .0112326   .00039009          15
         62 |   .01227383   .00040001          11
         63 |   .01374075   .00034085          17
         64 |   .01521022   .00047789          10
         65 |   .01695365   .00069487          19
         66 |   .01898921   .00060572          18
         67 |   .02090057   .00042895          10
         68 |   .02171381   .00014076           4
         69 |   .02372986   .00090889          16
         70 |     .025209   .00028774          11
         71 |   .02630279   .00048319          12
         72 |   .02778919    .0003897           8
         73 |   .02993824   .00048998          10
         74 |   .03238613   .00077493           9
         75 |    .0342715   .00050107           8
         76 |   .03806601   .00177364          14
         77 |   .04163906   .00042174          11
         78 |   .04353161   .00073337          13
         79 |   .04695668   .00142259          12
         80 |   .04973557   .00076444          13
         81 |     .051887   .00075619          10
         82 |   .05602678   .00180971          23
         83 |    .0608797   .00086193          20
         84 |   .06430961   .00120057          15
         85 |   .06675764   .00055315          14
         86 |   .06885005   .00083958          17
         87 |   .07227367   .00138163          10
         88 |   .07917118   .00463551           8
         89 |   .09153814   .00537626          14
         90 |   .10409822   .00208011          12
         91 |   .11071211   .00262738          10
         92 |   .12064088   .00281979           6
         93 |   .13237248   .00563549          10
         94 |   .14668011   .00237605           4
         95 |   .15970285    .0095443          12
         96 |   .20287823    .0120882          10
         97 |   .24512698   .00966065          15
         98 |     .270222   .00925371           9
         99 |   .36808939   .05649177           8
        100 |   1.1517476   .62188881          14
------------+------------------------------------
      Total |   .00596487   .17962077       1,253

. ********************************************************************;
. *OLS REGRESSIONS ON OUTLYING NEGATIVE & SIGNIFICANT OUTCOMES;
. reg neg10s p12 p56   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1151
                                                Root MSE          =     .28774

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |   .0809324   .1028085     0.79   0.434    -.1241127    .2859775
         p56 |  -.1606565   .0642693    -2.50   0.015    -.2888376   -.0324754
   stats_brw |  -.0664848   .0311382    -2.14   0.036    -.1285881   -.0043816
   topic_brw |   .0669809   .0244665     2.74   0.008      .018184    .1157777
          t2 |   .0116382   .0625634     0.19   0.853    -.1131407     .136417
          t3 |   .0277276   .0770932     0.36   0.720      -.12603    .1814851
             |
     mdegree |
          1  |  -.3330125   .1321903    -2.52   0.014    -.5966579   -.0693672
          2  |  -.1239984   .0956794    -1.30   0.199     -.314825    .0668282
          3  |   .0244739   .0529718     0.46   0.646    -.0811751    .1301228
          4  |   .0440525   .0658996     0.67   0.506      -.08738    .1754851
          5  |  -.1305601   .0733674    -1.78   0.079    -.2768867    .0157666
          6  |  -.0058648   .0822818    -0.07   0.943    -.1699707     .158241
         20  |  -.0783415   .0722181    -1.08   0.282     -.222376    .0656929
         33  |  -.0103473   .0580669    -0.18   0.859    -.1261582    .1054635
         34  |  -.1277286   .0638258    -2.00   0.049    -.2550251   -.0004321
         35  |   .1645209   .1638627     1.00   0.319     -.162293    .4913348
         36  |  -.1428256   .0500535    -2.85   0.006    -.2426542   -.0429971
         40  |  -.0715434   .1287275    -0.56   0.580    -.3282823    .1851956
             |
       _cons |   .1638598   .0875085     1.87   0.065    -.0106704      .33839
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
      neg10s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.2415889   .1074294    -2.25   0.028    -.4558501   -.0273277
------------------------------------------------------------------------------

. reg neg10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(teamid
> );
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1331
                                                Root MSE          =     .28479

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .1499767   .1231782     1.22   0.227    -.0956945    .3956478
      group3 |  -.1238967   .0439937    -2.82   0.006    -.2116394   -.0361541
   stats_brw |  -.0587452   .0288513    -2.04   0.046    -.1162873    -.001203
   topic_brw |   .0694603   .0267588     2.60   0.011     .0160915    .1228291
          t2 |  -.0013585   .0631055    -0.02   0.983    -.1272186    .1245015
          t3 |   .0486447   .0798961     0.61   0.545     -.110703    .2079925
             |
     mdegree |
          1  |  -.3201665   .1375127    -2.33   0.023    -.5944268   -.0459062
          2  |  -.0635652   .0910883    -0.70   0.488     -.245235    .1181047
          3  |   .0376362    .048464     0.78   0.440    -.0590221    .1342946
          4  |   .0693089   .0656209     1.06   0.295    -.0615678    .2001856
          5  |  -.1151151   .0721569    -1.60   0.115    -.2590274    .0287973
          6  |   .0070074   .0952643     0.07   0.942    -.1829913    .1970061
         20  |  -.0524606    .070178    -0.75   0.457    -.1924263    .0875051
         33  |  -.0241572   .0654989    -0.37   0.713    -.1547906    .1064762
         34  |  -.0836895   .0398353    -2.10   0.039    -.1631384   -.0042405
         35  |   .1775515   .1410087     1.26   0.212    -.1036816    .4587845
         36  |  -.2900922   .1251741    -2.32   0.023    -.5397441   -.0404403
         40  |  -.1214856   .0873134    -1.39   0.169    -.2956267    .0526554
             |
       _cons |   .1075995   .0838129     1.28   0.203    -.0595601    .2747591
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
      neg10s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.2738734   .1252005    -2.19   0.032    -.5235778    -.024169
------------------------------------------------------------------------------

. *REGRESSIONS ON OUTLYING POSITIVE & SIGNIFICANT COEFFICIENTS;
. reg pos10s p12 p56   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0909
                                                Root MSE          =     .24447

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.1303656   .0568758    -2.29   0.025    -.2438009   -.0169303
         p56 |  -.0161202   .0412526    -0.39   0.697    -.0983958    .0661554
   stats_brw |   .0214705   .0163152     1.32   0.192    -.0110691    .0540101
   topic_brw |  -.0286732   .0149169    -1.92   0.059     -.058424    .0010775
          t2 |   .0008766   .0390577     0.02   0.982    -.0770216    .0787748
          t3 |   .0008057   .0324458     0.02   0.980    -.0639055    .0655169
             |
     mdegree |
          1  |   .4931991   .0646379     7.63   0.000     .3642828    .6221154
          2  |  -.0409355   .0679387    -0.60   0.549    -.1764351     .094564
          3  |   .0301434   .0242925     1.24   0.219    -.0183064    .0785932
          4  |   .0751496   .0395665     1.90   0.062    -.0037633    .1540625
          5  |   .2427746    .092813     2.62   0.011     .0576649    .4278844
          6  |  -.0112252   .0454809    -0.25   0.806    -.1019339    .0794836
         20  |    .114996   .0731845     1.57   0.121    -.0309658    .2609578
         33  |   .0762296   .0746332     1.02   0.311    -.0726217    .2250809
         34  |    .014046   .0241156     0.58   0.562     -.034051     .062143
         35  |   .1858776   .1551776     1.20   0.235    -.1236143    .4953696
         36  |   .0212165   .0258179     0.82   0.414    -.0302758    .0727087
         40  |   .0540677   .0328363     1.65   0.104    -.0114223    .1195577
             |
       _cons |   .0220231   .0624401     0.35   0.725    -.1025097    .1465559
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
      pos10s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1142454   .0458145     2.49   0.015     .0228713    .2056195
------------------------------------------------------------------------------

. reg pos10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  cluster(teamid
> );
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0893
                                                Root MSE          =     .24468

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0695299    .037774    -1.84   0.070    -.1448677    .0058078
      group3 |   .0173149   .0339734     0.51   0.612    -.0504429    .0850727
   stats_brw |   .0185729   .0169578     1.10   0.277    -.0152483    .0523941
   topic_brw |  -.0230389   .0144269    -1.60   0.115    -.0518126    .0057347
          t2 |   .0208351   .0384056     0.54   0.589    -.0557625    .0974326
          t3 |   .0159298   .0304898     0.52   0.603    -.0448801    .0767398
             |
     mdegree |
          1  |   .4759843   .0590043     8.07   0.000      .358304    .5936647
          2  |   .0127327   .0526397     0.24   0.810    -.0922539    .1177194
          3  |   .0416704   .0213894     1.95   0.055    -.0009893    .0843301
          4  |   .0915796   .0359785     2.55   0.013     .0198228    .1633364
          5  |   .2692067   .0973468     2.77   0.007     .0750546    .4633587
          6  |   .0216992   .0434747     0.50   0.619    -.0650084    .1084067
         20  |   .1271541   .0726923     1.75   0.085    -.0178262    .2721344
         33  |   .1018247   .0693412     1.47   0.146    -.0364719    .2401213
         34  |   .0119362   .0131417     0.91   0.367    -.0142741    .0381465
         35  |   .2045159   .1460032     1.40   0.166    -.0866782    .4957101
         36  |   .0764449   .0370088     2.07   0.043     .0026333    .1502566
         40  |   .0993631    .035338     2.81   0.006     .0288837    .1698425
             |
       _cons |  -.0275794   .0477481    -0.58   0.565      -.12281    .0676511
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
      pos10s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0868448   .0346823     2.50   0.015     .0176731    .1560166
------------------------------------------------------------------------------

. *WEIGHTED REGRESSIONS ON OUTLYING NEGATIVE & SIGNIFICANT COEFFICIENTS;
. reg neg10s p12 p56   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,  cluster(teamid)
> ;
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1237
                                                Root MSE          =     .29578

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |   .0891687    .104752     0.85   0.398    -.1197525    .2980899
         p56 |  -.1746921   .0672402    -2.60   0.011    -.3087986   -.0405857
   stats_brw |  -.0647924   .0329291    -1.97   0.053    -.1304673    .0008826
   topic_brw |   .0670372   .0250579     2.68   0.009     .0170608    .1170135
          t2 |   .0213351   .0626634     0.34   0.735     -.103643    .1463133
          t3 |   .0455383   .0795467     0.57   0.569    -.1131125    .2041891
             |
     mdegree |
          1  |  -.3324844   .1374996    -2.42   0.018    -.6067187     -.05825
          2  |  -.1200752   .0984325    -1.22   0.227    -.3163926    .0762422
          3  |   .0241135   .0581947     0.41   0.680    -.0919521    .1401791
          4  |     .05862   .0681223     0.86   0.392    -.0772457    .1944857
          5  |  -.1372176   .0741436    -1.85   0.068    -.2850923     .010657
          6  |   .0014755   .0864704     0.02   0.986    -.1709842    .1739352
         20  |  -.0747004   .0762488    -0.98   0.331    -.2267738    .0773729
         33  |  -.0166714     .06197    -0.27   0.789    -.1402667     .106924
         34  |  -.1338219   .0673314    -1.99   0.051    -.2681103    .0004664
         35  |   .1736654   .1622375     1.07   0.288    -.1499071    .4972379
         36  |  -.1564364   .0503675    -3.11   0.003    -.2568913   -.0559815
         40  |  -.0999571   .1298915    -0.77   0.444    -.3590175    .1591033
             |
       _cons |   .1604324   .0901867     1.78   0.080    -.0194392    .3403041
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
      neg10s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.2638608   .1105757    -2.39   0.020    -.4843971   -.0433245
------------------------------------------------------------------------------

. reg neg10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,  cluster(t
> eamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1465
                                                Root MSE          =     .29191

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      neg10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .1636499   .1322999     1.24   0.220    -.1002139    .4275136
      group3 |  -.1387393   .0460819    -3.01   0.004    -.2306469   -.0468318
   stats_brw |  -.0547703   .0294287    -1.86   0.067    -.1134641    .0039234
   topic_brw |   .0692844   .0274388     2.53   0.014     .0145596    .1240093
          t2 |   .0078087   .0633907     0.12   0.902    -.1186201    .1342376
          t3 |   .0671155   .0810846     0.83   0.411    -.0946027    .2288337
             |
     mdegree |
          1  |  -.3186877   .1425903    -2.23   0.029    -.6030751   -.0343004
          2  |  -.0598776    .092847    -0.64   0.521    -.2450551       .1253
          3  |   .0344924   .0515325     0.67   0.505    -.0682859    .1372708
          4  |   .0850594   .0661273     1.29   0.203    -.0468273    .2169462
          5  |  -.1258588   .0717175    -1.75   0.084     -.268895    .0171773
          6  |   .0108928   .0988641     0.11   0.913    -.1862854     .208071
         20  |  -.0486418    .073008    -0.67   0.507    -.1942518    .0969681
         33  |  -.0365611   .0716218    -0.51   0.611    -.1794063    .1062842
         34  |  -.0856407   .0423931    -2.02   0.047    -.1701911   -.0010904
         35  |     .18188   .1369352     1.33   0.188    -.0912286    .4549885
         36  |  -.3220701   .1329072    -2.42   0.018    -.5871451   -.0569951
         40  |  -.1486116    .083161    -1.79   0.078     -.314471    .0172478
             |
       _cons |   .1048122   .0857072     1.22   0.225    -.0661255    .2757499
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
      neg10s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.3023892   .1339009    -2.26   0.027    -.5694462   -.0353322
------------------------------------------------------------------------------

. *WEIGHTED REGRESSIONS ON OUTLYING POSITIVE & SIGNIFICANT COEFFICIENTS;
. reg pos10s p12 p56   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,  cluster(teamid)
> ;
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0910
                                                Root MSE          =     .24039

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |    -.13167   .0560837    -2.35   0.022    -.2435255   -.0198146
         p56 |  -.0210306   .0391227    -0.54   0.593    -.0990584    .0569971
   stats_brw |   .0231479   .0163485     1.42   0.161    -.0094582    .0557539
   topic_brw |  -.0305575   .0146449    -2.09   0.041    -.0597658   -.0013492
          t2 |   .0021029   .0372125     0.06   0.955    -.0721152     .076321
          t3 |    .003253   .0316704     0.10   0.918    -.0599117    .0664177
             |
     mdegree |
          1  |   .4957652   .0663187     7.48   0.000     .3634967    .6280337
          2  |  -.0450673   .0644131    -0.70   0.486    -.1735353    .0834006
          3  |   .0293743   .0237822     1.24   0.221    -.0180578    .0768064
          4  |   .0684851   .0366305     1.87   0.066    -.0045721    .1415424
          5  |   .2409124   .0902647     2.67   0.009     .0608851    .4209397
          6  |  -.0119622   .0447768    -0.27   0.790    -.1012666    .0773423
         20  |   .1201032   .0737118     1.63   0.108    -.0269103    .2671168
         33  |   .0588895   .0641847     0.92   0.362    -.0691228    .1869018
         34  |   .0133928   .0246648     0.54   0.589    -.0357995    .0625851
         35  |   .1655675   .1550299     1.07   0.289    -.1436299    .4747649
         36  |   .0173873   .0250478     0.69   0.490     -.032569    .0673436
         40  |   .0474851   .0320415     1.48   0.143    -.0164197    .1113898
             |
       _cons |   .0249826    .059457     0.42   0.676    -.0936007    .1435658
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
      pos10s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1106394   .0453638     2.44   0.017     .0201641    .2011147
------------------------------------------------------------------------------

. reg pos10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,  cluster(t
> eamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0886
                                                Root MSE          =     .24072

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
      pos10s | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0656085   .0364099    -1.80   0.076    -.1382257    .0070087
      group3 |   .0155783    .032557     0.48   0.634    -.0493546    .0805112
   stats_brw |   .0203249    .017244     1.18   0.243    -.0140672    .0547169
   topic_brw |  -.0246797   .0144307    -1.71   0.092    -.0534609    .0041015
          t2 |   .0231159   .0371082     0.62   0.535    -.0508941    .0971259
          t3 |   .0205865    .029805     0.69   0.492    -.0388576    .0800306
             |
     mdegree |
          1  |   .4790793   .0605237     7.92   0.000     .3583686      .59979
          2  |   .0142162   .0508373     0.28   0.781    -.0871756    .1156081
          3  |   .0435736   .0213418     2.04   0.045     .0010087    .0861386
          4  |   .0873129   .0333515     2.62   0.011     .0207955    .1538303
          5  |   .2699365   .0958576     2.82   0.006     .0787545    .4611185
          6  |   .0253729   .0435845     0.58   0.562    -.0615536    .1122995
         20  |   .1342561   .0738243     1.82   0.073    -.0129819     .281494
         33  |   .0870475    .060165     1.45   0.152    -.0329479    .2070429
         34  |   .0121145   .0129392     0.94   0.352    -.0136919     .037921
         35  |   .1866959    .146356     1.28   0.206    -.1052019    .4785936
         36  |   .0696675   .0357804     1.95   0.056    -.0016944    .1410293
         40  |   .0921893   .0329582     2.80   0.007     .0264561    .1579224
             |
       _cons |  -.0300067   .0463207    -0.65   0.519    -.1223904    .0623769
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
      pos10s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0811868   .0329893     2.46   0.016     .0153918    .1469818
------------------------------------------------------------------------------

. *RELATIONSHIP BETWEEN NEW MEASURE OF QUALITY OF RESEARCH AND PRO-IMMIGRATION INDEX;
. *NOTE THESE REGRESSIONS LOSE A FEW OBSERVATIONS BECAUSE PEER_MEAN IS NOT AVAILABLE FOR 38 OBSERV
> ATIONS;
. summ quality2;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    quality2 |      1,215    .2271605    .4191697          0          1

. *WEIGHT ALSO BY PEER_N, NUMBER OF REVIEWERS THAT MODEL HAD;
. *NEW REFEREE SCORE MEASURE AS DEPENDENT VARIABLE;
. reg zpeer_mean p12 p56     stats_brw topic_brw t2 t3 i.mdegree  [aw=peer_n/nmodel] ,  cluster(te
> amid);
(sum of wgt is 647.0125)

Linear regression                               Number of obs     =      1,215
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3250
                                                Root MSE          =     .86586

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
  zpeer_mean | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.9714526   .3744682    -2.59   0.012    -1.718306   -.2245993
         p56 |  -1.162185   .3330606    -3.49   0.001    -1.826454   -.4979169
   stats_brw |  -.2839056   .1035207    -2.74   0.008    -.4903712     -.07744
   topic_brw |   .2347752   .1148748     2.04   0.045     .0056646    .4638858
          t2 |  -.7029084   .3649609    -1.93   0.058      -1.4308    .0249831
          t3 |  -.0464912    .374486    -0.12   0.902    -.7933801    .7003976
             |
     mdegree |
          1  |  -3.756453   .5318257    -7.06   0.000    -4.817146    -2.69576
          2  |  -.9474463   .5801871    -1.63   0.107    -2.104593    .2097003
          3  |   -.924478    .289933    -3.19   0.002    -1.502731   -.3462249
          4  |  -.8382434    .469665    -1.78   0.079    -1.774961    .0984739
          5  |  -.9217533    .387705    -2.38   0.020    -1.695006   -.1485002
          6  |   -1.49584   .4346329    -3.44   0.001    -2.362688   -.6289922
         20  |  -.5368824    .516404    -1.04   0.302    -1.566818     .493053
         33  |  -1.025859   .4098736    -2.50   0.015    -1.843326   -.2083916
         34  |  -.7520685   .1543082    -4.87   0.000    -1.059827   -.4443104
         35  |  -.3253878   .3172985    -1.03   0.309    -.9582196     .307444
         36  |  -.6560276   .1907684    -3.44   0.001    -1.036503   -.2755521
         40  |   -1.59042   .2704602    -5.88   0.000    -2.129836   -1.051004
             |
       _cons |   1.952328   .5573289     3.50   0.001     .8407709    3.063886
------------------------------------------------------------------------------

. reg zpeer_mean group1 group3     stats_brw topic_brw t2 t3 i.mdegree   [aw=peer_n/nmodel] ,  clu
> ster(teamid);
(sum of wgt is 647.0125)

Linear regression                               Number of obs     =      1,215
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2664
                                                Root MSE          =     .90262

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
  zpeer_mean | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.4349382   .2664985    -1.63   0.107    -.9664527    .0965763
      group3 |  -.6481386   .2560087    -2.53   0.014    -1.158732   -.1375454
   stats_brw |  -.2856609   .1016715    -2.81   0.006    -.4884383   -.0828835
   topic_brw |   .2950443   .1200307     2.46   0.016     .0556506     .534438
          t2 |  -.6917726   .3425085    -2.02   0.047    -1.374884   -.0086609
          t3 |   .2182218    .355763     0.61   0.542    -.4913251    .9277687
             |
     mdegree |
          1  |  -3.481448   .4931658    -7.06   0.000    -4.465036   -2.497859
          2  |  -.1123885    .432805    -0.26   0.796    -.9755908    .7508138
          3  |  -.6581722   .2733243    -2.41   0.019      -1.2033   -.1130441
          4  |   -.490127    .448945    -1.09   0.279     -1.38552    .4052656
          5  |  -.4490535   .3005919    -1.49   0.140    -1.048565    .1504581
          6  |  -1.064393   .4584404    -2.32   0.023    -1.978724   -.1500623
         20  |  -.1496891   .4772541    -0.31   0.755    -1.101542    .8021643
         33  |  -.6988368   .4528993    -1.54   0.127    -1.602116    .2044424
         34  |   -.598207   .1689285    -3.54   0.001    -.9351244   -.2612897
         35  |  -.1250375   .2816495    -0.44   0.658    -.6867697    .4366946
         36  |  -.4323779   .2994506    -1.44   0.153    -1.029613    .1648575
         40  |  -1.200167   .3183699    -3.77   0.000    -1.835136   -.5651982
             |
       _cons |   1.168493   .4171776     2.80   0.007     .3364581    2.000527
------------------------------------------------------------------------------

. *QUALITY MODELS LOSE A LOT OF SINGLETON OBSERVATIONS IF WE USE LOGIT;
. *SO WILL DO LINEAR PROBABILITY MODEL INSTEAD;
. *OLS MODELS ON HIGH quality2;
. reg quality2 p12 p56     stats_brw topic_brw t2 t3 i.mdegree   [aw=peer_n/nmodel] , cluster(team
> id);
(sum of wgt is 647.0125)

Linear regression                               Number of obs     =      1,215
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3040
                                                Root MSE          =     .38857

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
    quality2 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.4972039   .2619605    -1.90   0.062    -1.019668    .0252599
         p56 |  -.4670665   .1636317    -2.85   0.006    -.7934196   -.1407135
   stats_brw |   -.099628   .0589207    -1.69   0.095    -.2171417    .0178857
   topic_brw |   .0251877   .0521672     0.48   0.631    -.0788565    .1292318
          t2 |  -.2322691   .2196477    -1.06   0.294    -.6703427    .2058044
          t3 |   .0397394   .2259301     0.18   0.861    -.4108639    .4903428
             |
     mdegree |
          1  |  -1.205899    .259094    -4.65   0.000    -1.722646    -.689152
          2  |  -.4093724   .3321878    -1.23   0.222      -1.0719    .2531552
          3  |  -.7229027   .1264743    -5.72   0.000    -.9751477   -.4706578
          4  |  -.7026546   .1856194    -3.79   0.000    -1.072861   -.3324484
          5  |  -.7383678   .2145582    -3.44   0.001    -1.166291   -.3104449
          6  |  -1.101474   .2190743    -5.03   0.000    -1.538404   -.6645436
         20  |  -.7095437   .1839414    -3.86   0.000    -1.076403   -.3426841
         33  |  -.7115517   .2116562    -3.36   0.001    -1.133687   -.2894167
         34  |  -.7177271   .1134924    -6.32   0.000    -.9440805   -.4913736
         35  |  -.4617273   .2389516    -1.93   0.057    -.9383013    .0148466
         36  |   -1.06427   .1115516    -9.54   0.000    -1.286753   -.8417878
         40  |  -1.042176   .1220097    -8.54   0.000    -1.285517   -.7988357
             |
       _cons |   1.404628   .3049102     4.61   0.000     .7965039    2.012752
------------------------------------------------------------------------------

. reg quality2 group1 group3     stats_brw topic_brw t2 t3 i.mdegree   [aw=peer_n/nmodel] , cluste
> r(teamid);
(sum of wgt is 647.0125)

Linear regression                               Number of obs     =      1,215
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2659
                                                Root MSE          =     .39905

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
    quality2 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.3030888   .1974538    -1.53   0.129    -.6968979    .0907203
      group3 |  -.2945444   .1193587    -2.47   0.016    -.5325978    -.056491
   stats_brw |  -.1026881   .0602879    -1.70   0.093    -.2229286    .0175524
   topic_brw |   .0495604   .0477998     1.04   0.303    -.0457732    .1448941
          t2 |  -.2457261   .2114129    -1.16   0.249    -.6673757    .1759236
          t3 |    .145201   .2099938     0.69   0.492    -.2736185    .5640205
             |
     mdegree |
          1  |  -1.115661   .2554425    -4.37   0.000    -1.625125   -.6061974
          2  |  -.1087544   .2615977    -0.42   0.679    -.6304946    .4129859
          3  |  -.6199228   .1260347    -4.92   0.000     -.871291   -.3685546
          4  |  -.5695603   .1796946    -3.17   0.002    -.9279499   -.2111706
          5  |  -.5719548    .192606    -2.97   0.004    -.9560953   -.1878143
          6  |  -.9515151     .16656    -5.71   0.000    -1.283709   -.6193215
         20  |  -.5620014   .2113219    -2.66   0.010    -.9834695   -.1405332
         33  |   -.592559   .2147675    -2.76   0.007    -1.020899   -.1642188
         34  |  -.6856508   .1289963    -5.32   0.000    -.9429258   -.4283757
         35  |  -.4056538    .209425    -1.94   0.057    -.8233388    .0120312
         36  |  -.9137202   .2032878    -4.49   0.000    -1.319165   -.5082754
         40  |  -.8716003   .1230761    -7.08   0.000    -1.117068   -.6261327
             |
       _cons |   1.124103   .2370345     4.74   0.000     .6513523    1.596853
------------------------------------------------------------------------------

. *USING MEDIAN;
. generate y1=att1;
(74 missing values generated)

. generate y2=att2;
(684 missing values generated)

. generate y3=att3;
(289 missing values generated)

. gen median = y1 + y2 + y3 - min(y1, y2, y3) - max(y1, y2, y3);
(738 missing values generated)

. replace median = max(y1, y2, y3) if 
>         (missing(y1) + missing(y2) + missing(y3)) == 2 ;
(309 real changes made)

. replace median = (         cond(missing(y1), 0, y1) + 
>         cond(missing(y2), 0, y2) + 
>         cond(missing(y3), 0, y3) ) / 2 
>         if (missing(y1) + missing(y2) + missing(y3)) == 1       ;
(429 real changes made)

. ********************************************************************;
. 
end of do-file

. browse

. browse if p12>0

. exit, clear
