--------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/GitHub/ideology_specification/code/Log Files/03_Robustness.log
  log type:  text
 opened on:   8 Apr 2025, 20:45:23

. clear matrix;

. clear mata;

. *KEY ROBUSTNESS CHECKS OF MAIN RESULT;
. *SENSITIVITY TO DEFINITION OF EDUCATION VECTOR;
. *AND TO DEFINITION OF IMMIGRATION IDEOLOGY;
. *USES THE MODEL LEVEL DATA CREATED IN 02_Table_1_2_5_6.DO;
. use "$workd/data/newmodel.dta", clear;

. *BRW MEASURE OF IMMIGRATION SENTIMENT;
. tabulate proindex;

   proindex |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         30        2.39        2.39
          2 |         24        1.92        4.31
   2.333333 |         12        0.96        5.27
   2.666667 |         24        1.92        7.18
          3 |         48        3.83       11.01
   3.333333 |         20        1.60       12.61
        3.5 |         80        6.38       18.99
   3.666667 |        128       10.22       29.21
          4 |         74        5.91       35.12
   4.333333 |        160       12.77       47.89
        4.5 |         98        7.82       55.71
   4.666667 |         52        4.15       59.86
          5 |        144       11.49       71.35
   5.333333 |         28        2.23       73.58
        5.5 |        122        9.74       83.32
   5.666667 |         18        1.44       84.76
          6 |        191       15.24      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. *P34 AND P56 ARE % OF TEAM THAT HAVE CODES 3-4, OR 5-6, IN IDEOLOGY MEASURE;
. tabulate p12;

        p12 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,079       86.11       86.11
   .3333333 |        108        8.62       94.73
   .6666667 |         12        0.96       95.69
          1 |         54        4.31      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. tabulate p34;

        p34 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        566       45.17       45.17
   .3333333 |        117        9.34       54.51
         .5 |        140       11.17       65.68
   .6666667 |        184       14.68       80.37
          1 |        246       19.63      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. tabulate p56;

        p56 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        338       26.98       26.98
   .3333333 |        200       15.96       42.94
         .5 |        140       11.17       54.11
   .6666667 |        103        8.22       62.33
          1 |        472       37.67      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. *WEIGHTED BY 1/NMODEL;
. *USING MDEGREE EDUCATION VECTOR;
. reg ame  proindex    stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0617
                                                Root MSE          =     .19878

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0108737   .0056998     1.91   0.061    -.0004943    .0222416
   stats_brw |   .0384442   .0176848     2.17   0.033     .0031731    .0737154
   topic_brw |  -.0410347   .0168102    -2.44   0.017    -.0745616   -.0075078
          t2 |   .0093166   .0148151     0.63   0.531    -.0202313    .0388644
          t3 |    .012971    .023955     0.54   0.590    -.0348057    .0607477
             |
     mdegree |
          1  |   .4545994   .0506109     8.98   0.000     .3536592    .5555396
          2  |   .2734257   .0208276    13.13   0.000     .2318864    .3149651
          3  |   .2742735   .0197721    13.87   0.000     .2348392    .3137077
          4  |   .2734748   .0198543    13.77   0.000     .2338766     .313073
          5  |   .3211411   .0343558     9.35   0.000     .2526206    .3896615
          6  |   .2508457   .0218756    11.47   0.000     .2072162    .2944751
         20  |   .2775809   .0320121     8.67   0.000     .2137348    .3414271
         33  |   .2778045   .0274814    10.11   0.000     .2229947    .3326143
         34  |   .2877794   .0198662    14.49   0.000     .2481574    .3274014
         35  |   .1854928    .074674     2.48   0.015     .0365602    .3344255
         36  |   .2727957   .0187552    14.55   0.000     .2353896    .3102018
         40  |   .2540658   .0402514     6.31   0.000     .1737869    .3343448
             |
       _cons |  -.3348635    .027718   -12.08   0.000    -.3901454   -.2795817
------------------------------------------------------------------------------

. reg ame  p12 p56    stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0648
                                                Root MSE          =     .19853

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0503799   .0252584    -1.99   0.050    -.1007562   -3.69e-06
         p56 |   .0234775   .0193443     1.21   0.229    -.0151034    .0620584
   stats_brw |    .037143   .0166456     2.23   0.029     .0039445    .0703415
   topic_brw |  -.0418866   .0165861    -2.53   0.014    -.0749666   -.0088066
          t2 |   .0011216   .0162283     0.07   0.945    -.0312447    .0334879
          t3 |   .0087989   .0224903     0.39   0.697    -.0360565    .0536543
             |
     mdegree |
          1  |   .4764457    .058257     8.18   0.000     .3602557    .5926357
          2  |   .2592396   .0291878     8.88   0.000     .2010265    .3174528
          3  |   .2730058   .0203962    13.39   0.000     .2323269    .3136846
          4  |   .2712758    .019403    13.98   0.000     .2325777    .3099739
          5  |   .3222416   .0299225    10.77   0.000      .262563    .3819201
          6  |   .2516072   .0224161    11.22   0.000     .2068996    .2963148
         20  |   .2742799   .0338085     8.11   0.000     .2068511    .3417088
         33  |   .2751979   .0261161    10.54   0.000      .223111    .3272847
         34  |   .2847723   .0215027    13.24   0.000     .2418866     .327658
         35  |   .1800135   .0745509     2.41   0.018     .0313264    .3287007
         36  |   .2812386   .0133591    21.05   0.000     .2545947    .3078825
         40  |   .2544392   .0381109     6.68   0.000     .1784294    .3304489
             |
       _cons |   -.289131   .0262677   -11.01   0.000    -.3415202   -.2367418
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0738574   .0242554     3.04   0.003     .0254815    .1222334
------------------------------------------------------------------------------

. reg ame  group1 group3    stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0710
                                                Root MSE          =     .19788

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0572476   .0306365    -1.87   0.066    -.1183502    .0038549
      group3 |   .0272754   .0147459     1.85   0.069    -.0021343    .0566851
   stats_brw |   .0341011   .0156414     2.18   0.033     .0029053     .065297
   topic_brw |  -.0406176   .0155892    -2.61   0.011    -.0717092    -.009526
          t2 |   .0063886   .0160686     0.40   0.692    -.0256592    .0384365
          t3 |   .0079756   .0229581     0.35   0.729    -.0378128     .053764
             |
     mdegree |
          1  |   .4781822   .0593708     8.05   0.000     .3597709    .5965935
          2  |   .2632302   .0264194     9.96   0.000     .2105383     .315922
          3  |   .2761151   .0200568    13.77   0.000     .2361131    .3161171
          4  |   .2729049   .0187597    14.55   0.000     .2354899    .3103199
          5  |   .3308497   .0292276    11.32   0.000     .2725571    .3891424
          6  |    .260214    .024832    10.48   0.000     .2106882    .3097399
         20  |   .2746755   .0345734     7.94   0.000      .205721      .34363
         33  |   .2877058    .026143    11.01   0.000     .2355652    .3398464
         34  |   .2763302   .0143112    19.31   0.000     .2477874     .304873
         35  |   .1839868   .0675415     2.72   0.008     .0492795    .3186942
         36  |   .3356711   .0298616    11.24   0.000      .276114    .3952282
         40  |   .2824761   .0246236    11.47   0.000      .233366    .3315862
             |
       _cons |  -.2928377   .0268678   -10.90   0.000    -.3464238   -.2392515
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |    .084523    .031027     2.72   0.008     .0226417    .1464043
------------------------------------------------------------------------------

. reg ame  group3    stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0661
                                                Root MSE          =     .19832

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |   .0400274   .0158054     2.53   0.014     .0085044    .0715503
   stats_brw |   .0366518   .0162719     2.25   0.027     .0041984    .0691051
   topic_brw |  -.0397766   .0154963    -2.57   0.012    -.0706829   -.0088703
          t2 |   .0240041   .0153349     1.57   0.122    -.0065805    .0545887
          t3 |   .0152444   .0221752     0.69   0.494    -.0289826    .0594714
             |
     mdegree |
          1  |     .44895   .0562755     7.98   0.000     .3367121    .5611879
          2  |   .2841817   .0217026    13.09   0.000     .2408972    .3274663
          3  |   .2718073    .022274    12.20   0.000     .2273833    .3162314
          4  |   .2728777   .0193381    14.11   0.000     .2343091    .3114464
          5  |   .3293892   .0305213    10.79   0.000     .2685162    .3902621
          6  |   .2677352   .0246948    10.84   0.000     .2184829    .3169874
         20  |   .2726566   .0376655     7.24   0.000      .197535    .3477781
         33  |   .2852015   .0236278    12.07   0.000     .2380774    .3323256
         34  |   .2822144   .0168685    16.73   0.000     .2485712    .3158576
         35  |   .1885997    .062192     3.03   0.003     .0645617    .3126376
         36  |   .2887058    .015035    19.20   0.000     .2587195    .3186922
         40  |   .2671305    .040801     6.55   0.000     .1857555    .3485056
             |
       _cons |  -.3123935   .0230896   -13.53   0.000    -.3584442   -.2663428
------------------------------------------------------------------------------

. *USING EDUCATION OF LEAD RESEARCHER;
. reg ame  proindex    stats_brw topic_brw t2 t3 i.degree1   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 70)

Linear regression                               Number of obs     =      1,233
                                                F(9, 69)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0359
                                                Root MSE          =     .19524

                                (Std. err. adjusted for 70 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0095931   .0055387     1.73   0.088    -.0014562    .0206425
   stats_brw |   .0416155   .0180203     2.31   0.024      .005666    .0775649
   topic_brw |  -.0460384    .016865    -2.73   0.008    -.0796831   -.0123937
          t2 |   .0029558   .0145499     0.20   0.840    -.0260704     .031982
          t3 |   .0036165   .0183121     0.20   0.844    -.0329151    .0401481
             |
     degree1 |
          2  |  -.2030969   .0601928    -3.37   0.001    -.3231782   -.0830156
          3  |   -.175415   .0512933    -3.42   0.001    -.2777422   -.0730877
          4  |  -.1869689   .0532886    -3.51   0.001    -.2932767   -.0806611
          5  |  -.1637469   .0671427    -2.44   0.017    -.2976929   -.0298009
          6  |  -.1830976   .0536545    -3.41   0.001    -.2901354   -.0760598
          7  |  -.0974148   .0206561    -4.72   0.000    -.1386226    -.056207
             |
       _cons |   .1294839   .0502671     2.58   0.012     .0292038     .229764
------------------------------------------------------------------------------

. reg ame  p12 p56    stats_brw topic_brw t2 t3 i.degree1   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 70)

Linear regression                               Number of obs     =      1,233
                                                F(10, 69)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0388
                                                Root MSE          =     .19503

                                (Std. err. adjusted for 70 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0381363   .0252555    -1.51   0.136    -.0885197    .0122471
         p56 |     .02503   .0198658     1.26   0.212    -.0146013    .0646612
   stats_brw |    .040765   .0171548     2.38   0.020     .0065421    .0749879
   topic_brw |  -.0464575   .0163604    -2.84   0.006    -.0790956   -.0138194
          t2 |   -.002785    .015222    -0.18   0.855    -.0331522    .0275821
          t3 |   .0015574   .0175157     0.09   0.929    -.0333855    .0365003
             |
     degree1 |
          2  |   -.223008   .0644211    -3.46   0.001    -.3515246   -.0944914
          3  |  -.1951917    .056482    -3.46   0.001    -.3078702   -.0825132
          4  |  -.2073102   .0581069    -3.57   0.001    -.3232303   -.0913902
          5  |  -.1816074   .0699204    -2.60   0.011    -.3210949     -.04212
          6  |  -.1996729    .057861    -3.45   0.001    -.3151025   -.0842433
          7  |  -.1143903    .028728    -3.98   0.000    -.1717011   -.0570795
             |
       _cons |   .1839093   .0552725     3.33   0.001     .0736437     .294175
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0631662    .024808     2.55   0.013     .0136756    .1126569
------------------------------------------------------------------------------

. reg ame  group1 group3    stats_brw topic_brw t2 t3 i.degree1   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 70)

Linear regression                               Number of obs     =      1,233
                                                F(10, 69)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0437
                                                Root MSE          =     .19453

                                (Std. err. adjusted for 70 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   -.043466    .027782    -1.56   0.122    -.0988897    .0119576
      group3 |   .0244965   .0179855     1.36   0.178    -.0113836    .0603767
   stats_brw |   .0386263   .0160641     2.40   0.019     .0065794    .0706732
   topic_brw |  -.0457203   .0156916    -2.91   0.005    -.0770242   -.0144164
          t2 |   .0019794   .0161702     0.12   0.903    -.0302793     .034238
          t3 |   .0034142   .0172629     0.20   0.844    -.0310243    .0378527
             |
     degree1 |
          2  |  -.2065965   .0583217    -3.54   0.001    -.3229451   -.0902479
          3  |  -.1919239   .0552211    -3.48   0.001    -.3020869   -.0817609
          4  |  -.2080353   .0583243    -3.57   0.001    -.3243891   -.0916816
          5  |  -.1783682   .0696412    -2.56   0.013    -.3172985   -.0394378
          6  |  -.1964367   .0572542    -3.43   0.001    -.3106557   -.0822178
          7  |  -.1227422   .0309445    -3.97   0.000    -.1844747   -.0610096
             |
       _cons |     .18294   .0556672     3.29   0.002      .071887     .293993
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0679626    .027715     2.45   0.017     .0126726    .1232525
------------------------------------------------------------------------------

. reg ame  group3    stats_brw topic_brw t2 t3 i.degree1   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 70)

Linear regression                               Number of obs     =      1,233
                                                F(9, 69)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0401
                                                Root MSE          =     .19481

                                (Std. err. adjusted for 70 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |   .0353046   .0173479     2.04   0.046     .0006965    .0699127
   stats_brw |   .0409844   .0167019     2.45   0.017      .007665    .0743037
   topic_brw |  -.0456834   .0156959    -2.91   0.005    -.0769958    -.014371
          t2 |   .0141243   .0159325     0.89   0.378    -.0176601    .0459087
          t3 |   .0065916   .0174762     0.38   0.707    -.0282725    .0414557
             |
     degree1 |
          2  |  -.1904049   .0571194    -3.33   0.001    -.3043551   -.0764548
          3  |  -.1734055   .0512501    -3.38   0.001    -.2756466   -.0711643
          4  |  -.1851165   .0545578    -3.39   0.001    -.2939563   -.0762767
          5  |  -.1594048    .065997    -2.42   0.018    -.2910652   -.0277444
          6  |   -.166297   .0498829    -3.33   0.001    -.2658107   -.0667834
          7  |  -.0937445   .0202378    -4.63   0.000    -.1341177   -.0533713
             |
       _cons |    .146887   .0450659     3.26   0.002      .056983     .236791
------------------------------------------------------------------------------

. *USING ALL POSSIBLE COMBINATIONS OF EDUCATION AMONG THREE RESEARCHERS;
. reg ame  proindex    stats_brw topic_brw t2 t3 i.counter2   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)
note: 2703.counter2 omitted because of collinearity.
note: 3654.counter2 omitted because of collinearity.

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0734
                                                Root MSE          =     .19851

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0119123   .0066752     1.78   0.079     -.001401    .0252257
   stats_brw |   .0478261   .0194586     2.46   0.016     .0090171    .0866352
   topic_brw |   -.044896   .0176022    -2.55   0.013    -.0800024   -.0097897
          t2 |  -.1045522   .0158886    -6.58   0.000    -.1362409   -.0728635
          t3 |  -.1576271   .0393031    -4.01   0.000    -.2360147   -.0792395
             |
    counter2 |
       1200  |  -.2103299   .0597512    -3.52   0.001    -.3294998   -.0911599
       1300  |  -.2026525   .0557076    -3.64   0.001    -.3137577   -.0915473
       1400  |   -.209725   .0570652    -3.68   0.000     -.323538    -.095912
       1500  |  -.1919277   .0776901    -2.47   0.016    -.3468757   -.0369797
       1600  |   -.238657   .0640049    -3.73   0.000    -.3663108   -.1110033
       2204  |  -.0893532   .0427733    -2.09   0.040    -.1746619   -.0040444
       2303  |  -.0964507   .0405717    -2.38   0.020    -.1773684    -.015533
       2306  |  -.0840498   .0390265    -2.15   0.035    -.1618858   -.0062139
       2404  |  -.0923733   .0475118    -1.94   0.056    -.1871326    .0023859
       2504  |  -.1888781   .0464938    -4.06   0.000    -.2816071   -.0961491
       2505  |  -.0751566   .0482605    -1.56   0.124    -.1714091    .0210959
       2606  |  -.1245973   .0444536    -2.80   0.007    -.2132572   -.0359374
       2703  |          0  (omitted)
       3005  |  -.3131889   .0176779   -17.72   0.000    -.3484464   -.2779315
       3244  |  -.1136301   .0229655    -4.95   0.000    -.1594334   -.0678268
       3323  |  -.0258231   .0207315    -1.25   0.217    -.0671707    .0155245
       3333  |  -.0445734   .0300532    -1.48   0.143    -.1045127    .0153658
       3336  |  -.0901513   .0279987    -3.22   0.002     -.145993   -.0343097
       3343  |  -.0275947   .0407636    -0.68   0.501     -.108895    .0537057
       3344  |  -.0452452   .0223964    -2.02   0.047    -.0899133   -.0005771
       3414  |  -.0026026   .0212346    -0.12   0.903    -.0449537    .0397484
       3433  |  -.1323637   .0750136    -1.76   0.082    -.2819735    .0172462
       3443  |   -.051904     .01653    -3.14   0.002     -.084872   -.0189361
       3444  |  -.0581543    .041061    -1.42   0.161    -.1400478    .0237393
       3555  |    .079107   .0249479     3.17   0.002       .02935     .128864
       3654  |          0  (omitted)
             |
       _cons |   .1449456   .0562486     2.58   0.012     .0327613    .2571298
------------------------------------------------------------------------------

. reg ame  p12 p56    stats_brw topic_brw t2 t3 i.counter2   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)
note: 2703.counter2 omitted because of collinearity.
note: 3654.counter2 omitted because of collinearity.

Linear regression                               Number of obs     =      1,253
                                                F(15, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0768
                                                Root MSE          =     .19823

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0192054   .0296099    -0.65   0.519    -.0782605    .0398498
         p56 |   .0442189   .0244101     1.81   0.074    -.0044656    .0929033
   stats_brw |   .0472171   .0182796     2.58   0.012     .0107596    .0836747
   topic_brw |  -.0442882   .0170444    -2.60   0.011     -.078282   -.0102943
          t2 |  -.1055814   .0304334    -3.47   0.001    -.1662789    -.044884
          t3 |  -.1557959   .0468295    -3.33   0.001    -.2491944   -.0623975
             |
    counter2 |
       1200  |  -.2156881   .0648955    -3.32   0.001    -.3451181    -.086258
       1300  |  -.2209918   .0593805    -3.72   0.000    -.3394224   -.1025612
       1400  |  -.2213245   .0605005    -3.66   0.000     -.341989   -.1006601
       1500  |  -.1935157   .0729191    -2.65   0.010    -.3389481   -.0480832
       1600  |  -.2326674    .062589    -3.72   0.000    -.3574973   -.1078375
       2204  |   -.098256    .045544    -2.16   0.034    -.1890906   -.0074214
       2303  |  -.1071964   .0441642    -2.43   0.018    -.1952791   -.0191137
       2306  |  -.1010809   .0459048    -2.20   0.031    -.1926351   -.0095267
       2404  |  -.1049562   .0530454    -1.98   0.052     -.210752    .0008396
       2504  |  -.2137854   .0555335    -3.85   0.000    -.3245434   -.1030273
       2505  |  -.0838675   .0504441    -1.66   0.101     -.184475      .01674
       2606  |  -.1333371    .046314    -2.88   0.005    -.2257075   -.0409667
       2703  |          0  (omitted)
       3005  |  -.3293947    .029104   -11.32   0.000    -.3874408   -.2713486
       3244  |  -.1252373   .0280583    -4.46   0.000    -.1811979   -.0692768
       3323  |   -.037219   .0267184    -1.39   0.168    -.0905073    .0160692
       3333  |  -.0579901   .0363181    -1.60   0.115    -.1304242    .0144441
       3336  |  -.0894816   .0267943    -3.34   0.001    -.1429212   -.0360421
       3343  |  -.0422228   .0394894    -1.07   0.289    -.1209819    .0365363
       3344  |   -.052986    .029656    -1.79   0.078     -.112133    .0061611
       3414  |  -.0121072   .0174581    -0.69   0.490    -.0469264    .0227119
       3433  |   -.145903    .074456    -1.96   0.054    -.2944009    .0025949
       3443  |  -.0764068   .0308358    -2.48   0.016    -.1379069   -.0149067
       3444  |  -.0646076   .0381842    -1.69   0.095    -.1407635    .0115484
       3555  |   .0719486   .0222796     3.23   0.002     .0275133    .1163838
       3654  |          0  (omitted)
             |
       _cons |    .186401    .057221     3.26   0.002     .0722773    .3005248
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0634242   .0247626     2.56   0.013     .0140368    .1128117
------------------------------------------------------------------------------

. reg ame  group1 group3    stats_brw topic_brw t2 t3 i.counter2   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)
note: 2703.counter2 omitted because of collinearity.
note: 3654.counter2 omitted because of collinearity.

Linear regression                               Number of obs     =      1,253
                                                F(15, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0812
                                                Root MSE          =     .19775

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0415219    .033251    -1.25   0.216    -.1078388    .0247951
      group3 |   .0384821   .0160778     2.39   0.019     .0064159    .0705482
   stats_brw |   .0420273   .0170684     2.46   0.016     .0079854    .0760693
   topic_brw |  -.0432624    .016023    -2.70   0.009    -.0752192   -.0113056
          t2 |  -.1233086   .0355297    -3.47   0.001    -.1941704   -.0524469
          t3 |  -.1668027   .0490147    -3.40   0.001    -.2645595   -.0690459
             |
    counter2 |
       1200  |  -.2227916   .0643777    -3.46   0.001    -.3511888   -.0943944
       1300  |  -.2161859   .0584325    -3.70   0.000    -.3327258    -.099646
       1400  |  -.2218466   .0609137    -3.64   0.001    -.3433352   -.1003579
       1500  |  -.1868525   .0722809    -2.59   0.012    -.3310123   -.0426927
       1600  |  -.2312837   .0641969    -3.60   0.001    -.3593205    -.103247
       2204  |  -.0635896   .0375791    -1.69   0.095    -.1385388    .0113597
       2303  |   -.084444   .0384483    -2.20   0.031    -.1611268   -.0077612
       2306  |  -.0775222   .0408045    -1.90   0.062    -.1589042    .0038599
       2404  |   -.082074   .0486481    -1.69   0.096    -.1790996    .0149516
       2504  |  -.1950587   .0486978    -4.01   0.000    -.2921834    -.097934
       2505  |  -.0479866   .0425672    -1.13   0.263    -.1328843    .0369111
       2606  |  -.1002361   .0398341    -2.52   0.014    -.1796828   -.0207894
       2703  |          0  (omitted)
       3005  |   -.320422   .0203343   -15.76   0.000    -.3609774   -.2798665
       3244  |  -.0692968   .0377011    -1.84   0.070    -.1444893    .0058958
       3323  |  -.0023441   .0296847    -0.08   0.937    -.0615485    .0568603
       3333  |  -.0485358   .0225039    -2.16   0.034    -.0934184   -.0036532
       3336  |  -.0793156   .0238787    -3.32   0.001    -.1269403    -.031691
       3343  |    -.03466   .0376902    -0.92   0.361    -.1098306    .0405107
       3344  |   .0044229   .0374894     0.12   0.906    -.0703473    .0791931
       3414  |  -.0206182   .0095386    -2.16   0.034    -.0396423   -.0015941
       3433  |  -.1362453   .0658659    -2.07   0.042    -.2676106     -.00488
       3443  |   -.067703   .0196442    -3.45   0.001    -.1068821    -.028524
       3444  |  -.0635564   .0313644    -2.03   0.047    -.1261106   -.0010022
       3555  |   .0771718    .021014     3.67   0.000     .0352607    .1190829
       3654  |          0  (omitted)
             |
       _cons |   .1930119   .0583585     3.31   0.001     .0766195    .3094042
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0800039   .0323487     2.47   0.016     .0154865    .1445214
------------------------------------------------------------------------------

. reg ame  group3    stats_brw topic_brw t2 t3 i.counter2   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)
note: 2703.counter2 omitted because of collinearity.
note: 3654.counter2 omitted because of collinearity.

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0793
                                                Root MSE          =     .19788

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |   .0478576   .0167015     2.87   0.005     .0145476    .0811676
   stats_brw |    .045558    .017665     2.58   0.012     .0103263    .0807896
   topic_brw |  -.0438772   .0160776    -2.73   0.008     -.075943   -.0118113
          t2 |  -.0849482   .0115346    -7.36   0.000    -.1079532   -.0619432
          t3 |  -.1329995   .0355738    -3.74   0.000    -.2039491   -.0620498
             |
    counter2 |
       1200  |  -.1915936   .0549618    -3.49   0.001    -.3012115   -.0819758
       1300  |  -.2028796   .0561486    -3.61   0.001    -.3148645   -.0908946
       1400  |  -.2036901   .0579141    -3.52   0.001    -.3191961   -.0881841
       1500  |  -.1782211   .0656606    -2.71   0.008    -.3091771   -.0472651
       1600  |  -.2061255   .0568629    -3.62   0.001     -.319535   -.0927159
       2204  |  -.0721626   .0391317    -1.84   0.069    -.1502083    .0058831
       2303  |  -.0946176   .0400304    -2.36   0.021    -.1744557   -.0147795
       2306  |   -.088746   .0446417    -1.99   0.051    -.1777811    .0002891
       2404  |  -.0935241   .0499811    -1.87   0.065    -.1932082      .00616
       2504  |  -.2132851   .0513943    -4.15   0.000    -.3157878   -.1107824
       2505  |  -.0573775   .0442278    -1.30   0.199    -.1455871    .0308322
       2606  |  -.1076851   .0410073    -2.63   0.011    -.1894717   -.0258986
       2703  |          0  (omitted)
       3005  |  -.3320265   .0217206   -15.29   0.000    -.3753469    -.288706
       3244  |  -.1149575   .0204443    -5.62   0.000    -.1557324   -.0741826
       3323  |  -.0274159   .0166231    -1.65   0.104    -.0605697    .0057378
       3333  |  -.0652578   .0313611    -2.08   0.041    -.1278054   -.0027101
       3336  |  -.0863207   .0253941    -3.40   0.001    -.1369677   -.0356737
       3343  |  -.0434785   .0377997    -1.15   0.254    -.1188677    .0319106
       3344  |  -.0422839   .0203116    -2.08   0.041    -.0827941   -.0017737
       3414  |  -.0247314   .0089742    -2.76   0.007    -.0426299   -.0068328
       3433  |  -.1455804   .0626633    -2.32   0.023    -.2705583   -.0206025
       3443  |  -.0791798   .0209852    -3.77   0.000    -.1210334   -.0373261
       3444  |  -.0720738   .0314972    -2.29   0.025     -.134893   -.0092547
       3555  |   .0736474   .0215296     3.42   0.001     .0307081    .1165868
       3654  |          0  (omitted)
             |
       _cons |   .1622203   .0480933     3.37   0.001     .0663013    .2581394
------------------------------------------------------------------------------

. *REGRESSION WITHOUT CONTROLS;
. reg ame  proindex  i.mdegree   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(9, 70)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0393
                                                Root MSE          =     .20083

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0161341   .0066481     2.43   0.018     .0028749    .0293933
             |
     mdegree |
          1  |   .3759459   .0265924    14.14   0.000      .322909    .4289828
          2  |   .3124677   .0199443    15.67   0.000       .27269    .3522453
          3  |   .2846143   .0160169    17.77   0.000     .2526695    .3165591
          4  |   .2928239   .0157121    18.64   0.000      .261487    .3241607
          5  |   .3659008   .0315029    11.61   0.000     .3030702    .4287314
          6  |     .25995    .015963    16.28   0.000     .2281128    .2917873
         20  |   .2791516   .0211825    13.18   0.000     .2369043    .3213988
         33  |   .2984276   .0243497    12.26   0.000     .2498636    .3469916
         34  |   .2824792   .0220163    12.83   0.000     .2385691    .3263894
         35  |    .220165   .0716014     3.07   0.003     .0773606    .3629694
         36  |    .308327   .0155122    19.88   0.000     .2773888    .3392652
         40  |   .2764622   .0263356    10.50   0.000     .2239375    .3289869
             |
       _cons |  -.3646617   .0398886    -9.14   0.000     -.444217   -.2851063
------------------------------------------------------------------------------

. reg ame  p12 p56 i.mdegree   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(10, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0426
                                                Root MSE          =     .20056

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0461591   .0278786    -1.66   0.102    -.1017612     .009443
         p56 |    .038193   .0180861     2.11   0.038     .0021214    .0742646
             |
     mdegree |
          1  |   .3957616   .0333942    11.85   0.000     .3291589    .4623642
          2  |   .3022583   .0180861    16.71   0.000     .2661868    .3383299
          3  |   .2793407   .0171463    16.29   0.000     .2451435    .3135379
          4  |   .2886018    .013619    21.19   0.000     .2614397    .3157639
          5  |   .3644739   .0284178    12.83   0.000     .3077964    .4211514
          6  |   .2603601   .0152574    17.06   0.000     .2299302    .2907899
         20  |   .2702276   .0213762    12.64   0.000      .227594    .3128612
         33  |    .293692   .0213104    13.78   0.000     .2511898    .3361942
         34  |   .2776925    .023153    11.99   0.000     .2315154    .3238696
         35  |   .2123713   .0706415     3.01   0.004     .0714814    .3532613
         36  |   .3115291   .0153019    20.36   0.000     .2810104    .3420478
         40  |   .2756476   .0266218    10.35   0.000      .222552    .3287432
             |
       _cons |    -.30605   .0180861   -16.92   0.000    -.3421216   -.2699784
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0843521   .0333942     2.53   0.014     .0177494    .1509547
------------------------------------------------------------------------------

. reg ame  group1 group3 i.mdegree   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(10, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0513
                                                Root MSE          =     .19964

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0619632   .0335034    -1.85   0.069    -.1287837    .0048573
      group3 |   .0372104   .0186377     2.00   0.050     .0000386    .0743822
             |
     mdegree |
          1  |   .4105831   .0367622    11.17   0.000     .3372633    .4839029
          2  |   .3012758   .0186377    16.16   0.000      .264104    .3384476
          3  |   .2831328   .0193079    14.66   0.000     .2446243    .3216412
          4  |   .2924221   .0137219    21.31   0.000     .2650547    .3197896
          5  |   .3722165   .0281887    13.20   0.000      .315996     .428437
          6  |   .2689258   .0232043    11.59   0.000     .2226462    .3152053
         20  |   .2772767   .0244636    11.33   0.000     .2284856    .3260678
         33  |   .3039825   .0235061    12.93   0.000      .257101     .350864
         34  |   .2679925    .019641    13.64   0.000     .2288198    .3071652
         35  |   .2118801   .0619991     3.42   0.001     .0882268    .3355333
         36  |   .3698544   .0367622    10.06   0.000     .2965345    .4431742
         40  |    .304319     .02385    12.76   0.000     .2567517    .3518862
             |
       _cons |  -.3050674   .0186377   -16.37   0.000    -.3422392   -.2678956
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0991736   .0367622     2.70   0.009     .0258538    .1724934
------------------------------------------------------------------------------

. reg ame  group3 i.mdegree   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(9, 70)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0445
                                                Root MSE          =     .20028

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |    .047939   .0197017     2.43   0.018     .0086452    .0872328
             |
     mdegree |
          1  |   .3593485   .0197017    18.24   0.000     .3200547    .3986423
          2  |   .3120044   .0197017    15.84   0.000     .2727106    .3512982
          3  |   .2815322   .0195172    14.42   0.000     .2426064     .320458
          4  |   .2933605   .0145412    20.17   0.000     .2643589     .322362
          5  |   .3674543    .031081    11.82   0.000     .3054652    .4294434
          6  |   .2796544    .024064    11.62   0.000     .2316602    .3276486
         20  |   .2837138   .0257245    11.03   0.000      .232408    .3350197
         33  |   .3008077   .0208551    14.42   0.000     .2592135    .3424019
         34  |   .2715687   .0220794    12.30   0.000     .2275327    .3156047
         35  |   .2172443   .0582686     3.73   0.000     .1010313    .3334574
         36  |   .3186198   .0197017    16.17   0.000      .279326    .3579136
         40  |    .284066   .0297967     9.53   0.000     .2246383    .3434936
             |
       _cons |   -.315796   .0197017   -16.03   0.000    -.3550898   -.2765022
------------------------------------------------------------------------------

. reg ame  proindex  i.degree1   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 70)

Linear regression                               Number of obs     =      1,233
                                                F(5, 69)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0079
                                                Root MSE          =     .19773

                                (Std. err. adjusted for 70 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0130683   .0064175     2.04   0.046     .0002658    .0258708
             |
     degree1 |
          2  |  -.0843155    .019652    -4.29   0.000    -.1235203   -.0451108
          3  |  -.0803903   .0241209    -3.33   0.001    -.1285101   -.0322704
          4  |  -.0847661   .0206736    -4.10   0.000    -.1260088   -.0435234
          5  |   -.036795   .0327037    -1.13   0.264     -.102037     .028447
          6  |  -.0946775   .0195194    -4.85   0.000    -.1336176   -.0557375
          7  |  -.0807799   .0096262    -8.39   0.000    -.0999837   -.0615762
             |
       _cons |   .0174159   .0128349     1.36   0.179    -.0081891    .0430209
------------------------------------------------------------------------------

. reg ame  p12 p56 i.degree1   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 70)

Linear regression                               Number of obs     =      1,233
                                                F(6, 69)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0105
                                                Root MSE          =     .19755

                                (Std. err. adjusted for 70 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0374314   .0260956    -1.43   0.156    -.0894906    .0146279
         p56 |   .0309294   .0200235     1.54   0.127    -.0090164    .0708752
             |
     degree1 |
          2  |  -.1051249   .0286417    -3.67   0.000    -.1622635   -.0479863
          3  |   -.100727   .0293085    -3.44   0.001    -.1591959   -.0422582
          4  |  -.1046498   .0270192    -3.87   0.000    -.1585516    -.050748
          5  |  -.0564165   .0342842    -1.65   0.104    -.1248115    .0119786
          6  |  -.1104012   .0290235    -3.80   0.000    -.1683014    -.052501
          7  |  -.0986089   .0260956    -3.78   0.000    -.1506681   -.0465496
             |
       _cons |   .0809839   .0260956     3.10   0.003     .0289246    .1330431
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0683608   .0316597     2.16   0.034     .0052014    .1315202
------------------------------------------------------------------------------

. reg ame  group1 group3 i.degree1   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 70)

Linear regression                               Number of obs     =      1,233
                                                F(6, 69)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0174
                                                Root MSE          =     .19686

                                (Std. err. adjusted for 70 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0470012   .0312176    -1.51   0.137    -.1092786    .0152762
      group3 |   .0305319   .0202274     1.51   0.136    -.0098206    .0708844
             |
     degree1 |
          2  |  -.0945952   .0216416    -4.37   0.000     -.137769   -.0514214
          3  |   -.104834   .0322005    -3.26   0.002    -.1690723   -.0405957
          4  |  -.1128069   .0320245    -3.52   0.001     -.176694   -.0489197
          5  |  -.0608999   .0399229    -1.53   0.132    -.1405439    .0187442
          6  |  -.1148161   .0339874    -3.38   0.001    -.1826191   -.0470132
          7  |  -.1081787   .0312176    -3.47   0.001    -.1704561   -.0459013
             |
       _cons |   .0905537   .0312176     2.90   0.005     .0282763    .1528311
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0775331   .0343039     2.26   0.027     .0090987    .1459675
------------------------------------------------------------------------------

. reg ame  group3 i.degree1   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 70)

Linear regression                               Number of obs     =      1,233
                                                F(7, 69)          >   99999.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0125
                                                Root MSE          =     .19727

                                (Std. err. adjusted for 70 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |   .0406165   .0204589     1.99   0.051     -.000198     .081431
             |
     degree1 |
          2  |  -.0632611   .0180398    -3.51   0.001    -.0992495   -.0272727
          3  |  -.0690595    .016003    -4.32   0.000    -.1009847   -.0371343
          4  |  -.0735871   .0200002    -3.68   0.000    -.1134863   -.0336879
          5  |  -.0253159   .0351237    -0.72   0.473    -.0953858    .0447541
          6  |  -.0678149   .0134334    -5.05   0.000    -.0946138   -.0410161
          7  |  -.0611775   4.61e-09 -1.3e+07   0.000    -.0611775   -.0611775
             |
       _cons |   .0435525          .        .       .            .           .
------------------------------------------------------------------------------

. reg ame  proindex  i.counter2   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0478
                                                Root MSE          =     .20107

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0179907   .0082095     2.19   0.032     .0016174     .034364
             |
    counter2 |
       1200  |  -.0653349   .0082095    -7.96   0.000    -.0817082   -.0489615
       1300  |  -.1022757   .0345018    -2.96   0.004    -.1710874   -.0334641
       1400  |  -.0907485   .0217366    -4.17   0.000    -.1341009   -.0473962
       1500  |  -.0331154   .0101662    -3.26   0.002    -.0533911   -.0128396
       1600  |  -.1349772    .016419    -8.22   0.000    -.1677239   -.1022306
       2204  |  -.0809072   .0205237    -3.94   0.000    -.1218405   -.0399738
       2303  |  -.1040316   .0298286    -3.49   0.001     -.163523   -.0445403
       2306  |  -.0828753   .0301152    -2.75   0.008    -.1429381   -.0228124
       2404  |  -.0802028   .0294091    -2.73   0.008    -.1388574   -.0215482
       2504  |  -.1723579   .0246285    -7.00   0.000    -.2214779    -.123238
       2505  |  -.0519278   .0205237    -2.53   0.014    -.0928612   -.0109945
       2606  |  -.1053693   .0205237    -5.13   0.000    -.1463026   -.0644359
       2703  |  -.0881636   .0123142    -7.16   0.000    -.1127236   -.0636036
       3005  |  -.3833723    .032838   -11.67   0.000    -.4488656    -.317879
       3244  |  -.1304962    .010946   -11.92   0.000    -.1523273   -.1086651
       3323  |  -.0623897   .0117657    -5.30   0.000    -.0858556   -.0389238
       3333  |   -.086635   .0474417    -1.83   0.072    -.1812544    .0079844
       3336  |  -.1085467   .0136825    -7.93   0.000    -.1358356   -.0812578
       3343  |  -.0853066   .0427416    -2.00   0.050     -.170552   -.0000612
       3344  |  -.0707133   .0136825    -5.17   0.000    -.0980021   -.0434244
       3414  |  -.0746665   .0151253    -4.94   0.000     -.104833   -.0445001
       3433  |   -.160113   .0732456    -2.19   0.032    -.3061966   -.0140293
       3443  |  -.1440632    .027365    -5.26   0.000    -.1986409   -.0894854
       3444  |  -.1073829   .0239385    -4.49   0.000    -.1551268    -.059639
       3555  |   .0696235   .0082095     8.48   0.000     .0532501    .0859968
       3654  |   -.074041   .0136825    -5.41   0.000    -.1013299   -.0467521
             |
       _cons |   .0075711    .016419     0.46   0.646    -.0251756    .0403178
------------------------------------------------------------------------------

. reg ame  p12 p56 i.counter2   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0517
                                                Root MSE          =     .20074

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0342833   .0300969    -1.14   0.259    -.0943097     .025743
         p56 |   .0529148   .0233496     2.27   0.027     .0063455    .0994841
             |
    counter2 |
       1200  |  -.0816275   .0300969    -2.71   0.008    -.1416538   -.0216011
       1300  |  -.1252584   .0446941    -2.80   0.007    -.2143979   -.0361189
       1400  |  -.1067464   .0286852    -3.72   0.000    -.1639572   -.0495355
       1500  |  -.0412617   .0152105    -2.71   0.008     -.071598   -.0109254
       1600  |  -.1332791   .0300969    -4.43   0.000    -.1933055   -.0732528
       2204  |  -.0966711   .0326297    -2.96   0.004    -.1617491   -.0315932
       2303  |  -.1222489   .0401351    -3.05   0.003    -.2022958   -.0422019
       2306  |  -.1073703   .0378511    -2.84   0.006    -.1828618   -.0318787
       2404  |  -.0996708   .0411861    -2.42   0.018    -.1818139   -.0175278
       2504  |   -.205584   .0386804    -5.31   0.000    -.2827297   -.1284382
       2505  |  -.0676918   .0326297    -2.07   0.042    -.1327697   -.0026139
       2606  |  -.1211332   .0326297    -3.71   0.000    -.1862111   -.0560553
       2703  |  -.0954608   .0300969    -3.17   0.002    -.1554872   -.0354345
       3005  |  -.3986076   .0386804   -10.31   0.000    -.4757533   -.3214619
       3244  |  -.1470024   .0217531    -6.76   0.000    -.1903877   -.1036171
       3323  |  -.0802002   .0275574    -2.91   0.005    -.1351617   -.0252388
       3333  |  -.1031702      .0439    -2.35   0.022     -.190726   -.0156144
       3336  |  -.1128455   .0300969    -3.75   0.000    -.1728719   -.0528192
       3343  |  -.1028933   .0459529    -2.24   0.028    -.1945435   -.0112431
       3344  |  -.0812226   .0217531    -3.73   0.000    -.1246078   -.0378373
       3414  |  -.0878913   .0276594    -3.18   0.002    -.1430562   -.0327264
       3433  |  -.1788754   .0760485    -2.35   0.021    -.3305493   -.0272015
       3443  |  -.1712923   .0386804    -4.43   0.000     -.248438   -.0941466
       3444  |  -.1173262   .0329771    -3.56   0.001    -.1830968   -.0515555
       3555  |   .0533309   .0300969     1.77   0.081    -.0066955    .1133572
       3654  |  -.0783398   .0300969    -2.60   0.011    -.1383662   -.0183135
             |
       _cons |   .0778358   .0300969     2.59   0.012     .0178095    .1378622
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0871981   .0386804     2.25   0.027     .0100524    .1643438
------------------------------------------------------------------------------

. reg ame  group1 group3 i.counter2   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0605
                                                Root MSE          =     .19981

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0633068   .0405936    -1.56   0.123    -.1442683    .0176546
      group3 |   .0450746   .0179932     2.51   0.015     .0091884    .0809608
             |
    counter2 |
       1200  |   -.110651   .0405936    -2.73   0.008    -.1916125   -.0296896
       1300  |  -.1422051   .0497222    -2.86   0.006    -.2413729   -.0430372
       1400  |  -.1252611   .0356995    -3.51   0.001    -.1964616   -.0540606
       1500  |  -.0557734   .0239247    -2.33   0.023    -.1034897   -.0080572
       1600  |  -.1623027   .0405936    -4.00   0.000    -.2432641   -.0813412
       2204  |  -.0992373   .0405936    -2.44   0.017    -.1801987   -.0182758
       2303  |  -.1371081   .0463748    -2.96   0.004    -.2295997   -.0446165
       2306  |   -.119245   .0424984    -2.81   0.006    -.2040053   -.0344846
       2404  |  -.1139954   .0481589    -2.37   0.021    -.2100452   -.0179455
       2504  |  -.2267673   .0450529    -5.03   0.000    -.3166223   -.1369122
       2505  |  -.0702579   .0405936    -1.73   0.088    -.1512194    .0107035
       2606  |  -.1236993   .0405936    -3.05   0.003    -.2046608   -.0427379
       2703  |  -.1244843   .0405936    -3.07   0.003    -.2054458   -.0435229
       3005  |  -.4197909   .0450529    -9.32   0.000     -.509646   -.3299359
       3244  |  -.1065086   1.07e-08 -1.0e+07   0.000    -.1065086   -.1065086
       3323  |  -.0700555   .0274467    -2.55   0.013    -.1247963   -.0153147
       3333  |  -.1259698   .0498943    -2.52   0.014    -.2254807   -.0264588
       3336  |  -.1418691   .0405936    -3.49   0.001    -.2228305   -.0609076
       3343  |    -.12669   .0517266    -2.45   0.017    -.2298554   -.0235246
       3344  |  -.0407288   1.18e-08 -3.5e+06   0.000    -.0407288   -.0407287
       3414  |  -.1275277   .0447257    -2.85   0.006    -.2167304   -.0383251
       3433  |  -.2039788    .072227    -2.82   0.006     -.348031   -.0599266
       3443  |  -.1924756   .0450529    -4.27   0.000    -.2823307   -.1026205
       3444  |  -.1512487   .0424698    -3.56   0.001     -.235952   -.0665454
       3555  |   .0243073   .0405936     0.60   0.551    -.0566541    .1052688
       3654  |  -.1073633   .0405936    -2.64   0.010    -.1883248   -.0264019
             |
       _cons |   .1068593   .0405936     2.63   0.010     .0258979    .1878208
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1083814   .0450529     2.41   0.019     .0185264    .1982365
------------------------------------------------------------------------------

. reg ame  group3 i.counter2   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0556
                                                Root MSE          =     .20025

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |    .060631   .0221244     2.74   0.008     .0165052    .1047568
             |
    counter2 |
       1200  |  -.0473442          .        .       .            .           .
       1300  |  -.1040047   .0254646    -4.08   0.000    -.1547922   -.0532172
       1400  |  -.0839494   .0170993    -4.91   0.000    -.1180529    -.049846
       1500  |    -.02412   .0101278    -2.38   0.020    -.0443193   -.0039207
       1600  |  -.0989958          .        .       .            .           .
       2204  |  -.0359304          .        .       .            .           .
       2303  |  -.0780439   .0237423    -3.29   0.002    -.1253964   -.0306914
       2306  |  -.0637163   .0111435    -5.72   0.000    -.0859413   -.0414913
       2404  |  -.0573556   .0300241    -1.91   0.060    -.1172367    .0025255
       2504  |  -.1790168   .0221244    -8.09   0.000    -.2231426   -.1348911
       2505  |  -.0069511          .        .       .            .           .
       2606  |  -.0603925          .        .       .            .           .
       2703  |  -.0611775          .        .       .            .           .
       3005  |  -.3720405   .0221244   -16.82   0.000    -.4161663   -.3279147
       3244  |  -.1065086          .        .       .            .           .
       3323  |  -.0384021   .0043203    -8.89   0.000    -.0470186   -.0297856
       3333  |  -.0831723    .035763    -2.33   0.023    -.1544993   -.0118452
       3336  |  -.0785622          .        .       .            .           .
       3343  |  -.0737541   .0297441    -2.48   0.016    -.1330769   -.0144314
       3344  |  -.0407288          .        .       .            .           .
       3414  |  -.0719991   .0238832    -3.01   0.004    -.1196327   -.0243655
       3433  |  -.1484502   .0543265    -2.73   0.008     -.256801   -.0400993
       3443  |  -.1447252   .0221244    -6.54   0.000    -.1888509   -.1005994
       3444  |  -.0957201   .0111235    -8.61   0.000    -.1179052   -.0735349
       3555  |   .0876142          .        .       .            .           .
       3654  |  -.0440565          .        .       .            .           .
             |
       _cons |   .0435525          .        .       .            .           .
------------------------------------------------------------------------------

. *WEIGHTED BY PSCORE/NMODEL;
. *USING MDEGREE EDUCATION VECTOR;
. reg ame  proindex    stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0631
                                                Root MSE          =     .20018

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0113823    .005618     2.03   0.047     .0001776    .0225871
   stats_brw |   .0391653   .0181567     2.16   0.034     .0029529    .0753776
   topic_brw |  -.0414328    .017194    -2.41   0.019    -.0757251   -.0071404
          t2 |   .0087255   .0146966     0.59   0.555    -.0205859    .0380369
          t3 |   .0119852   .0246031     0.49   0.628    -.0370841    .0610544
             |
     mdegree |
          1  |   .4575084   .0520426     8.79   0.000     .3537127     .561304
          2  |    .273634   .0211764    12.92   0.000      .231399    .3158689
          3  |   .2734949   .0210531    12.99   0.000     .2315059    .3154839
          4  |   .2703089   .0198575    13.61   0.000     .2307043    .3099135
          5  |   .3236678    .035149     9.21   0.000     .2535654    .3937703
          6  |   .2509542    .023532    10.66   0.000     .2040211    .2978872
         20  |   .2786136   .0329363     8.46   0.000     .2129241     .344303
         33  |   .2737398   .0245488    11.15   0.000     .2247788    .3227008
         34  |   .2888588   .0206671    13.98   0.000     .2476396     .330078
         35  |   .1780349   .0740114     2.41   0.019     .0304238     .325646
         36  |   .2734497   .0179724    15.21   0.000     .2376048    .3092946
         40  |   .2599358   .0397411     6.54   0.000     .1806747     .339197
             |
       _cons |  -.3367484    .026792   -12.57   0.000    -.3901834   -.2833134
------------------------------------------------------------------------------

. reg ame  p12 p56    stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0666
                                                Root MSE          =     .19989

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0516617   .0261416    -1.98   0.052    -.1037995    .0004762
         p56 |   .0259294   .0193446     1.34   0.184    -.0126521     .064511
   stats_brw |     .03755    .017038     2.20   0.031     .0035689    .0715311
   topic_brw |  -.0419997   .0167832    -2.50   0.015    -.0754728   -.0085266
          t2 |   .0001315   .0161841     0.01   0.994    -.0321467    .0324098
          t3 |   .0080016   .0233349     0.34   0.733    -.0385384    .0545415
             |
     mdegree |
          1  |   .4805021   .0595689     8.07   0.000     .3616956    .5993086
          2  |   .2608113   .0289467     9.01   0.000     .2030788    .3185437
          3  |   .2730819    .021381    12.77   0.000     .2304389    .3157249
          4  |   .2689926   .0191167    14.07   0.000     .2308654    .3071197
          5  |   .3261398   .0300943    10.84   0.000     .2661185    .3861611
          6  |   .2533505   .0233359    10.86   0.000     .2068085    .2998925
         20  |   .2760177   .0346695     7.96   0.000     .2068716    .3451637
         33  |   .2721161   .0232172    11.72   0.000     .2258109    .3184214
         34  |   .2861176    .022347    12.80   0.000     .2415479    .3306874
         35  |   .1731348   .0737648     2.35   0.022     .0260155    .3202541
         36  |   .2829707    .013312    21.26   0.000     .2564207    .3095207
         40  |    .261034   .0383023     6.82   0.000     .1846426    .3374255
             |
       _cons |   -.290692   .0263835   -11.02   0.000    -.3433123   -.2380718
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0775911    .026312     2.95   0.004     .0251135    .1300687
------------------------------------------------------------------------------

. reg ame  group1 group3    stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0739
                                                Root MSE          =     .19911

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0612237   .0335927    -1.82   0.073    -.1282222    .0057748
      group3 |   .0289914   .0145722     1.99   0.051     -.000072    .0580549
   stats_brw |   .0339442   .0157978     2.15   0.035     .0024366    .0654519
   topic_brw |  -.0407224   .0158489    -2.57   0.012    -.0723322   -.0091127
          t2 |   .0048151   .0162263     0.30   0.768    -.0275472    .0371774
          t3 |   .0073001   .0234384     0.31   0.756    -.0394462    .0540465
             |
     mdegree |
          1  |   .4826737   .0606109     7.96   0.000     .3617891    .6035582
          2  |   .2641638   .0268537     9.84   0.000     .2106058    .3177219
          3  |   .2773822   .0205898    13.47   0.000     .2363171    .3184474
          4  |   .2706116   .0180237    15.01   0.000     .2346644    .3065587
          5  |    .335401   .0292041    11.48   0.000     .2771553    .3936468
          6  |   .2626786   .0257244    10.21   0.000     .2113729    .3139843
         20  |   .2766724   .0349883     7.91   0.000     .2068904    .3464545
         33  |   .2860567   .0247775    11.55   0.000     .2366395    .3354739
         34  |   .2763643     .01433    19.29   0.000     .2477841    .3049445
         35  |   .1778665   .0667929     2.66   0.010     .0446524    .3110807
         36  |    .341529    .032623    10.47   0.000     .2764644    .4065935
         40  |   .2877489    .023661    12.16   0.000     .2405585    .3349392
             |
       _cons |  -.2939027   .0274166   -10.72   0.000    -.3485835    -.239222
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0902151   .0340102     2.65   0.010      .022384    .1580462
------------------------------------------------------------------------------

. reg ame  group3    stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0681
                                                Root MSE          =     .19965

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |   .0425567   .0161913     2.63   0.011     .0102641    .0748492
   stats_brw |   .0371753   .0166199     2.24   0.028     .0040279    .0703227
   topic_brw |  -.0400893   .0157721    -2.54   0.013    -.0715457   -.0086329
          t2 |   .0237072   .0155839     1.52   0.133    -.0073739    .0547883
          t3 |   .0144569   .0227108     0.64   0.526    -.0308385    .0597522
             |
     mdegree |
          1  |   .4520275   .0571492     7.91   0.000      .338047    .5660079
          2  |   .2856604   .0218783    13.06   0.000     .2420254    .3292953
          3  |   .2720781    .023606    11.53   0.000     .2249974    .3191588
          4  |   .2700212    .018722    14.42   0.000     .2326813    .3073611
          5  |   .3329414   .0311552    10.69   0.000     .2708042    .3950785
          6  |    .270186   .0257111    10.51   0.000     .2189068    .3214652
         20  |   .2737801   .0387783     7.06   0.000     .1964393    .3511209
         33  |   .2831327   .0212578    13.32   0.000     .2407354    .3255299
         34  |   .2827972   .0173193    16.33   0.000      .248255    .3173395
         35  |   .1830432   .0610361     3.00   0.004     .0613105    .3047758
         36  |   .2908544    .014531    20.02   0.000     .2618732    .3198357
         40  |   .2743366   .0407135     6.74   0.000     .1931361     .355537
             |
       _cons |  -.3140019   .0234006   -13.42   0.000     -.360673   -.2673308
------------------------------------------------------------------------------

. *USING EDUCATION OF LEAD RESEARCHER;
. reg ame  proindex    stats_brw topic_brw t2 t3 i.degree1   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 295.1660390009483)

Linear regression                               Number of obs     =      1,233
                                                F(9, 69)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0353
                                                Root MSE          =     .19642

                                (Std. err. adjusted for 70 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0100801   .0054665     1.84   0.069    -.0008253    .0209854
   stats_brw |   .0425048   .0184336     2.31   0.024     .0057307    .0792788
   topic_brw |  -.0468568   .0170866    -2.74   0.008    -.0809436     -.01277
          t2 |   .0021569   .0145893     0.15   0.883     -.026948    .0312619
          t3 |   .0024863   .0189039     0.13   0.896    -.0352259    .0401986
             |
     degree1 |
          2  |  -.2042556    .061432    -3.32   0.001    -.3268092    -.081702
          3  |  -.1794746   .0546107    -3.29   0.002    -.2884199   -.0705293
          4  |  -.1935194   .0556715    -3.48   0.001     -.304581   -.0824577
          5  |  -.1653187   .0691166    -2.39   0.019    -.3032026   -.0274348
          6  |  -.1837653   .0554128    -3.32   0.001    -.2943108   -.0732199
          7  |  -.0978283   .0218648    -4.47   0.000    -.1414474   -.0542092
             |
       _cons |   .1308473   .0504199     2.60   0.012     .0302622    .2314323
------------------------------------------------------------------------------

. reg ame  p12 p56    stats_brw topic_brw t2 t3 i.degree1   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 295.1660390009483)

Linear regression                               Number of obs     =      1,233
                                                F(10, 69)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0386
                                                Root MSE          =     .19617

                                (Std. err. adjusted for 70 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0365511   .0262686    -1.39   0.169    -.0889555    .0158533
         p56 |   .0286305   .0204019     1.40   0.165    -.0120702    .0693312
   stats_brw |   .0416248   .0175665     2.37   0.021     .0065806     .076669
   topic_brw |  -.0470472   .0164539    -2.86   0.006    -.0798718   -.0142226
          t2 |  -.0034663   .0154463    -0.22   0.823    -.0342809    .0273483
          t3 |   .0010255   .0182676     0.06   0.955    -.0354174    .0374685
             |
     degree1 |
          2  |  -.2234647   .0652677    -3.42   0.001    -.3536702   -.0932591
          3  |  -.1987844   .0593643    -3.35   0.001     -.317213   -.0803557
          4  |  -.2134301   .0599855    -3.56   0.001    -.3330979   -.0937624
          5  |  -.1825262    .071274    -2.56   0.013     -.324714   -.0403384
          6  |  -.1986042   .0587265    -3.38   0.001    -.3157603    -.081448
          7  |  -.1126854   .0294576    -3.83   0.000    -.1714517   -.0539191
             |
       _cons |   .1846951   .0559442     3.30   0.002     .0730896    .2963007
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0651816   .0262805     2.48   0.016     .0127534    .1176097
------------------------------------------------------------------------------

. reg ame  group1 group3    stats_brw topic_brw t2 t3 i.degree1   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 295.1660390009483)

Linear regression                               Number of obs     =      1,233
                                                F(10, 69)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0445
                                                Root MSE          =     .19556

                                (Std. err. adjusted for 70 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0455751    .030479    -1.50   0.139    -.1063789    .0152288
      group3 |   .0273533   .0184874     1.48   0.144    -.0095281    .0642347
   stats_brw |   .0390703   .0161456     2.42   0.018     .0068606    .0712799
   topic_brw |  -.0463559   .0157374    -2.95   0.004    -.0777511   -.0149607
          t2 |   .0008766   .0166439     0.05   0.958    -.0323271    .0340804
          t3 |   .0027761   .0179279     0.15   0.877    -.0329891    .0385412
             |
     degree1 |
          2  |   -.208657   .0596418    -3.50   0.001    -.3276392   -.0896748
          3  |  -.1961148    .057695    -3.40   0.001    -.3112131   -.0810165
          4  |  -.2160082   .0605189    -3.57   0.001    -.3367401   -.0952762
          5  |   -.180248   .0712512    -2.53   0.014    -.3223904   -.0381057
          6  |  -.1973131    .058959    -3.35   0.001    -.3149331   -.0796931
          7  |  -.1238816   .0333074    -3.72   0.000     -.190328   -.0574352
             |
       _cons |   .1860909   .0578567     3.22   0.002     .0706699    .3015119
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0729284   .0302743     2.41   0.019     .0125328     .133324
------------------------------------------------------------------------------

. reg ame  group3    stats_brw topic_brw t2 t3 i.degree1   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 295.1660390009483)

Linear regression                               Number of obs     =      1,233
                                                F(9, 69)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0405
                                                Root MSE          =     .19589

                                (Std. err. adjusted for 70 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |    .038545    .017977     2.14   0.036     .0026819    .0744082
   stats_brw |   .0419971   .0170122     2.47   0.016     .0080587    .0759355
   topic_brw |  -.0466258   .0157725    -2.96   0.004    -.0780909   -.0151606
          t2 |   .0135518   .0163717     0.83   0.411    -.0191087    .0462124
          t3 |   .0059317   .0180211     0.33   0.743    -.0300194    .0418827
             |
     degree1 |
          2  |  -.1913999   .0575312    -3.33   0.001    -.3061715   -.0766283
          3  |  -.1778736   .0536258    -3.32   0.001    -.2848542   -.0708929
          4  |  -.1928948   .0563639    -3.42   0.001    -.3053377   -.0804519
          5  |  -.1617459   .0676043    -2.39   0.019    -.2966129   -.0268789
          6  |  -.1663909   .0505257    -3.29   0.002    -.2671869    -.065595
          7  |  -.0937161   .0211422    -4.43   0.000    -.1358937   -.0515385
             |
       _cons |   .1495431   .0459806     3.25   0.002     .0578143    .2412718
------------------------------------------------------------------------------

. *USING ALL POSSIBLE COMBINATIONS OF EDUCATION AMONG THREE RESEARCHERS;
. reg ame  proindex    stats_brw topic_brw t2 t3 i.counter2   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 299.8024025072654)
note: 2703.counter2 omitted because of collinearity.
note: 3654.counter2 omitted because of collinearity.

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0754
                                                Root MSE          =     .19984

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0127838   .0066939     1.91   0.060    -.0005668    .0261343
   stats_brw |   .0490596    .020099     2.44   0.017     .0089733    .0891458
   topic_brw |  -.0455477    .018004    -2.53   0.014    -.0814556   -.0096398
          t2 |  -.1067569   .0170823    -6.25   0.000    -.1408264   -.0726874
          t3 |  -.1621926   .0416149    -3.90   0.000     -.245191   -.0791942
             |
    counter2 |
       1200  |  -.2149421   .0623086    -3.45   0.001    -.3392127   -.0906716
       1300  |  -.2097818   .0593351    -3.54   0.001    -.3281218   -.0914417
       1400  |  -.2162393   .0609686    -3.55   0.001    -.3378374   -.0946413
       1500  |  -.1953655    .080142    -2.44   0.017    -.3552036   -.0355274
       1600  |  -.2448523   .0672971    -3.64   0.001    -.3790721   -.1106325
       2204  |   -.093059   .0448352    -2.08   0.042      -.18248   -.0036381
       2303  |  -.0999432   .0420115    -2.38   0.020    -.1837325   -.0161539
       2306  |  -.0882172   .0420215    -2.10   0.039    -.1720264    -.004408
       2404  |  -.0998683   .0486249    -2.05   0.044    -.1968477   -.0028889
       2504  |  -.1932046   .0489527    -3.95   0.000    -.2908376   -.0955716
       2505  |  -.0791925   .0504974    -1.57   0.121    -.1799064    .0215214
       2606  |  -.1282212   .0464864    -2.76   0.007    -.2209354   -.0355071
       2703  |          0  (omitted)
       3005  |  -.3153097   .0187159   -16.85   0.000    -.3526375    -.277982
       3244  |  -.1142285   .0235027    -4.86   0.000    -.1611031   -.0673538
       3323  |  -.0263899   .0212617    -1.24   0.219    -.0687951    .0160152
       3333  |   -.046295   .0333672    -1.39   0.170    -.1128438    .0202538
       3336  |  -.0915248   .0288701    -3.17   0.002    -.1491043   -.0339452
       3343  |  -.0367579   .0376055    -0.98   0.332    -.1117598     .038244
       3344  |  -.0462517   .0231236    -2.00   0.049    -.0923703   -.0001331
       3414  |  -.0020787   .0217549    -0.10   0.924    -.0454675    .0413101
       3433  |  -.1415138   .0744079    -1.90   0.061    -.2899158    .0068881
       3443  |  -.0531089   .0170721    -3.11   0.003    -.0871582   -.0190597
       3444  |   -.061281   .0419012    -1.46   0.148    -.1448503    .0222883
       3555  |   .0788503   .0253431     3.11   0.003     .0283051    .1293956
       3654  |          0  (omitted)
             |
       _cons |   .1467108   .0567198     2.59   0.012     .0335868    .2598349
------------------------------------------------------------------------------

. reg ame  p12 p56    stats_brw topic_brw t2 t3 i.counter2   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 299.8024025072654)
note: 2703.counter2 omitted because of collinearity.
note: 3654.counter2 omitted because of collinearity.

Linear regression                               Number of obs     =      1,253
                                                F(15, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0794
                                                Root MSE          =     .19949

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0174028   .0303587    -0.57   0.568    -.0779514    .0431457
         p56 |    .049196   .0254582     1.93   0.057    -.0015788    .0999708
   stats_brw |   .0486365   .0189039     2.57   0.012     .0109339    .0863391
   topic_brw |  -.0448266   .0172507    -2.60   0.011     -.079232   -.0104212
          t2 |  -.1049119   .0305422    -3.43   0.001    -.1658264   -.0439974
          t3 |  -.1575561   .0465774    -3.38   0.001    -.2504518   -.0646605
             |
    counter2 |
       1200  |  -.2181253   .0648978    -3.36   0.001    -.3475599   -.0886908
       1300  |  -.2289502   .0623131    -3.67   0.000    -.3532298   -.1046706
       1400  |  -.2271094   .0630223    -3.60   0.001    -.3528034   -.1014154
       1500  |  -.1965265   .0733883    -2.68   0.009    -.3428948   -.0501581
       1600  |  -.2366004   .0631411    -3.75   0.000    -.3625314   -.1106693
       2204  |   -.104084   .0483303    -2.15   0.035    -.2004756   -.0076923
       2303  |  -.1121326   .0460895    -2.43   0.018    -.2040553   -.0202099
       2306  |  -.1086758    .050369    -2.16   0.034    -.2091336    -.008218
       2404  |  -.1154649   .0547796    -2.11   0.039    -.2247193   -.0062104
       2504  |  -.2222722   .0595779    -3.73   0.000    -.3410966   -.1034478
       2505  |  -.0900538   .0534065    -1.69   0.096    -.1965698    .0164622
       2606  |  -.1389204   .0490163    -2.83   0.006    -.2366803   -.0411605
       2703  |          0  (omitted)
       3005  |   -.334625   .0310114   -10.79   0.000    -.3964752   -.2727748
       3244  |  -.1286078   .0301409    -4.27   0.000    -.1887218   -.0684937
       3323  |  -.0400098   .0283072    -1.41   0.162    -.0964668    .0164472
       3333  |  -.0615136   .0395363    -1.56   0.124    -.1403663    .0173391
       3336  |  -.0913802   .0277486    -3.29   0.002    -.1467231   -.0360373
       3343  |  -.0527323   .0369916    -1.43   0.158    -.1265098    .0210452
       3344  |  -.0566117   .0316862    -1.79   0.078    -.1198078    .0065845
       3414  |   -.013654   .0173118    -0.79   0.433    -.0481814    .0208733
       3433  |  -.1569408   .0736112    -2.13   0.037    -.3037537    -.010128
       3443  |  -.0813922    .032045    -2.54   0.013     -.145304   -.0174805
       3444  |  -.0688016    .038736    -1.78   0.080    -.1460581    .0084549
       3555  |   .0709761    .022953     3.09   0.003     .0251977    .1167545
       3654  |          0  (omitted)
             |
       _cons |   .1887519   .0572432     3.30   0.002     .0745839    .3029198
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0665988   .0261173     2.55   0.013     .0145095    .1186882
------------------------------------------------------------------------------

. reg ame  group1 group3    stats_brw topic_brw t2 t3 i.counter2   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 299.8024025072654)
note: 2703.counter2 omitted because of collinearity.
note: 3654.counter2 omitted because of collinearity.

Linear regression                               Number of obs     =      1,253
                                                F(15, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0846
                                                Root MSE          =     .19892

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0465556   .0357235    -1.30   0.197    -.1178039    .0246928
      group3 |   .0410208   .0159901     2.57   0.012     .0091295    .0729121
   stats_brw |   .0422499   .0173219     2.44   0.017     .0077024    .0767974
   topic_brw |  -.0435459    .016351    -2.66   0.010     -.076157   -.0109348
          t2 |  -.1284257   .0380644    -3.37   0.001    -.2043428   -.0525086
          t3 |  -.1727965   .0512266    -3.37   0.001    -.2749648   -.0706282
             |
    counter2 |
       1200  |  -.2285513   .0665401    -3.43   0.001    -.3612612   -.0958413
       1300  |   -.223799   .0608149    -3.68   0.000    -.3450906   -.1025075
       1400  |  -.2285557   .0637721    -3.58   0.001    -.3557451   -.1013663
       1500  |  -.1890119   .0736327    -2.57   0.012    -.3358676   -.0421562
       1600  |  -.2366407   .0657521    -3.60   0.001    -.3677791   -.1055022
       2204  |    -.06404   .0379993    -1.69   0.096    -.1398273    .0117472
       2303  |  -.0852904   .0386098    -2.21   0.030    -.1622953   -.0082856
       2306  |   -.080597   .0429479    -1.88   0.065    -.1662539    .0050599
       2404  |  -.0889384   .0484145    -1.84   0.070    -.1854979    .0076212
       2504  |  -.1981146   .0497024    -3.99   0.000     -.297243   -.0989862
       2505  |  -.0485134   .0431025    -1.13   0.264    -.1344786    .0374518
       2606  |  -.1007898   .0405336    -2.49   0.015    -.1816314   -.0199481
       2703  |          0  (omitted)
       3005  |  -.3224738   .0204606   -15.76   0.000    -.3632813   -.2816663
       3244  |  -.0639717   .0399164    -1.60   0.114    -.1435825     .015639
       3323  |   .0002638   .0313332     0.01   0.993    -.0622283    .0627559
       3333  |  -.0480546   .0228257    -2.11   0.039     -.093579   -.0025303
       3336  |  -.0788896   .0237259    -3.33   0.001    -.1262094   -.0315698
       3343  |    -.04269     .03433    -1.24   0.218     -.111159     .025779
       3344  |   .0098208   .0394029     0.25   0.804    -.0687658    .0884075
       3414  |  -.0220041   .0091672    -2.40   0.019    -.0402875   -.0037207
       3433  |  -.1436654    .064271    -2.24   0.029    -.2718499   -.0154808
       3443  |  -.0695842   .0193356    -3.60   0.001    -.1081478   -.0310206
       3444  |  -.0656978   .0308101    -2.13   0.036    -.1271466    -.004249
       3555  |   .0774103   .0214255     3.61   0.001     .0346785    .1201421
       3654  |          0  (omitted)
             |
       _cons |   .1985872    .060468     3.28   0.002     .0779875    .3191869
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0875764   .0353716     2.48   0.016     .0170299    .1581229
------------------------------------------------------------------------------

. reg ame  group3    stats_brw topic_brw t2 t3 i.counter2   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 299.8024025072654)
note: 2703.counter2 omitted because of collinearity.
note: 3654.counter2 omitted because of collinearity.

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0822
                                                Root MSE          =     .19911

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |   .0517297   .0174286     2.97   0.004     .0169696    .0864899
   stats_brw |   .0467043   .0180888     2.58   0.012     .0106274    .0827812
   topic_brw |  -.0446323   .0163778    -2.73   0.008    -.0772969   -.0119678
          t2 |  -.0857116    .011726    -7.31   0.000    -.1090982   -.0623249
          t3 |   -.135887   .0363967    -3.73   0.000     -.208478    -.063296
             |
    counter2 |
       1200  |  -.1951162   .0563013    -3.47   0.001    -.3074056   -.0828267
       1300  |  -.2099571   .0584543    -3.59   0.001    -.3265404   -.0933737
       1400  |  -.2095182   .0607314    -3.45   0.001    -.3306431   -.0883933
       1500  |  -.1814437   .0667564    -2.72   0.008    -.3145851   -.0483023
       1600  |  -.2098307   .0576421    -3.64   0.001    -.3247943   -.0948672
       2204  |  -.0747419   .0400317    -1.87   0.066    -.1545826    .0050988
       2303  |  -.0972046   .0406922    -2.39   0.020    -.1783625   -.0160467
       2306  |  -.0947523   .0479568    -1.98   0.052    -.1903992    .0008947
       2404  |  -.1034059   .0504893    -2.05   0.044    -.2041037    -.002708
       2504  |  -.2199384      .0537    -4.10   0.000    -.3270396   -.1128371
       2505  |  -.0602786    .045263    -1.33   0.187    -.1505528    .0299956
       2606  |  -.1102946   .0420121    -2.63   0.011    -.1940851    -.026504
       2703  |          0  (omitted)
       3005  |  -.3358916   .0229331   -14.65   0.000    -.3816302    -.290153
       3244  |  -.1157413   .0209326    -5.53   0.000    -.1574902   -.0739925
       3323  |  -.0279987   .0169339    -1.65   0.103    -.0617724     .005775
       3333  |  -.0678965   .0346409    -1.96   0.054    -.1369856    .0011926
       3336  |  -.0873939   .0258071    -3.39   0.001    -.1388645   -.0359233
       3343  |   -.052537   .0351598    -1.49   0.140    -.1226611    .0175871
       3344  |  -.0430921   .0207084    -2.08   0.041    -.0843937   -.0017906
       3414  |   -.026776   .0089682    -2.99   0.004    -.0446625   -.0088894
       3433  |   -.154278   .0609416    -2.53   0.014    -.2758222   -.0327338
       3443  |  -.0826343   .0218015    -3.79   0.000    -.1261161   -.0391525
       3444  |  -.0756457   .0315405    -2.40   0.019    -.1385513   -.0127401
       3555  |   .0728553   .0220604     3.30   0.002     .0288572    .1168534
       3654  |          0  (omitted)
             |
       _cons |   .1653984   .0491862     3.36   0.001     .0672995    .2634972
------------------------------------------------------------------------------

. *REGRESSION WITHOUT CONTROLS;
. reg ame  proindex  i.mdegree   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(9, 70)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0417
                                                Root MSE          =     .20213

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0165196   .0068167     2.42   0.018     .0029242     .030115
             |
     mdegree |
          1  |    .377488   .0272667    13.84   0.000     .3231064    .4318696
          2  |   .3136242     .02045    15.34   0.000      .272838    .3544104
          3  |   .2823959   .0158217    17.85   0.000     .2508406    .3139512
          4  |   .2901771   .0146005    19.87   0.000     .2610572     .319297
          5  |    .369058   .0328444    11.24   0.000     .3035518    .4345641
          6  |   .2590765   .0161957    16.00   0.000     .2267752    .2913778
         20  |   .2799737   .0216708    12.92   0.000     .2367528    .3231947
         33  |    .295762   .0234094    12.63   0.000     .2490735    .3424505
         34  |   .2825494   .0220659    12.80   0.000     .2385404    .3265585
         35  |   .2132004   .0711937     2.99   0.004     .0712091    .3551917
         36  |   .3092265   .0159056    19.44   0.000     .2775039    .3409492
         40  |   .2798462     .02619    10.69   0.000      .227612    .3320804
             |
       _cons |  -.3669748      .0409    -8.97   0.000    -.4485472   -.2854023
------------------------------------------------------------------------------

. reg ame  p12 p56 i.mdegree   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(10, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0457
                                                Root MSE          =     .20178

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |    -.04977   .0289211    -1.72   0.090    -.1074513    .0079112
         p56 |   .0395124   .0185812     2.13   0.037     .0024533    .0765716
             |
     mdegree |
          1  |    .400692   .0362892    11.04   0.000     .3283155    .4730684
          2  |   .3035778   .0185812    16.34   0.000     .2665187    .3406369
          3  |   .2777273   .0169658    16.37   0.000     .2438901    .3115646
          4  |   .2863602   .0128143    22.35   0.000     .2608029    .3119175
          5  |   .3684004   .0299896    12.28   0.000      .308588    .4282128
          6  |   .2603881   .0158951    16.38   0.000     .2286863    .2920898
         20  |   .2709299   .0218338    12.41   0.000     .2273839     .314476
         33  |   .2916596   .0205299    14.21   0.000      .250714    .3326051
         34  |   .2780673   .0234541    11.86   0.000     .2312897     .324845
         35  |   .2055081    .070183     2.93   0.005     .0655325    .3454838
         36  |   .3136124   .0166263    18.86   0.000     .2804523    .3467725
         40  |   .2798688   .0268073    10.44   0.000     .2264034    .3333343
             |
       _cons |  -.3073694   .0185812   -16.54   0.000    -.3444286   -.2703103
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0892825   .0362892     2.46   0.016      .016906    .1616589
------------------------------------------------------------------------------

. reg ame  group1 group3 i.mdegree   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(10, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0557
                                                Root MSE          =     .20073

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   -.066503   .0362169    -1.84   0.071    -.1387353    .0057293
      group3 |   .0384169   .0179585     2.14   0.036     .0025997     .074234
             |
     mdegree |
          1  |   .4163294   .0397054    10.49   0.000     .3371394    .4955194
          2  |   .3024822   .0179585    16.84   0.000     .2666651    .3382994
          3  |   .2824257   .0192076    14.70   0.000     .2441173    .3207342
          4  |   .2892715   .0124894    23.16   0.000     .2643621    .3141808
          5  |   .3762556   .0287046    13.11   0.000     .3190062    .4335051
          6  |   .2681627   .0225749    11.88   0.000     .2231385    .3131868
         20  |    .277725   .0245036    11.33   0.000     .2288541    .3265959
         33  |   .3032615   .0237254    12.78   0.000     .2559426    .3505804
         34  |   .2675095    .019347    13.83   0.000     .2289232    .3060958
         35  |   .2059456   .0614033     3.35   0.001     .0834805    .3284106
         36  |   .3756006   .0397054     9.46   0.000     .2964106    .4547906
         40  |   .3073028    .023819    12.90   0.000     .2597973    .3548082
             |
       _cons |  -.3062739   .0179585   -17.05   0.000     -.342091   -.2704567
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1049199   .0397054     2.64   0.010     .0257299    .1841099
------------------------------------------------------------------------------

. reg ame  group3 i.mdegree   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(9, 70)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0476
                                                Root MSE          =     .20151

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |     .05008   .0198156     2.53   0.014     .0105591    .0896009
             |
     mdegree |
          1  |   .3614895   .0198156    18.24   0.000     .3219686    .4010104
          2  |   .3141454   .0198156    15.85   0.000     .2746244    .3536663
          3  |   .2803665   .0195647    14.33   0.000     .2413459    .3193872
          4  |    .290361   .0133053    21.82   0.000     .2638244    .3168976
          5  |   .3711577   .0321199    11.56   0.000     .3070965    .4352189
          6  |   .2798258   .0240753    11.62   0.000      .231809    .3278426
         20  |   .2846082   .0260554    10.92   0.000     .2326422    .3365741
         33  |   .2999405   .0203353    14.75   0.000      .259383    .3404979
         34  |   .2712863   .0220314    12.31   0.000     .2273461    .3152265
         35  |   .2122323   .0574354     3.70   0.000      .097681    .3267835
         36  |   .3207608   .0198156    16.19   0.000     .2812399    .3602817
         40  |   .2888901   .0295758     9.77   0.000     .2299031    .3478771
             |
       _cons |   -.317937   .0198156   -16.04   0.000    -.3574579   -.2784161
------------------------------------------------------------------------------

. reg ame  proindex  i.degree1   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 295.1660390009483)

Linear regression                               Number of obs     =      1,233
                                                F(5, 69)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0082
                                                Root MSE          =     .19883

                                (Std. err. adjusted for 70 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0132572   .0066378     2.00   0.050     .0000151    .0264993
             |
     degree1 |
          2  |  -.0826561   .0192301    -4.30   0.000     -.121019   -.0442932
          3  |  -.0835013   .0250642    -3.33   0.001    -.1335031   -.0334995
          4  |  -.0890047   .0215898    -4.12   0.000    -.1320752   -.0459341
          5  |  -.0359529   .0339811    -1.06   0.294    -.1037433    .0318375
          6  |  -.0950408    .020296    -4.68   0.000    -.1355302   -.0545514
          7  |  -.0810633   .0099568    -8.14   0.000    -.1009264   -.0612001
             |
       _cons |   .0170382   .0132757     1.28   0.204    -.0094461    .0435224
------------------------------------------------------------------------------

. reg ame  p12 p56 i.degree1   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 295.1660390009483)

Linear regression                               Number of obs     =      1,233
                                                F(6, 69)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0113
                                                Root MSE          =      .1986

                                (Std. err. adjusted for 70 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0395193   .0273663    -1.44   0.153    -.0941135    .0150749
         p56 |   .0323065   .0206336     1.57   0.122    -.0088563    .0734694
             |
     degree1 |
          2  |  -.1056263   .0297797    -3.55   0.001    -.1650353   -.0462174
          3  |  -.1058044   .0326472    -3.24   0.002    -.1709337    -.040675
          4  |   -.111059   .0291621    -3.81   0.000    -.1692357   -.0528823
          5  |  -.0575255   .0358709    -1.60   0.113    -.1290861    .0140351
          6  |  -.1123739   .0307652    -3.65   0.001    -.1737489    -.050999
          7  |  -.1006968   .0273663    -3.68   0.000     -.155291   -.0461026
             |
       _cons |   .0830718   .0273663     3.04   0.003     .0284776     .137666
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0718259   .0346175     2.07   0.042     .0027658     .140886
------------------------------------------------------------------------------

. reg ame  group1 group3 i.degree1   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 295.1660390009483)

Linear regression                               Number of obs     =      1,233
                                                F(6, 69)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0194
                                                Root MSE          =     .19779

                                (Std. err. adjusted for 70 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0505307     .03432    -1.47   0.145    -.1189973    .0179358
      group3 |   .0319444   .0198673     1.61   0.112    -.0076897    .0715785
             |
     degree1 |
          2  |  -.0967526   .0243796    -3.97   0.000    -.1453885   -.0481166
          3  |  -.1103772   .0358347    -3.08   0.003    -.1818656   -.0388889
          4  |  -.1211058   .0350559    -3.45   0.001    -.1910404   -.0511711
          5  |  -.0631659   .0425712    -1.48   0.142    -.1480932    .0217613
          6  |  -.1187615   .0371103    -3.20   0.002    -.1927945   -.0447285
          7  |  -.1117082     .03432    -3.25   0.002    -.1801748   -.0432417
             |
       _cons |   .0940832     .03432     2.74   0.008     .0256167    .1625498
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0824751   .0374769     2.20   0.031     .0077106    .1572395
------------------------------------------------------------------------------

. reg ame  group3 i.degree1   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 295.1660390009483)

Linear regression                               Number of obs     =      1,233
                                                F(7, 69)          >   99999.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0136
                                                Root MSE          =     .19829

                                (Std. err. adjusted for 70 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |   .0429055   .0206717     2.08   0.042     .0016666    .0841445
             |
     degree1 |
          2  |  -.0615428   .0170159    -3.62   0.001    -.0954886    -.027597
          3  |  -.0722208   .0166081    -4.35   0.000     -.105353   -.0390886
          4  |  -.0789687   .0195496    -4.04   0.000    -.1179691   -.0399684
          5  |  -.0250108   .0367131    -0.68   0.498    -.0982515    .0482298
          6  |  -.0682308   .0141119    -4.83   0.000    -.0963833   -.0400782
          7  |  -.0611775   9.75e-09 -6.3e+06   0.000    -.0611775   -.0611775
             |
       _cons |   .0435525   1.07e-08  4.1e+06   0.000     .0435525    .0435525
------------------------------------------------------------------------------

. reg ame  proindex  i.counter2   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(12, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0502
                                                Root MSE          =     .20237

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |    .018827   .0083279     2.26   0.027     .0022176    .0354365
             |
    counter2 |
       1200  |  -.0661712   .0083279    -7.95   0.000    -.0827806   -.0495618
       1300  |  -.1055712   .0353077    -2.99   0.004    -.1759903   -.0351522
       1400  |  -.0936435   .0222491    -4.21   0.000     -.138018   -.0492689
       1500  |  -.0334364   .0107408    -3.11   0.003    -.0548583   -.0120146
       1600  |  -.1366499   .0166558    -8.20   0.000    -.1698688   -.1034311
       2204  |   -.082998   .0208197    -3.99   0.000    -.1245216   -.0414744
       2303  |  -.1068126   .0290145    -3.68   0.000    -.1646802    -.048945
       2306  |  -.0837115   .0303389    -2.76   0.007    -.1442205   -.0232025
       2404  |  -.0861835    .028329    -3.04   0.003    -.1426839   -.0296831
       2504  |   -.174867   .0249836    -7.00   0.000    -.2246953   -.1250387
       2505  |  -.0540187   .0208197    -2.59   0.012    -.0955423   -.0124951
       2606  |  -.1074601   .0208197    -5.16   0.000    -.1489837   -.0659365
       2703  |  -.0894181   .0124918    -7.16   0.000    -.1143322   -.0645039
       3005  |  -.3867177   .0333115   -11.61   0.000    -.4531554   -.3202799
       3244  |  -.1316113   .0111038   -11.85   0.000    -.1537572   -.1094654
       3323  |  -.0635768   .0121205    -5.25   0.000    -.0877503   -.0394033
       3333  |  -.0935864   .0493339    -1.90   0.062    -.1919798    .0048071
       3336  |  -.1098818   .0138798    -7.92   0.000    -.1375641   -.0821994
       3343  |  -.0947313   .0417884    -2.27   0.026    -.1780757    -.011387
       3344  |  -.0721072   .0138798    -5.20   0.000    -.0997895   -.0444248
       3414  |  -.0770682   .0153916    -5.01   0.000    -.1077658   -.0463705
       3433  |  -.1696115   .0724404    -2.34   0.022    -.3140893   -.0251337
       3443  |   -.146851   .0277596    -5.29   0.000    -.2022158   -.0914862
       3444  |  -.1100742   .0237185    -4.64   0.000    -.1573792   -.0627692
       3555  |   .0687871   .0083279     8.26   0.000     .0521777    .0853966
       3654  |   -.075981   .0138798    -5.47   0.000    -.1036634   -.0482986
             |
       _cons |   .0058984   .0166558     0.35   0.724    -.0273205    .0391173
------------------------------------------------------------------------------

. reg ame  p12 p56 i.counter2   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0547
                                                Root MSE          =     .20198

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0393481   .0304535    -1.29   0.201    -.1000858    .0213896
         p56 |   .0546257   .0240102     2.28   0.026     .0067389    .1025124
             |
    counter2 |
       1200  |  -.0866923   .0304535    -2.85   0.006    -.1474299   -.0259546
       1300  |  -.1313337   .0470915    -2.79   0.007    -.2252548   -.0374126
       1400  |  -.1119416   .0305639    -3.66   0.000    -.1728993   -.0509839
       1500  |  -.0439024   .0153509    -2.86   0.006    -.0745187    -.013286
       1600  |  -.1383439   .0304535    -4.54   0.000    -.1990816   -.0776063
       2204  |  -.1025913     .03431    -2.99   0.004    -.1710204   -.0341623
       2303  |  -.1284494   .0405377    -3.17   0.002    -.2092994   -.0475994
       2306  |  -.1127398   .0400306    -2.82   0.006    -.1925783   -.0329013
       2404  |  -.1101905   .0418189    -2.63   0.010    -.1935956   -.0267853
       2504  |  -.2123596   .0414147    -5.13   0.000    -.2949585   -.1297607
       2505  |   -.073612     .03431    -2.15   0.035    -.1420411   -.0051829
       2606  |  -.1270534     .03431    -3.70   0.000    -.1954825   -.0586244
       2703  |  -.1005256   .0304535    -3.30   0.002    -.1612633   -.0397879
       3005  |  -.4053833   .0414147    -9.79   0.000    -.4879822   -.3227843
       3244  |  -.1509492   .0228733    -6.60   0.000    -.1965686   -.1053298
       3323  |  -.0850048   .0288667    -2.94   0.004    -.1425776   -.0274319
       3333  |  -.1127837    .047731    -2.36   0.021    -.2079802   -.0175871
       3336  |  -.1178514   .0304535    -3.87   0.000    -.1785891   -.0571138
       3343  |  -.1150893   .0462526    -2.49   0.015    -.2073371   -.0228415
       3344  |  -.0851694   .0228733    -3.72   0.000    -.1307887     -.03955
       3414  |  -.0937934   .0287028    -3.27   0.002    -.1510393   -.0365475
       3433  |  -.1921219   .0761678    -2.52   0.014    -.3440338   -.0402101
       3443  |  -.1780679   .0414147    -4.30   0.000    -.2606668    -.095469
       3444  |  -.1234852   .0339454    -3.64   0.001    -.1911871   -.0557832
       3555  |   .0482661   .0304535     1.58   0.117    -.0124716    .1090037
       3654  |  -.0839507   .0304535    -2.76   0.007    -.1446884    -.023213
             |
       _cons |   .0829006   .0304535     2.72   0.008     .0221629    .1436383
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0939738   .0414147     2.27   0.026     .0113748    .1765727
------------------------------------------------------------------------------

. reg ame  group1 group3 i.counter2   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0652
                                                Root MSE          =     .20085

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0708817    .042702    -1.66   0.101    -.1560481    .0142847
      group3 |   .0461137   .0171374     2.69   0.009     .0119342    .0802931
             |
    counter2 |
       1200  |  -.1182259    .042702    -2.77   0.007    -.2033923   -.0330595
       1300  |  -.1499613   .0519917    -2.88   0.005    -.2536554   -.0462672
       1400  |   -.132189   .0382552    -3.46   0.001    -.2084867   -.0558913
       1500  |  -.0592911    .025774    -2.30   0.024    -.1106957   -.0078865
       1600  |  -.1698776    .042702    -3.98   0.000     -.255044   -.0847111
       2204  |  -.1068121    .042702    -2.50   0.015    -.1919786   -.0216457
       2303  |  -.1454114   .0478189    -3.04   0.003    -.2407832   -.0500397
       2306  |  -.1268708   .0450809    -2.81   0.006    -.2167818   -.0369598
       2404  |  -.1276369   .0494763    -2.58   0.012    -.2263143   -.0289595
       2504  |  -.2353812   .0477144    -4.93   0.000    -.3305445   -.1402179
       2505  |  -.0778328    .042702    -1.82   0.073    -.1629992    .0073336
       2606  |  -.1312742    .042702    -3.07   0.003    -.2164406   -.0461078
       2703  |  -.1320592    .042702    -3.09   0.003    -.2172256   -.0468928
       3005  |  -.4284049   .0477144    -8.98   0.000    -.5235682   -.3332416
       3244  |  -.1065086          .        .       .            .           .
       3323  |  -.0741665   .0302797    -2.45   0.017    -.1345574   -.0137755
       3333  |  -.1355364   .0527084    -2.57   0.012      -.24066   -.0304127
       3336  |  -.1493851    .042702    -3.50   0.001    -.2345515   -.0642187
       3343  |  -.1408814   .0524679    -2.69   0.009    -.2455253   -.0362375
       3344  |  -.0407288          .        .       .            .           .
       3414  |  -.1370587   .0472987    -2.90   0.005    -.2313929   -.0427244
       3433  |  -.2183106   .0730478    -2.99   0.004    -.3639999   -.0726213
       3443  |  -.2010895   .0477144    -4.21   0.000    -.2962528   -.1059263
       3444  |   -.159682   .0448211    -3.56   0.001    -.2490749   -.0702891
       3555  |   .0167324    .042702     0.39   0.696     -.068434    .1018989
       3654  |  -.1154843    .042702    -2.70   0.009    -.2006507   -.0303179
             |
       _cons |   .1144342    .042702     2.68   0.009     .0292678    .1996006
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .1169954   .0477144     2.45   0.017     .0218321    .2121587
------------------------------------------------------------------------------

. reg ame  group3 i.counter2   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0589
                                                Root MSE          =     .20145

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |    .064052    .023011     2.78   0.007      .018158    .1099459
             |
    counter2 |
       1200  |  -.0473442          .        .       .            .           .
       1300  |   -.107123   .0260205    -4.12   0.000    -.1590193   -.0552267
       1400  |  -.0859707   .0177888    -4.83   0.000    -.1214494    -.050492
       1500  |  -.0247001   .0102926    -2.40   0.019     -.045228   -.0041722
       1600  |  -.0989958          .        .       .            .           .
       2204  |  -.0359304          .        .       .            .           .
       2303  |  -.0787544   .0226529    -3.48   0.001    -.1239343   -.0335746
       2306  |  -.0654446   .0121302    -5.40   0.000    -.0896374   -.0412518
       2404  |  -.0650428   .0283479    -2.29   0.025     -.121581   -.0085047
       2504  |  -.1824378    .023011    -7.93   0.000    -.2283317   -.1365438
       2505  |  -.0069511          .        .       .            .           .
       2606  |  -.0603925          .        .       .            .           .
       2703  |  -.0611775          .        .       .            .           .
       3005  |  -.3754615    .023011   -16.32   0.000    -.4213554   -.3295675
       3244  |  -.1065086          .        .       .            .           .
       3323  |  -.0383361   .0043197    -8.87   0.000    -.0469516   -.0297207
       3333  |  -.0893159    .038504    -2.32   0.023    -.1661096   -.0125221
       3336  |  -.0785034          .        .       .            .           .
       3343  |  -.0812653   .0270941    -3.00   0.004    -.1353027   -.0272278
       3344  |  -.0407288          .        .       .            .           .
       3414  |  -.0754019   .0253492    -2.97   0.004    -.1259593   -.0248446
       3433  |   -.155698   .0524826    -2.97   0.004    -.2603711   -.0510248
       3443  |  -.1481461    .023011    -6.44   0.000    -.1940401   -.1022522
       3444  |  -.0974271   .0110665    -8.80   0.000    -.1194986   -.0753556
       3555  |   .0876142          .        .       .            .           .
       3654  |  -.0446026          .        .       .            .           .
             |
       _cons |   .0435525          .        .       .            .           .
------------------------------------------------------------------------------

. log close;
      name:  <unnamed>
       log:  C:/GitHub/ideology_specification/code/Log Files/03_Robustness.log
  log type:  text
 closed on:   8 Apr 2025, 20:45:24
--------------------------------------------------------------------------------------------------------------
