--------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/GitHub/ideology_specification/code/Log Files/03_Table_3.log
  log type:  text
 opened on:  19 Dec 2024, 07:32:11

. clear matrix;

. clear mata;

. *KEY ROBUSTNESS CHECKS OF MAIN RESULT;
. *SENSITIVITY TO DEFINITION OF EDUCATION VECTOR;
. *AND TO DEFINITION OF IMMIGRATION IDEOLOGY;
. *USES THE MODEL LEVEL DATA CREATED IN 02_Table_1_2_5_6.DO;
. use "$workd/data/newmodel.dta", clear;

. *BRW MEASURE OF IMMIGRATION SENTIMENT;
. tabulate proindex;

   proindex |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         30        2.39        2.39
          2 |         24        1.92        4.31
   2.333333 |         12        0.96        5.27
   2.666667 |         24        1.92        7.18
          3 |         48        3.83       11.01
   3.333333 |         20        1.60       12.61
        3.5 |         80        6.38       18.99
   3.666667 |        128       10.22       29.21
          4 |         74        5.91       35.12
   4.333333 |        160       12.77       47.89
        4.5 |         98        7.82       55.71
   4.666667 |         52        4.15       59.86
          5 |        144       11.49       71.35
   5.333333 |         28        2.23       73.58
        5.5 |        122        9.74       83.32
   5.666667 |         18        1.44       84.76
          6 |        191       15.24      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. *P34 AND P56 ARE % OF TEAM THAT HAVE CODES 3-4, OR 5-6, IN IDEOLOGY MEASURE;
. tabulate p12;

        p12 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,079       86.11       86.11
   .3333333 |        108        8.62       94.73
   .6666667 |         12        0.96       95.69
          1 |         54        4.31      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. tabulate p34;

        p34 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        566       45.17       45.17
   .3333333 |        117        9.34       54.51
         .5 |        140       11.17       65.68
   .6666667 |        184       14.68       80.37
          1 |        246       19.63      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. tabulate p56;

        p56 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        338       26.98       26.98
   .3333333 |        200       15.96       42.94
         .5 |        140       11.17       54.11
   .6666667 |        103        8.22       62.33
          1 |        472       37.67      100.00
------------+-----------------------------------
      Total |      1,253      100.00

. *WEIGHTED BY 1/NMODEL;
. *USING MDEGREE EDUCATION VECTOR;
. reg ame  proindex    stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0617
                                                Root MSE          =     .19878

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0108737   .0056998     1.91   0.061    -.0004943    .0222416
   stats_brw |   .0384442   .0176848     2.17   0.033     .0031731    .0737154
   topic_brw |  -.0410347   .0168102    -2.44   0.017    -.0745616   -.0075078
          t2 |   .0093166   .0148151     0.63   0.531    -.0202313    .0388644
          t3 |    .012971    .023955     0.54   0.590    -.0348057    .0607477
             |
     mdegree |
          1  |   .4545994   .0506109     8.98   0.000     .3536592    .5555396
          2  |   .2734257   .0208276    13.13   0.000     .2318864    .3149651
          3  |   .2742735   .0197721    13.87   0.000     .2348392    .3137077
          4  |   .2734748   .0198543    13.77   0.000     .2338766     .313073
          5  |   .3211411   .0343558     9.35   0.000     .2526206    .3896615
          6  |   .2508457   .0218756    11.47   0.000     .2072162    .2944751
         20  |   .2775809   .0320121     8.67   0.000     .2137348    .3414271
         33  |   .2778045   .0274814    10.11   0.000     .2229947    .3326143
         34  |   .2877794   .0198662    14.49   0.000     .2481574    .3274014
         35  |   .1854928    .074674     2.48   0.015     .0365602    .3344255
         36  |   .2727957   .0187552    14.55   0.000     .2353896    .3102018
         40  |   .2540658   .0402514     6.31   0.000     .1737869    .3343448
             |
       _cons |  -.3348635    .027718   -12.08   0.000    -.3901454   -.2795817
------------------------------------------------------------------------------

. reg ame  p12 p56    stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0648
                                                Root MSE          =     .19853

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0503799   .0252584    -1.99   0.050    -.1007562   -3.69e-06
         p56 |   .0234775   .0193443     1.21   0.229    -.0151034    .0620584
   stats_brw |    .037143   .0166456     2.23   0.029     .0039445    .0703415
   topic_brw |  -.0418866   .0165861    -2.53   0.014    -.0749666   -.0088066
          t2 |   .0011216   .0162283     0.07   0.945    -.0312447    .0334879
          t3 |   .0087989   .0224903     0.39   0.697    -.0360565    .0536543
             |
     mdegree |
          1  |   .4764457    .058257     8.18   0.000     .3602557    .5926357
          2  |   .2592396   .0291878     8.88   0.000     .2010265    .3174528
          3  |   .2730058   .0203962    13.39   0.000     .2323269    .3136846
          4  |   .2712758    .019403    13.98   0.000     .2325777    .3099739
          5  |   .3222416   .0299225    10.77   0.000      .262563    .3819201
          6  |   .2516072   .0224161    11.22   0.000     .2068996    .2963148
         20  |   .2742799   .0338085     8.11   0.000     .2068511    .3417088
         33  |   .2751979   .0261161    10.54   0.000      .223111    .3272847
         34  |   .2847723   .0215027    13.24   0.000     .2418866     .327658
         35  |   .1800135   .0745509     2.41   0.018     .0313264    .3287007
         36  |   .2812386   .0133591    21.05   0.000     .2545947    .3078825
         40  |   .2544392   .0381109     6.68   0.000     .1784294    .3304489
             |
       _cons |   -.289131   .0262677   -11.01   0.000    -.3415202   -.2367418
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0738574   .0242554     3.04   0.003     .0254815    .1222334
------------------------------------------------------------------------------

. reg ame  group1 group3    stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  cluster(teamid)
> ;
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0710
                                                Root MSE          =     .19788

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0572476   .0306365    -1.87   0.066    -.1183502    .0038549
      group3 |   .0272754   .0147459     1.85   0.069    -.0021343    .0566851
   stats_brw |   .0341011   .0156414     2.18   0.033     .0029053     .065297
   topic_brw |  -.0406176   .0155892    -2.61   0.011    -.0717092    -.009526
          t2 |   .0063886   .0160686     0.40   0.692    -.0256592    .0384365
          t3 |   .0079756   .0229581     0.35   0.729    -.0378128     .053764
             |
     mdegree |
          1  |   .4781822   .0593708     8.05   0.000     .3597709    .5965935
          2  |   .2632302   .0264194     9.96   0.000     .2105383     .315922
          3  |   .2761151   .0200568    13.77   0.000     .2361131    .3161171
          4  |   .2729049   .0187597    14.55   0.000     .2354899    .3103199
          5  |   .3308497   .0292276    11.32   0.000     .2725571    .3891424
          6  |    .260214    .024832    10.48   0.000     .2106882    .3097399
         20  |   .2746755   .0345734     7.94   0.000      .205721      .34363
         33  |   .2877058    .026143    11.01   0.000     .2355652    .3398464
         34  |   .2763302   .0143112    19.31   0.000     .2477874     .304873
         35  |   .1839868   .0675415     2.72   0.008     .0492795    .3186942
         36  |   .3356711   .0298616    11.24   0.000      .276114    .3952282
         40  |   .2824761   .0246236    11.47   0.000      .233366    .3315862
             |
       _cons |  -.2928377   .0268678   -10.90   0.000    -.3464238   -.2392515
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |    .084523    .031027     2.72   0.008     .0226417    .1464043
------------------------------------------------------------------------------

. reg ame  group3    stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0661
                                                Root MSE          =     .19832

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |   .0400274   .0158054     2.53   0.014     .0085044    .0715503
   stats_brw |   .0366518   .0162719     2.25   0.027     .0041984    .0691051
   topic_brw |  -.0397766   .0154963    -2.57   0.012    -.0706829   -.0088703
          t2 |   .0240041   .0153349     1.57   0.122    -.0065805    .0545887
          t3 |   .0152444   .0221752     0.69   0.494    -.0289826    .0594714
             |
     mdegree |
          1  |     .44895   .0562755     7.98   0.000     .3367121    .5611879
          2  |   .2841817   .0217026    13.09   0.000     .2408972    .3274663
          3  |   .2718073    .022274    12.20   0.000     .2273833    .3162314
          4  |   .2728777   .0193381    14.11   0.000     .2343091    .3114464
          5  |   .3293892   .0305213    10.79   0.000     .2685162    .3902621
          6  |   .2677352   .0246948    10.84   0.000     .2184829    .3169874
         20  |   .2726566   .0376655     7.24   0.000      .197535    .3477781
         33  |   .2852015   .0236278    12.07   0.000     .2380774    .3323256
         34  |   .2822144   .0168685    16.73   0.000     .2485712    .3158576
         35  |   .1885997    .062192     3.03   0.003     .0645617    .3126376
         36  |   .2887058    .015035    19.20   0.000     .2587195    .3186922
         40  |   .2671305    .040801     6.55   0.000     .1857555    .3485056
             |
       _cons |  -.3123935   .0230896   -13.53   0.000    -.3584442   -.2663428
------------------------------------------------------------------------------

. *USING EDUCATION OF LEAD RESEARCHER;
. reg ame  proindex    stats_brw topic_brw t2 t3 i.degree1   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 70)

Linear regression                               Number of obs     =      1,233
                                                F(9, 69)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0359
                                                Root MSE          =     .19524

                                (Std. err. adjusted for 70 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0095931   .0055387     1.73   0.088    -.0014562    .0206425
   stats_brw |   .0416155   .0180203     2.31   0.024      .005666    .0775649
   topic_brw |  -.0460384    .016865    -2.73   0.008    -.0796831   -.0123937
          t2 |   .0029558   .0145499     0.20   0.840    -.0260704     .031982
          t3 |   .0036165   .0183121     0.20   0.844    -.0329151    .0401481
             |
     degree1 |
          2  |  -.2030969   .0601928    -3.37   0.001    -.3231782   -.0830156
          3  |   -.175415   .0512933    -3.42   0.001    -.2777422   -.0730877
          4  |  -.1869689   .0532886    -3.51   0.001    -.2932767   -.0806611
          5  |  -.1637469   .0671427    -2.44   0.017    -.2976929   -.0298009
          6  |  -.1830976   .0536545    -3.41   0.001    -.2901354   -.0760598
          7  |  -.0974148   .0206561    -4.72   0.000    -.1386226    -.056207
             |
       _cons |   .1294839   .0502671     2.58   0.012     .0292038     .229764
------------------------------------------------------------------------------

. reg ame  p12 p56    stats_brw topic_brw t2 t3 i.degree1   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 70)

Linear regression                               Number of obs     =      1,233
                                                F(10, 69)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0388
                                                Root MSE          =     .19503

                                (Std. err. adjusted for 70 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0381363   .0252555    -1.51   0.136    -.0885197    .0122471
         p56 |     .02503   .0198658     1.26   0.212    -.0146013    .0646612
   stats_brw |    .040765   .0171548     2.38   0.020     .0065421    .0749879
   topic_brw |  -.0464575   .0163604    -2.84   0.006    -.0790956   -.0138194
          t2 |   -.002785    .015222    -0.18   0.855    -.0331522    .0275821
          t3 |   .0015574   .0175157     0.09   0.929    -.0333855    .0365003
             |
     degree1 |
          2  |   -.223008   .0644211    -3.46   0.001    -.3515246   -.0944914
          3  |  -.1951917    .056482    -3.46   0.001    -.3078702   -.0825132
          4  |  -.2073102   .0581069    -3.57   0.001    -.3232303   -.0913902
          5  |  -.1816074   .0699204    -2.60   0.011    -.3210949     -.04212
          6  |  -.1996729    .057861    -3.45   0.001    -.3151025   -.0842433
          7  |  -.1143903    .028728    -3.98   0.000    -.1717011   -.0570795
             |
       _cons |   .1839093   .0552725     3.33   0.001     .0736437     .294175
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0631662    .024808     2.55   0.013     .0136756    .1126569
------------------------------------------------------------------------------

. reg ame  group1 group3    stats_brw topic_brw t2 t3 i.degree1   [aw=1/nmodel] ,  cluster(teamid)
> ;
(sum of wgt is 70)

Linear regression                               Number of obs     =      1,233
                                                F(10, 69)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0437
                                                Root MSE          =     .19453

                                (Std. err. adjusted for 70 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   -.043466    .027782    -1.56   0.122    -.0988897    .0119576
      group3 |   .0244965   .0179855     1.36   0.178    -.0113836    .0603767
   stats_brw |   .0386263   .0160641     2.40   0.019     .0065794    .0706732
   topic_brw |  -.0457203   .0156916    -2.91   0.005    -.0770242   -.0144164
          t2 |   .0019794   .0161702     0.12   0.903    -.0302793     .034238
          t3 |   .0034142   .0172629     0.20   0.844    -.0310243    .0378527
             |
     degree1 |
          2  |  -.2065965   .0583217    -3.54   0.001    -.3229451   -.0902479
          3  |  -.1919239   .0552211    -3.48   0.001    -.3020869   -.0817609
          4  |  -.2080353   .0583243    -3.57   0.001    -.3243891   -.0916816
          5  |  -.1783682   .0696412    -2.56   0.013    -.3172985   -.0394378
          6  |  -.1964367   .0572542    -3.43   0.001    -.3106557   -.0822178
          7  |  -.1227422   .0309445    -3.97   0.000    -.1844747   -.0610096
             |
       _cons |     .18294   .0556672     3.29   0.002      .071887     .293993
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0679626    .027715     2.45   0.017     .0126726    .1232525
------------------------------------------------------------------------------

. reg ame  group3    stats_brw topic_brw t2 t3 i.degree1   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 70)

Linear regression                               Number of obs     =      1,233
                                                F(9, 69)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0401
                                                Root MSE          =     .19481

                                (Std. err. adjusted for 70 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |   .0353046   .0173479     2.04   0.046     .0006965    .0699127
   stats_brw |   .0409844   .0167019     2.45   0.017      .007665    .0743037
   topic_brw |  -.0456834   .0156959    -2.91   0.005    -.0769958    -.014371
          t2 |   .0141243   .0159325     0.89   0.378    -.0176601    .0459087
          t3 |   .0065916   .0174762     0.38   0.707    -.0282725    .0414557
             |
     degree1 |
          2  |  -.1904049   .0571194    -3.33   0.001    -.3043551   -.0764548
          3  |  -.1734055   .0512501    -3.38   0.001    -.2756466   -.0711643
          4  |  -.1851165   .0545578    -3.39   0.001    -.2939563   -.0762767
          5  |  -.1594048    .065997    -2.42   0.018    -.2910652   -.0277444
          6  |   -.166297   .0498829    -3.33   0.001    -.2658107   -.0667834
          7  |  -.0937445   .0202378    -4.63   0.000    -.1341177   -.0533713
             |
       _cons |    .146887   .0450659     3.26   0.002      .056983     .236791
------------------------------------------------------------------------------

. *USING ALL POSSIBLE COMBINATIONS OF EDUCATION AMONG THREE RESEARCHERS;
. reg ame  proindex    stats_brw topic_brw t2 t3 i.counter2   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)
note: 2703.counter2 omitted because of collinearity.
note: 3654.counter2 omitted because of collinearity.

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0734
                                                Root MSE          =     .19851

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0119123   .0066752     1.78   0.079     -.001401    .0252257
   stats_brw |   .0478261   .0194586     2.46   0.016     .0090171    .0866352
   topic_brw |   -.044896   .0176022    -2.55   0.013    -.0800024   -.0097897
          t2 |  -.1045522   .0158886    -6.58   0.000    -.1362409   -.0728635
          t3 |  -.1576271   .0393031    -4.01   0.000    -.2360147   -.0792395
             |
    counter2 |
       1200  |  -.2103299   .0597512    -3.52   0.001    -.3294998   -.0911599
       1300  |  -.2026525   .0557076    -3.64   0.001    -.3137577   -.0915473
       1400  |   -.209725   .0570652    -3.68   0.000     -.323538    -.095912
       1500  |  -.1919277   .0776901    -2.47   0.016    -.3468757   -.0369797
       1600  |   -.238657   .0640049    -3.73   0.000    -.3663108   -.1110033
       2204  |  -.0893532   .0427733    -2.09   0.040    -.1746619   -.0040444
       2303  |  -.0964507   .0405717    -2.38   0.020    -.1773684    -.015533
       2306  |  -.0840498   .0390265    -2.15   0.035    -.1618858   -.0062139
       2404  |  -.0923733   .0475118    -1.94   0.056    -.1871326    .0023859
       2504  |  -.1888781   .0464938    -4.06   0.000    -.2816071   -.0961491
       2505  |  -.0751566   .0482605    -1.56   0.124    -.1714091    .0210959
       2606  |  -.1245973   .0444536    -2.80   0.007    -.2132572   -.0359374
       2703  |          0  (omitted)
       3005  |  -.3131889   .0176779   -17.72   0.000    -.3484464   -.2779315
       3244  |  -.1136301   .0229655    -4.95   0.000    -.1594334   -.0678268
       3323  |  -.0258231   .0207315    -1.25   0.217    -.0671707    .0155245
       3333  |  -.0445734   .0300532    -1.48   0.143    -.1045127    .0153658
       3336  |  -.0901513   .0279987    -3.22   0.002     -.145993   -.0343097
       3343  |  -.0275947   .0407636    -0.68   0.501     -.108895    .0537057
       3344  |  -.0452452   .0223964    -2.02   0.047    -.0899133   -.0005771
       3414  |  -.0026026   .0212346    -0.12   0.903    -.0449537    .0397484
       3433  |  -.1323637   .0750136    -1.76   0.082    -.2819735    .0172462
       3443  |   -.051904     .01653    -3.14   0.002     -.084872   -.0189361
       3444  |  -.0581543    .041061    -1.42   0.161    -.1400478    .0237393
       3555  |    .079107   .0249479     3.17   0.002       .02935     .128864
       3654  |          0  (omitted)
             |
       _cons |   .1449456   .0562486     2.58   0.012     .0327613    .2571298
------------------------------------------------------------------------------

. reg ame  p12 p56    stats_brw topic_brw t2 t3 i.counter2   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)
note: 2703.counter2 omitted because of collinearity.
note: 3654.counter2 omitted because of collinearity.

Linear regression                               Number of obs     =      1,253
                                                F(15, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0768
                                                Root MSE          =     .19823

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0192054   .0296099    -0.65   0.519    -.0782605    .0398498
         p56 |   .0442189   .0244101     1.81   0.074    -.0044656    .0929033
   stats_brw |   .0472171   .0182796     2.58   0.012     .0107596    .0836747
   topic_brw |  -.0442882   .0170444    -2.60   0.011     -.078282   -.0102943
          t2 |  -.1055814   .0304334    -3.47   0.001    -.1662789    -.044884
          t3 |  -.1557959   .0468295    -3.33   0.001    -.2491944   -.0623975
             |
    counter2 |
       1200  |  -.2156881   .0648955    -3.32   0.001    -.3451181    -.086258
       1300  |  -.2209918   .0593805    -3.72   0.000    -.3394224   -.1025612
       1400  |  -.2213245   .0605005    -3.66   0.000     -.341989   -.1006601
       1500  |  -.1935157   .0729191    -2.65   0.010    -.3389481   -.0480832
       1600  |  -.2326674    .062589    -3.72   0.000    -.3574973   -.1078375
       2204  |   -.098256    .045544    -2.16   0.034    -.1890906   -.0074214
       2303  |  -.1071964   .0441642    -2.43   0.018    -.1952791   -.0191137
       2306  |  -.1010809   .0459048    -2.20   0.031    -.1926351   -.0095267
       2404  |  -.1049562   .0530454    -1.98   0.052     -.210752    .0008396
       2504  |  -.2137854   .0555335    -3.85   0.000    -.3245434   -.1030273
       2505  |  -.0838675   .0504441    -1.66   0.101     -.184475      .01674
       2606  |  -.1333371    .046314    -2.88   0.005    -.2257075   -.0409667
       2703  |          0  (omitted)
       3005  |  -.3293947    .029104   -11.32   0.000    -.3874408   -.2713486
       3244  |  -.1252373   .0280583    -4.46   0.000    -.1811979   -.0692768
       3323  |   -.037219   .0267184    -1.39   0.168    -.0905073    .0160692
       3333  |  -.0579901   .0363181    -1.60   0.115    -.1304242    .0144441
       3336  |  -.0894816   .0267943    -3.34   0.001    -.1429212   -.0360421
       3343  |  -.0422228   .0394894    -1.07   0.289    -.1209819    .0365363
       3344  |   -.052986    .029656    -1.79   0.078     -.112133    .0061611
       3414  |  -.0121072   .0174581    -0.69   0.490    -.0469264    .0227119
       3433  |   -.145903    .074456    -1.96   0.054    -.2944009    .0025949
       3443  |  -.0764068   .0308358    -2.48   0.016    -.1379069   -.0149067
       3444  |  -.0646076   .0381842    -1.69   0.095    -.1407635    .0115484
       3555  |   .0719486   .0222796     3.23   0.002     .0275133    .1163838
       3654  |          0  (omitted)
             |
       _cons |    .186401    .057221     3.26   0.002     .0722773    .3005248
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0634242   .0247626     2.56   0.013     .0140368    .1128117
------------------------------------------------------------------------------

. reg ame  group1 group3    stats_brw topic_brw t2 t3 i.counter2   [aw=1/nmodel] ,  cluster(teamid
> );
(sum of wgt is 71)
note: 2703.counter2 omitted because of collinearity.
note: 3654.counter2 omitted because of collinearity.

Linear regression                               Number of obs     =      1,253
                                                F(15, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0812
                                                Root MSE          =     .19775

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0415219    .033251    -1.25   0.216    -.1078388    .0247951
      group3 |   .0384821   .0160778     2.39   0.019     .0064159    .0705482
   stats_brw |   .0420273   .0170684     2.46   0.016     .0079854    .0760693
   topic_brw |  -.0432624    .016023    -2.70   0.009    -.0752192   -.0113056
          t2 |  -.1233086   .0355297    -3.47   0.001    -.1941704   -.0524469
          t3 |  -.1668027   .0490147    -3.40   0.001    -.2645595   -.0690459
             |
    counter2 |
       1200  |  -.2227916   .0643777    -3.46   0.001    -.3511888   -.0943944
       1300  |  -.2161859   .0584325    -3.70   0.000    -.3327258    -.099646
       1400  |  -.2218466   .0609137    -3.64   0.001    -.3433352   -.1003579
       1500  |  -.1868525   .0722809    -2.59   0.012    -.3310123   -.0426927
       1600  |  -.2312837   .0641969    -3.60   0.001    -.3593205    -.103247
       2204  |  -.0635896   .0375791    -1.69   0.095    -.1385388    .0113597
       2303  |   -.084444   .0384483    -2.20   0.031    -.1611268   -.0077612
       2306  |  -.0775222   .0408045    -1.90   0.062    -.1589042    .0038599
       2404  |   -.082074   .0486481    -1.69   0.096    -.1790996    .0149516
       2504  |  -.1950587   .0486978    -4.01   0.000    -.2921834    -.097934
       2505  |  -.0479866   .0425672    -1.13   0.263    -.1328843    .0369111
       2606  |  -.1002361   .0398341    -2.52   0.014    -.1796828   -.0207894
       2703  |          0  (omitted)
       3005  |   -.320422   .0203343   -15.76   0.000    -.3609774   -.2798665
       3244  |  -.0692968   .0377011    -1.84   0.070    -.1444893    .0058958
       3323  |  -.0023441   .0296847    -0.08   0.937    -.0615485    .0568603
       3333  |  -.0485358   .0225039    -2.16   0.034    -.0934184   -.0036532
       3336  |  -.0793156   .0238787    -3.32   0.001    -.1269403    -.031691
       3343  |    -.03466   .0376902    -0.92   0.361    -.1098306    .0405107
       3344  |   .0044229   .0374894     0.12   0.906    -.0703473    .0791931
       3414  |  -.0206182   .0095386    -2.16   0.034    -.0396423   -.0015941
       3433  |  -.1362453   .0658659    -2.07   0.042    -.2676106     -.00488
       3443  |   -.067703   .0196442    -3.45   0.001    -.1068821    -.028524
       3444  |  -.0635564   .0313644    -2.03   0.047    -.1261106   -.0010022
       3555  |   .0771718    .021014     3.67   0.000     .0352607    .1190829
       3654  |          0  (omitted)
             |
       _cons |   .1930119   .0583585     3.31   0.001     .0766195    .3094042
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0800039   .0323487     2.47   0.016     .0154865    .1445214
------------------------------------------------------------------------------

. reg ame  group3    stats_brw topic_brw t2 t3 i.counter2   [aw=1/nmodel] ,  cluster(teamid);
(sum of wgt is 71)
note: 2703.counter2 omitted because of collinearity.
note: 3654.counter2 omitted because of collinearity.

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0793
                                                Root MSE          =     .19788

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |   .0478576   .0167015     2.87   0.005     .0145476    .0811676
   stats_brw |    .045558    .017665     2.58   0.012     .0103263    .0807896
   topic_brw |  -.0438772   .0160776    -2.73   0.008     -.075943   -.0118113
          t2 |  -.0849482   .0115346    -7.36   0.000    -.1079532   -.0619432
          t3 |  -.1329995   .0355738    -3.74   0.000    -.2039491   -.0620498
             |
    counter2 |
       1200  |  -.1915936   .0549618    -3.49   0.001    -.3012115   -.0819758
       1300  |  -.2028796   .0561486    -3.61   0.001    -.3148645   -.0908946
       1400  |  -.2036901   .0579141    -3.52   0.001    -.3191961   -.0881841
       1500  |  -.1782211   .0656606    -2.71   0.008    -.3091771   -.0472651
       1600  |  -.2061255   .0568629    -3.62   0.001     -.319535   -.0927159
       2204  |  -.0721626   .0391317    -1.84   0.069    -.1502083    .0058831
       2303  |  -.0946176   .0400304    -2.36   0.021    -.1744557   -.0147795
       2306  |   -.088746   .0446417    -1.99   0.051    -.1777811    .0002891
       2404  |  -.0935241   .0499811    -1.87   0.065    -.1932082      .00616
       2504  |  -.2132851   .0513943    -4.15   0.000    -.3157878   -.1107824
       2505  |  -.0573775   .0442278    -1.30   0.199    -.1455871    .0308322
       2606  |  -.1076851   .0410073    -2.63   0.011    -.1894717   -.0258986
       2703  |          0  (omitted)
       3005  |  -.3320265   .0217206   -15.29   0.000    -.3753469    -.288706
       3244  |  -.1149575   .0204443    -5.62   0.000    -.1557324   -.0741826
       3323  |  -.0274159   .0166231    -1.65   0.104    -.0605697    .0057378
       3333  |  -.0652578   .0313611    -2.08   0.041    -.1278054   -.0027101
       3336  |  -.0863207   .0253941    -3.40   0.001    -.1369677   -.0356737
       3343  |  -.0434785   .0377997    -1.15   0.254    -.1188677    .0319106
       3344  |  -.0422839   .0203116    -2.08   0.041    -.0827941   -.0017737
       3414  |  -.0247314   .0089742    -2.76   0.007    -.0426299   -.0068328
       3433  |  -.1455804   .0626633    -2.32   0.023    -.2705583   -.0206025
       3443  |  -.0791798   .0209852    -3.77   0.000    -.1210334   -.0373261
       3444  |  -.0720738   .0314972    -2.29   0.025     -.134893   -.0092547
       3555  |   .0736474   .0215296     3.42   0.001     .0307081    .1165868
       3654  |          0  (omitted)
             |
       _cons |   .1622203   .0480933     3.37   0.001     .0663013    .2581394
------------------------------------------------------------------------------

. *WEIGHTED BY PSCORE/NMODEL;
. *USING MDEGREE EDUCATION VECTOR;
. reg ame  proindex    stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel] ,  cluster(teamid)
> ;
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0631
                                                Root MSE          =     .20018

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0113823    .005618     2.03   0.047     .0001776    .0225871
   stats_brw |   .0391653   .0181567     2.16   0.034     .0029529    .0753776
   topic_brw |  -.0414328    .017194    -2.41   0.019    -.0757251   -.0071404
          t2 |   .0087255   .0146966     0.59   0.555    -.0205859    .0380369
          t3 |   .0119852   .0246031     0.49   0.628    -.0370841    .0610544
             |
     mdegree |
          1  |   .4575084   .0520426     8.79   0.000     .3537127     .561304
          2  |    .273634   .0211764    12.92   0.000      .231399    .3158689
          3  |   .2734949   .0210531    12.99   0.000     .2315059    .3154839
          4  |   .2703089   .0198575    13.61   0.000     .2307043    .3099135
          5  |   .3236678    .035149     9.21   0.000     .2535654    .3937703
          6  |   .2509542    .023532    10.66   0.000     .2040211    .2978872
         20  |   .2786136   .0329363     8.46   0.000     .2129241     .344303
         33  |   .2737398   .0245488    11.15   0.000     .2247788    .3227008
         34  |   .2888588   .0206671    13.98   0.000     .2476396     .330078
         35  |   .1780349   .0740114     2.41   0.019     .0304238     .325646
         36  |   .2734497   .0179724    15.21   0.000     .2376048    .3092946
         40  |   .2599358   .0397411     6.54   0.000     .1806747     .339197
             |
       _cons |  -.3367484    .026792   -12.57   0.000    -.3901834   -.2833134
------------------------------------------------------------------------------

. reg ame  p12 p56    stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0666
                                                Root MSE          =     .19989

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0516617   .0261416    -1.98   0.052    -.1037995    .0004762
         p56 |   .0259294   .0193446     1.34   0.184    -.0126521     .064511
   stats_brw |     .03755    .017038     2.20   0.031     .0035689    .0715311
   topic_brw |  -.0419997   .0167832    -2.50   0.015    -.0754728   -.0085266
          t2 |   .0001315   .0161841     0.01   0.994    -.0321467    .0324098
          t3 |   .0080016   .0233349     0.34   0.733    -.0385384    .0545415
             |
     mdegree |
          1  |   .4805021   .0595689     8.07   0.000     .3616956    .5993086
          2  |   .2608113   .0289467     9.01   0.000     .2030788    .3185437
          3  |   .2730819    .021381    12.77   0.000     .2304389    .3157249
          4  |   .2689926   .0191167    14.07   0.000     .2308654    .3071197
          5  |   .3261398   .0300943    10.84   0.000     .2661185    .3861611
          6  |   .2533505   .0233359    10.86   0.000     .2068085    .2998925
         20  |   .2760177   .0346695     7.96   0.000     .2068716    .3451637
         33  |   .2721161   .0232172    11.72   0.000     .2258109    .3184214
         34  |   .2861176    .022347    12.80   0.000     .2415479    .3306874
         35  |   .1731348   .0737648     2.35   0.022     .0260155    .3202541
         36  |   .2829707    .013312    21.26   0.000     .2564207    .3095207
         40  |    .261034   .0383023     6.82   0.000     .1846426    .3374255
             |
       _cons |   -.290692   .0263835   -11.02   0.000    -.3433123   -.2380718
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0775911    .026312     2.95   0.004     .0251135    .1300687
------------------------------------------------------------------------------

. reg ame  group1 group3    stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel] ,  cluster(te
> amid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0739
                                                Root MSE          =     .19911

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0612237   .0335927    -1.82   0.073    -.1282222    .0057748
      group3 |   .0289914   .0145722     1.99   0.051     -.000072    .0580549
   stats_brw |   .0339442   .0157978     2.15   0.035     .0024366    .0654519
   topic_brw |  -.0407224   .0158489    -2.57   0.012    -.0723322   -.0091127
          t2 |   .0048151   .0162263     0.30   0.768    -.0275472    .0371774
          t3 |   .0073001   .0234384     0.31   0.756    -.0394462    .0540465
             |
     mdegree |
          1  |   .4826737   .0606109     7.96   0.000     .3617891    .6035582
          2  |   .2641638   .0268537     9.84   0.000     .2106058    .3177219
          3  |   .2773822   .0205898    13.47   0.000     .2363171    .3184474
          4  |   .2706116   .0180237    15.01   0.000     .2346644    .3065587
          5  |    .335401   .0292041    11.48   0.000     .2771553    .3936468
          6  |   .2626786   .0257244    10.21   0.000     .2113729    .3139843
         20  |   .2766724   .0349883     7.91   0.000     .2068904    .3464545
         33  |   .2860567   .0247775    11.55   0.000     .2366395    .3354739
         34  |   .2763643     .01433    19.29   0.000     .2477841    .3049445
         35  |   .1778665   .0667929     2.66   0.010     .0446524    .3110807
         36  |    .341529    .032623    10.47   0.000     .2764644    .4065935
         40  |   .2877489    .023661    12.16   0.000     .2405585    .3349392
             |
       _cons |  -.2939027   .0274166   -10.72   0.000    -.3485835    -.239222
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0902151   .0340102     2.65   0.010      .022384    .1580462
------------------------------------------------------------------------------

. reg ame  group3    stats_brw topic_brw t2 t3 i.mdegree   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 299.8024025072654)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0681
                                                Root MSE          =     .19965

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |   .0425567   .0161913     2.63   0.011     .0102641    .0748492
   stats_brw |   .0371753   .0166199     2.24   0.028     .0040279    .0703227
   topic_brw |  -.0400893   .0157721    -2.54   0.013    -.0715457   -.0086329
          t2 |   .0237072   .0155839     1.52   0.133    -.0073739    .0547883
          t3 |   .0144569   .0227108     0.64   0.526    -.0308385    .0597522
             |
     mdegree |
          1  |   .4520275   .0571492     7.91   0.000      .338047    .5660079
          2  |   .2856604   .0218783    13.06   0.000     .2420254    .3292953
          3  |   .2720781    .023606    11.53   0.000     .2249974    .3191588
          4  |   .2700212    .018722    14.42   0.000     .2326813    .3073611
          5  |   .3329414   .0311552    10.69   0.000     .2708042    .3950785
          6  |    .270186   .0257111    10.51   0.000     .2189068    .3214652
         20  |   .2737801   .0387783     7.06   0.000     .1964393    .3511209
         33  |   .2831327   .0212578    13.32   0.000     .2407354    .3255299
         34  |   .2827972   .0173193    16.33   0.000      .248255    .3173395
         35  |   .1830432   .0610361     3.00   0.004     .0613105    .3047758
         36  |   .2908544    .014531    20.02   0.000     .2618732    .3198357
         40  |   .2743366   .0407135     6.74   0.000     .1931361     .355537
             |
       _cons |  -.3140019   .0234006   -13.42   0.000     -.360673   -.2673308
------------------------------------------------------------------------------

. *USING EDUCATION OF LEAD RESEARCHER;
. reg ame  proindex    stats_brw topic_brw t2 t3 i.degree1   [aw=pscore/nmodel] ,  cluster(teamid)
> ;
(sum of wgt is 295.1660390009483)

Linear regression                               Number of obs     =      1,233
                                                F(9, 69)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0353
                                                Root MSE          =     .19642

                                (Std. err. adjusted for 70 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0100801   .0054665     1.84   0.069    -.0008253    .0209854
   stats_brw |   .0425048   .0184336     2.31   0.024     .0057307    .0792788
   topic_brw |  -.0468568   .0170866    -2.74   0.008    -.0809436     -.01277
          t2 |   .0021569   .0145893     0.15   0.883     -.026948    .0312619
          t3 |   .0024863   .0189039     0.13   0.896    -.0352259    .0401986
             |
     degree1 |
          2  |  -.2042556    .061432    -3.32   0.001    -.3268092    -.081702
          3  |  -.1794746   .0546107    -3.29   0.002    -.2884199   -.0705293
          4  |  -.1935194   .0556715    -3.48   0.001     -.304581   -.0824577
          5  |  -.1653187   .0691166    -2.39   0.019    -.3032026   -.0274348
          6  |  -.1837653   .0554128    -3.32   0.001    -.2943108   -.0732199
          7  |  -.0978283   .0218648    -4.47   0.000    -.1414474   -.0542092
             |
       _cons |   .1308473   .0504199     2.60   0.012     .0302622    .2314323
------------------------------------------------------------------------------

. reg ame  p12 p56    stats_brw topic_brw t2 t3 i.degree1   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 295.1660390009483)

Linear regression                               Number of obs     =      1,233
                                                F(10, 69)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0386
                                                Root MSE          =     .19617

                                (Std. err. adjusted for 70 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0365511   .0262686    -1.39   0.169    -.0889555    .0158533
         p56 |   .0286305   .0204019     1.40   0.165    -.0120702    .0693312
   stats_brw |   .0416248   .0175665     2.37   0.021     .0065806     .076669
   topic_brw |  -.0470472   .0164539    -2.86   0.006    -.0798718   -.0142226
          t2 |  -.0034663   .0154463    -0.22   0.823    -.0342809    .0273483
          t3 |   .0010255   .0182676     0.06   0.955    -.0354174    .0374685
             |
     degree1 |
          2  |  -.2234647   .0652677    -3.42   0.001    -.3536702   -.0932591
          3  |  -.1987844   .0593643    -3.35   0.001     -.317213   -.0803557
          4  |  -.2134301   .0599855    -3.56   0.001    -.3330979   -.0937624
          5  |  -.1825262    .071274    -2.56   0.013     -.324714   -.0403384
          6  |  -.1986042   .0587265    -3.38   0.001    -.3157603    -.081448
          7  |  -.1126854   .0294576    -3.83   0.000    -.1714517   -.0539191
             |
       _cons |   .1846951   .0559442     3.30   0.002     .0730896    .2963007
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0651816   .0262805     2.48   0.016     .0127534    .1176097
------------------------------------------------------------------------------

. reg ame  group1 group3    stats_brw topic_brw t2 t3 i.degree1   [aw=pscore/nmodel] ,  cluster(te
> amid);
(sum of wgt is 295.1660390009483)

Linear regression                               Number of obs     =      1,233
                                                F(10, 69)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0445
                                                Root MSE          =     .19556

                                (Std. err. adjusted for 70 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0455751    .030479    -1.50   0.139    -.1063789    .0152288
      group3 |   .0273533   .0184874     1.48   0.144    -.0095281    .0642347
   stats_brw |   .0390703   .0161456     2.42   0.018     .0068606    .0712799
   topic_brw |  -.0463559   .0157374    -2.95   0.004    -.0777511   -.0149607
          t2 |   .0008766   .0166439     0.05   0.958    -.0323271    .0340804
          t3 |   .0027761   .0179279     0.15   0.877    -.0329891    .0385412
             |
     degree1 |
          2  |   -.208657   .0596418    -3.50   0.001    -.3276392   -.0896748
          3  |  -.1961148    .057695    -3.40   0.001    -.3112131   -.0810165
          4  |  -.2160082   .0605189    -3.57   0.001    -.3367401   -.0952762
          5  |   -.180248   .0712512    -2.53   0.014    -.3223904   -.0381057
          6  |  -.1973131    .058959    -3.35   0.001    -.3149331   -.0796931
          7  |  -.1238816   .0333074    -3.72   0.000     -.190328   -.0574352
             |
       _cons |   .1860909   .0578567     3.22   0.002     .0706699    .3015119
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0729284   .0302743     2.41   0.019     .0125328     .133324
------------------------------------------------------------------------------

. reg ame  group3    stats_brw topic_brw t2 t3 i.degree1   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 295.1660390009483)

Linear regression                               Number of obs     =      1,233
                                                F(9, 69)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0405
                                                Root MSE          =     .19589

                                (Std. err. adjusted for 70 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |    .038545    .017977     2.14   0.036     .0026819    .0744082
   stats_brw |   .0419971   .0170122     2.47   0.016     .0080587    .0759355
   topic_brw |  -.0466258   .0157725    -2.96   0.004    -.0780909   -.0151606
          t2 |   .0135518   .0163717     0.83   0.411    -.0191087    .0462124
          t3 |   .0059317   .0180211     0.33   0.743    -.0300194    .0418827
             |
     degree1 |
          2  |  -.1913999   .0575312    -3.33   0.001    -.3061715   -.0766283
          3  |  -.1778736   .0536258    -3.32   0.001    -.2848542   -.0708929
          4  |  -.1928948   .0563639    -3.42   0.001    -.3053377   -.0804519
          5  |  -.1617459   .0676043    -2.39   0.019    -.2966129   -.0268789
          6  |  -.1663909   .0505257    -3.29   0.002    -.2671869    -.065595
          7  |  -.0937161   .0211422    -4.43   0.000    -.1358937   -.0515385
             |
       _cons |   .1495431   .0459806     3.25   0.002     .0578143    .2412718
------------------------------------------------------------------------------

. *USING ALL POSSIBLE COMBINATIONS OF EDUCATION AMONG THREE RESEARCHERS;
. reg ame  proindex    stats_brw topic_brw t2 t3 i.counter2   [aw=pscore/nmodel] ,  cluster(teamid
> );
(sum of wgt is 299.8024025072654)
note: 2703.counter2 omitted because of collinearity.
note: 3654.counter2 omitted because of collinearity.

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0754
                                                Root MSE          =     .19984

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0127838   .0066939     1.91   0.060    -.0005668    .0261343
   stats_brw |   .0490596    .020099     2.44   0.017     .0089733    .0891458
   topic_brw |  -.0455477    .018004    -2.53   0.014    -.0814556   -.0096398
          t2 |  -.1067569   .0170823    -6.25   0.000    -.1408264   -.0726874
          t3 |  -.1621926   .0416149    -3.90   0.000     -.245191   -.0791942
             |
    counter2 |
       1200  |  -.2149421   .0623086    -3.45   0.001    -.3392127   -.0906716
       1300  |  -.2097818   .0593351    -3.54   0.001    -.3281218   -.0914417
       1400  |  -.2162393   .0609686    -3.55   0.001    -.3378374   -.0946413
       1500  |  -.1953655    .080142    -2.44   0.017    -.3552036   -.0355274
       1600  |  -.2448523   .0672971    -3.64   0.001    -.3790721   -.1106325
       2204  |   -.093059   .0448352    -2.08   0.042      -.18248   -.0036381
       2303  |  -.0999432   .0420115    -2.38   0.020    -.1837325   -.0161539
       2306  |  -.0882172   .0420215    -2.10   0.039    -.1720264    -.004408
       2404  |  -.0998683   .0486249    -2.05   0.044    -.1968477   -.0028889
       2504  |  -.1932046   .0489527    -3.95   0.000    -.2908376   -.0955716
       2505  |  -.0791925   .0504974    -1.57   0.121    -.1799064    .0215214
       2606  |  -.1282212   .0464864    -2.76   0.007    -.2209354   -.0355071
       2703  |          0  (omitted)
       3005  |  -.3153097   .0187159   -16.85   0.000    -.3526375    -.277982
       3244  |  -.1142285   .0235027    -4.86   0.000    -.1611031   -.0673538
       3323  |  -.0263899   .0212617    -1.24   0.219    -.0687951    .0160152
       3333  |   -.046295   .0333672    -1.39   0.170    -.1128438    .0202538
       3336  |  -.0915248   .0288701    -3.17   0.002    -.1491043   -.0339452
       3343  |  -.0367579   .0376055    -0.98   0.332    -.1117598     .038244
       3344  |  -.0462517   .0231236    -2.00   0.049    -.0923703   -.0001331
       3414  |  -.0020787   .0217549    -0.10   0.924    -.0454675    .0413101
       3433  |  -.1415138   .0744079    -1.90   0.061    -.2899158    .0068881
       3443  |  -.0531089   .0170721    -3.11   0.003    -.0871582   -.0190597
       3444  |   -.061281   .0419012    -1.46   0.148    -.1448503    .0222883
       3555  |   .0788503   .0253431     3.11   0.003     .0283051    .1293956
       3654  |          0  (omitted)
             |
       _cons |   .1467108   .0567198     2.59   0.012     .0335868    .2598349
------------------------------------------------------------------------------

. reg ame  p12 p56    stats_brw topic_brw t2 t3 i.counter2   [aw=pscore/nmodel] ,  cluster(teamid)
> ;
(sum of wgt is 299.8024025072654)
note: 2703.counter2 omitted because of collinearity.
note: 3654.counter2 omitted because of collinearity.

Linear regression                               Number of obs     =      1,253
                                                F(15, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0794
                                                Root MSE          =     .19949

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0174028   .0303587    -0.57   0.568    -.0779514    .0431457
         p56 |    .049196   .0254582     1.93   0.057    -.0015788    .0999708
   stats_brw |   .0486365   .0189039     2.57   0.012     .0109339    .0863391
   topic_brw |  -.0448266   .0172507    -2.60   0.011     -.079232   -.0104212
          t2 |  -.1049119   .0305422    -3.43   0.001    -.1658264   -.0439974
          t3 |  -.1575561   .0465774    -3.38   0.001    -.2504518   -.0646605
             |
    counter2 |
       1200  |  -.2181253   .0648978    -3.36   0.001    -.3475599   -.0886908
       1300  |  -.2289502   .0623131    -3.67   0.000    -.3532298   -.1046706
       1400  |  -.2271094   .0630223    -3.60   0.001    -.3528034   -.1014154
       1500  |  -.1965265   .0733883    -2.68   0.009    -.3428948   -.0501581
       1600  |  -.2366004   .0631411    -3.75   0.000    -.3625314   -.1106693
       2204  |   -.104084   .0483303    -2.15   0.035    -.2004756   -.0076923
       2303  |  -.1121326   .0460895    -2.43   0.018    -.2040553   -.0202099
       2306  |  -.1086758    .050369    -2.16   0.034    -.2091336    -.008218
       2404  |  -.1154649   .0547796    -2.11   0.039    -.2247193   -.0062104
       2504  |  -.2222722   .0595779    -3.73   0.000    -.3410966   -.1034478
       2505  |  -.0900538   .0534065    -1.69   0.096    -.1965698    .0164622
       2606  |  -.1389204   .0490163    -2.83   0.006    -.2366803   -.0411605
       2703  |          0  (omitted)
       3005  |   -.334625   .0310114   -10.79   0.000    -.3964752   -.2727748
       3244  |  -.1286078   .0301409    -4.27   0.000    -.1887218   -.0684937
       3323  |  -.0400098   .0283072    -1.41   0.162    -.0964668    .0164472
       3333  |  -.0615136   .0395363    -1.56   0.124    -.1403663    .0173391
       3336  |  -.0913802   .0277486    -3.29   0.002    -.1467231   -.0360373
       3343  |  -.0527323   .0369916    -1.43   0.158    -.1265098    .0210452
       3344  |  -.0566117   .0316862    -1.79   0.078    -.1198078    .0065845
       3414  |   -.013654   .0173118    -0.79   0.433    -.0481814    .0208733
       3433  |  -.1569408   .0736112    -2.13   0.037    -.3037537    -.010128
       3443  |  -.0813922    .032045    -2.54   0.013     -.145304   -.0174805
       3444  |  -.0688016    .038736    -1.78   0.080    -.1460581    .0084549
       3555  |   .0709761    .022953     3.09   0.003     .0251977    .1167545
       3654  |          0  (omitted)
             |
       _cons |   .1887519   .0572432     3.30   0.002     .0745839    .3029198
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0665988   .0261173     2.55   0.013     .0145095    .1186882
------------------------------------------------------------------------------

. reg ame  group1 group3    stats_brw topic_brw t2 t3 i.counter2   [aw=pscore/nmodel] ,  cluster(t
> eamid);
(sum of wgt is 299.8024025072654)
note: 2703.counter2 omitted because of collinearity.
note: 3654.counter2 omitted because of collinearity.

Linear regression                               Number of obs     =      1,253
                                                F(15, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0846
                                                Root MSE          =     .19892

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0465556   .0357235    -1.30   0.197    -.1178039    .0246928
      group3 |   .0410208   .0159901     2.57   0.012     .0091295    .0729121
   stats_brw |   .0422499   .0173219     2.44   0.017     .0077024    .0767974
   topic_brw |  -.0435459    .016351    -2.66   0.010     -.076157   -.0109348
          t2 |  -.1284257   .0380644    -3.37   0.001    -.2043428   -.0525086
          t3 |  -.1727965   .0512266    -3.37   0.001    -.2749648   -.0706282
             |
    counter2 |
       1200  |  -.2285513   .0665401    -3.43   0.001    -.3612612   -.0958413
       1300  |   -.223799   .0608149    -3.68   0.000    -.3450906   -.1025075
       1400  |  -.2285557   .0637721    -3.58   0.001    -.3557451   -.1013663
       1500  |  -.1890119   .0736327    -2.57   0.012    -.3358676   -.0421562
       1600  |  -.2366407   .0657521    -3.60   0.001    -.3677791   -.1055022
       2204  |    -.06404   .0379993    -1.69   0.096    -.1398273    .0117472
       2303  |  -.0852904   .0386098    -2.21   0.030    -.1622953   -.0082856
       2306  |   -.080597   .0429479    -1.88   0.065    -.1662539    .0050599
       2404  |  -.0889384   .0484145    -1.84   0.070    -.1854979    .0076212
       2504  |  -.1981146   .0497024    -3.99   0.000     -.297243   -.0989862
       2505  |  -.0485134   .0431025    -1.13   0.264    -.1344786    .0374518
       2606  |  -.1007898   .0405336    -2.49   0.015    -.1816314   -.0199481
       2703  |          0  (omitted)
       3005  |  -.3224738   .0204606   -15.76   0.000    -.3632813   -.2816663
       3244  |  -.0639717   .0399164    -1.60   0.114    -.1435825     .015639
       3323  |   .0002638   .0313332     0.01   0.993    -.0622283    .0627559
       3333  |  -.0480546   .0228257    -2.11   0.039     -.093579   -.0025303
       3336  |  -.0788896   .0237259    -3.33   0.001    -.1262094   -.0315698
       3343  |    -.04269     .03433    -1.24   0.218     -.111159     .025779
       3344  |   .0098208   .0394029     0.25   0.804    -.0687658    .0884075
       3414  |  -.0220041   .0091672    -2.40   0.019    -.0402875   -.0037207
       3433  |  -.1436654    .064271    -2.24   0.029    -.2718499   -.0154808
       3443  |  -.0695842   .0193356    -3.60   0.001    -.1081478   -.0310206
       3444  |  -.0656978   .0308101    -2.13   0.036    -.1271466    -.004249
       3555  |   .0774103   .0214255     3.61   0.001     .0346785    .1201421
       3654  |          0  (omitted)
             |
       _cons |   .1985872    .060468     3.28   0.002     .0779875    .3191869
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0875764   .0353716     2.48   0.016     .0170299    .1581229
------------------------------------------------------------------------------

. reg ame  group3    stats_brw topic_brw t2 t3 i.counter2   [aw=pscore/nmodel] ,  cluster(teamid);
(sum of wgt is 299.8024025072654)
note: 2703.counter2 omitted because of collinearity.
note: 3654.counter2 omitted because of collinearity.

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0822
                                                Root MSE          =     .19911

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |   .0517297   .0174286     2.97   0.004     .0169696    .0864899
   stats_brw |   .0467043   .0180888     2.58   0.012     .0106274    .0827812
   topic_brw |  -.0446323   .0163778    -2.73   0.008    -.0772969   -.0119678
          t2 |  -.0857116    .011726    -7.31   0.000    -.1090982   -.0623249
          t3 |   -.135887   .0363967    -3.73   0.000     -.208478    -.063296
             |
    counter2 |
       1200  |  -.1951162   .0563013    -3.47   0.001    -.3074056   -.0828267
       1300  |  -.2099571   .0584543    -3.59   0.001    -.3265404   -.0933737
       1400  |  -.2095182   .0607314    -3.45   0.001    -.3306431   -.0883933
       1500  |  -.1814437   .0667564    -2.72   0.008    -.3145851   -.0483023
       1600  |  -.2098307   .0576421    -3.64   0.001    -.3247943   -.0948672
       2204  |  -.0747419   .0400317    -1.87   0.066    -.1545826    .0050988
       2303  |  -.0972046   .0406922    -2.39   0.020    -.1783625   -.0160467
       2306  |  -.0947523   .0479568    -1.98   0.052    -.1903992    .0008947
       2404  |  -.1034059   .0504893    -2.05   0.044    -.2041037    -.002708
       2504  |  -.2199384      .0537    -4.10   0.000    -.3270396   -.1128371
       2505  |  -.0602786    .045263    -1.33   0.187    -.1505528    .0299956
       2606  |  -.1102946   .0420121    -2.63   0.011    -.1940851    -.026504
       2703  |          0  (omitted)
       3005  |  -.3358916   .0229331   -14.65   0.000    -.3816302    -.290153
       3244  |  -.1157413   .0209326    -5.53   0.000    -.1574902   -.0739925
       3323  |  -.0279987   .0169339    -1.65   0.103    -.0617724     .005775
       3333  |  -.0678965   .0346409    -1.96   0.054    -.1369856    .0011926
       3336  |  -.0873939   .0258071    -3.39   0.001    -.1388645   -.0359233
       3343  |   -.052537   .0351598    -1.49   0.140    -.1226611    .0175871
       3344  |  -.0430921   .0207084    -2.08   0.041    -.0843937   -.0017906
       3414  |   -.026776   .0089682    -2.99   0.004    -.0446625   -.0088894
       3433  |   -.154278   .0609416    -2.53   0.014    -.2758222   -.0327338
       3443  |  -.0826343   .0218015    -3.79   0.000    -.1261161   -.0391525
       3444  |  -.0756457   .0315405    -2.40   0.019    -.1385513   -.0127401
       3555  |   .0728553   .0220604     3.30   0.002     .0288572    .1168534
       3654  |          0  (omitted)
             |
       _cons |   .1653984   .0491862     3.36   0.001     .0672995    .2634972
------------------------------------------------------------------------------

. log close;
      name:  <unnamed>
       log:  C:/GitHub/ideology_specification/code/Log Files/03_Table_3.log
  log type:  text
 closed on:  19 Dec 2024, 07:32:12
--------------------------------------------------------------------------------------------------
