--------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/GitHub/ideology_specification/code/Log Files/05_Expected_AME.log
  log type:  text
 opened on:  12 Feb 2025, 15:36:17

. *USES THE MODEL LEVEL DATA CREATED IN 02_Table_1_2_5_6.DO;
. use "$workd/data/newmodel.dta", clear;

. encode dv, gen(dvv);

. drop if ame==.;
(0 observations deleted)

. *DEFINES "SET" AS THE SET OF VARIABLES USED TO SUMMARIZE SPECIFICATION DECISIONS;
. global set scale stock flow  level_cyear allavailable w1996 w2006 w2016;

. *GETS LINEAR PREDICTION OF THE SET;
. *LINEAR PREDICTION IS USELESS AS IT DOESN'T REALLY TAKE ACCOUNT OF INTERACTIONS;
. regress ame $set [aw=model_brw];
(sum of wgt is 560.2422434389591)

      Source |       SS           df       MS      Number of obs   =     1,253
-------------+----------------------------------   F(8, 1244)      =      3.86
       Model |  1.03166787         8  .128958483   Prob > F        =    0.0002
    Residual |  41.6064026     1,244  .033445661   R-squared       =    0.0242
-------------+----------------------------------   Adj R-squared   =    0.0179
       Total |  42.6380705     1,252  .034055967   Root MSE        =    .18288

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       scale |  -.0145209   .0143024    -1.02   0.310    -.0425804    .0135386
       stock |  -.0342599   .0281946    -1.22   0.225    -.0895741    .0210544
        flow |  -.0346967   .0279189    -1.24   0.214    -.0894701    .0200767
 level_cyear |   .0293463   .0141063     2.08   0.038     .0016715    .0570212
allavailable |  -.0144867    .012632    -1.15   0.252     -.039269    .0102957
       w1996 |  -.0346319   .0136314    -2.54   0.011     -.061375   -.0078889
       w2006 |   .0325202   .0227849     1.43   0.154    -.0121808    .0772212
       w2016 |  -.0488368   .0119133    -4.10   0.000    -.0722092   -.0254644
       _cons |    .061073   .0373058     1.64   0.102    -.0121162    .1342622
------------------------------------------------------------------------------

. predict pame;
(option xb assumed; fitted values)

. *THE COLLAPSE BY $SET WEIGHTED BY THE REFEREE SCORE MODEL_BRW PRODUCES SIMILAR RESULTS;
. *THE VARIABLE MAME IS THE MEAN AME BY SPECIFICATION;
. *THE VARIABLE MEANSCORE IS THE MEAN REFEREE SCORE FOR EACH OF THE 58 SPECIFICATIONS;
. collapse (mean) mame=ame pame meanscore=model_brw meanpeer=pscore, 
>         by($set);

. *THE VARIABLE SPEC GIVES THE NUMBER OF THE SPECIFICATION, THERE ARE 58;
. generate spec=_n;

. summ mame spec;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        mame |         58   -.0001524    .1076728    -.37979   .4533333
        spec |         58        29.5    16.88688          1         58

. save "$workd/data/junkame.dta", replace;
file /GitHub/ideology_specification/data/junkame.dta saved

. *MERGE MAME WITH THE DATA SET;
. use "$workd/data/newmodel.dta";

. encode dv, gen(dvv);

. global set scale stock flow  level_cyear allavailable w1996 w2006 w2016;

.         sort $set;

. merge $set using "$workd//data/junkame.dta";
(you are using old merge syntax; see [D] merge for new syntax)
variables scale stock flow level_cyear allavailable w1996 w2006 w2016 do not uniquely identify
    observations in the master data

. *NOTE THAT MODEL_BRW IS THE WRONG SCORE FOR THE 58 MIXED SPECIFICATION;
. *SO WILL USE MEANSCORE INSTEAD;
. *NOTE DIFFERENCE IN R-SQUARED BETWEEN AME AND LINEAR SET OF SPECIFICATION PREDICTIONS;
. *AND AME AND FULL INTERACTION MODEL;
. reg ame $set;

      Source |       SS           df       MS      Number of obs   =     1,253
-------------+----------------------------------   F(8, 1244)      =      4.40
       Model |  1.19752787         8  .149690984   Prob > F        =    0.0000
    Residual |  42.3590465     1,244   .03405068   R-squared       =    0.0275
-------------+----------------------------------   Adj R-squared   =    0.0212
       Total |  43.5565743     1,252  .034789596   Root MSE        =    .18453

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       scale |   -.010397   .0145524    -0.71   0.475    -.0389469    .0181529
       stock |  -.0373823   .0299044    -1.25   0.212    -.0960509    .0212863
        flow |  -.0348237   .0296142    -1.18   0.240    -.0929231    .0232756
 level_cyear |   .0367591   .0149243     2.46   0.014     .0074795    .0660387
allavailable |  -.0225861   .0132256    -1.71   0.088     -.048533    .0033608
       w1996 |  -.0420884   .0147094    -2.86   0.004    -.0709464   -.0132304
       w2006 |   .0382246   .0235446     1.62   0.105    -.0079669    .0844161
       w2016 |  -.0499874   .0115562    -4.33   0.000    -.0726592   -.0273155
       _cons |   .0671895   .0390879     1.72   0.086    -.0094959    .1438749
------------------------------------------------------------------------------

. areg ame, absorb(spec);

Linear regression, absorbing indicators             Number of obs     =  1,253
Absorbed variable: spec                             No. of categories =     58
                                                    F(0, 1195)        =      .
                                                    Prob > F          =      .
                                                    R-squared         = 0.1481
                                                    Adj R-squared     = 0.1075
                                                    Root MSE          = 0.1762

------------------------------------------------------------------------------
         ame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |   .0007771    .004978     0.16   0.876    -.0089896    .0105437
------------------------------------------------------------------------------
F test of absorbed indicators: F(57, 1195) = 3.645            Prob > F = 0.000

. *MEANS OF REGRESSORS USED TO SUMMARIZE SPEFICATIONS BY INDEX;
. *THIS CREATES DESCRIPTIVE TABLE OF DIFFERENT SPECIFICATIONS USED BY DIFFERENT BROUPS;
. tabulate index,  sum(scale);

            |          Summary of Scale
      index |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |   .10447761    .3070269         134
          2 |   .16911765   .37520081         544
          3 |   .15478261   .36201225         575
------------+------------------------------------
      Total |    .1556265   .36264562       1,253

. tabulate index, sum(stock);

            |          Summary of Stock
      index |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |   .58208955   .49506599         134
          2 |   .47058824   .49959359         544
          3 |   .49913043   .50043459         575
------------+------------------------------------
      Total |   .49561053   .50018037       1,253

. tabulate index, sum(flow);

            |           Summary of Flow
      index |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |   .41044776   .49376087         134
          2 |   .51286765   .50029444         544
          3 |   .44347826   .49722758         575
------------+------------------------------------
      Total |   .47007183   .49930278       1,253

. tabulate index, sum(level_cyear);

            |       Summary of level_cyear
      index |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |   .13432836   .34228434         134
          2 |   .12867647   .33514969         544
          3 |   .18782609    .3909133         575
------------+------------------------------------
      Total |   .15642458   .36340243       1,253

. tabulate index, sum(allavailable);

            |       Summary of allavailable
      index |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |   .23880597   .42795377         134
          2 |   .46691176   .49936315         544
          3 |   .24521739   .43059061         575
------------+------------------------------------
      Total |   .34078212   .47416147       1,253

. tabulate index, sum(w1996);

            |          Summary of w1996
      index |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |   .91044776   .28661065         134
          2 |   .63970588   .48052755         544
          3 |   .84695652   .36034288         575
------------+------------------------------------
      Total |   .76376696   .42493659       1,253

. tabulate index, sum(w2006);

            |          Summary of w2006
      index |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |           1           0         134
          2 |   .95588235   .20554548         544
          3 |   .92347826   .26606254         575
------------+------------------------------------
      Total |   .94573025   .22663967       1,253

. tabulate index, sum(w2016);

            |          Summary of w2016
      index |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |   .73134328   .44492424         134
          2 |      .65625   .47539603         544
          3 |   .60173913   .48996597         575
------------+------------------------------------
      Total |   .63926576   .48040528       1,253

. *REGRESSIONS ON PREDICTED AME;
. reg mame proindex     stats_brw topic_brw   t2 t3 i.mdegree  [aw=1/nmodel],  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1044
                                                Root MSE          =     .06708

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
        mame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0071417   .0043622     1.64   0.106    -.0015583    .0158418
   stats_brw |   .0207268   .0138095     1.50   0.138    -.0068154    .0482689
   topic_brw |   -.017735   .0114158    -1.55   0.125    -.0405031     .005033
          t2 |   .0183794     .00915     2.01   0.048     .0001304    .0366285
          t3 |   .0051618   .0165936     0.31   0.757    -.0279331    .0382566
             |
     mdegree |
          1  |   .0741924   .0403531     1.84   0.070    -.0062893    .1546742
          2  |  -.0046753   .0141589    -0.33   0.742    -.0329144    .0235639
          3  |  -.0075614   .0146567    -0.52   0.608    -.0367932    .0216703
          4  |  -.0120506   .0101371    -1.19   0.239    -.0322683    .0081671
          5  |   .0336762   .0260657     1.29   0.201    -.0183103    .0856627
          6  |   -.039282    .020212    -1.94   0.056    -.0795936    .0010297
         20  |  -.0103336   .0295501    -0.35   0.728    -.0692694    .0486022
         33  |  -.0014439   .0139046    -0.10   0.918    -.0291757    .0262878
         34  |  -.0016517   .0157784    -0.10   0.917    -.0331207    .0298173
         35  |  -.0362551   .0210535    -1.72   0.089     -.078245    .0057348
         36  |  -.0080813   .0134371    -0.60   0.550    -.0348808    .0187182
         40  |  -.0239589   .0226877    -1.06   0.295    -.0692081    .0212904
             |
       _cons |  -.0380721   .0205317    -1.85   0.068    -.0790212    .0028771
------------------------------------------------------------------------------

. reg mame p12 p56     stats_brw topic_brw   t2 t3 i.mdegree   [aw=1/nmodel],  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1095
                                                Root MSE          =     .06692

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
        mame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0261751   .0192805    -1.36   0.179    -.0646288    .0122786
         p56 |   .0138374   .0144197     0.96   0.341    -.0149218    .0425966
   stats_brw |   .0202475   .0131436     1.54   0.128    -.0059666    .0464617
   topic_brw |  -.0183254   .0109815    -1.67   0.100    -.0402274    .0035765
          t2 |   .0145378    .010295     1.41   0.162     -.005995    .0350705
          t3 |   .0033438   .0155573     0.21   0.830    -.0276844    .0343719
             |
     mdegree |
          1  |   .0820461   .0468225     1.75   0.084    -.0113384    .1754306
          2  |  -.0146605   .0168992    -0.87   0.389    -.0483649    .0190439
          3  |  -.0098372   .0149858    -0.66   0.514    -.0397254     .020051
          4  |   -.014653    .010344    -1.42   0.161    -.0352835    .0059776
          5  |   .0313873   .0251604     1.25   0.216    -.0187935    .0815682
          6  |  -.0402235   .0189607    -2.12   0.037    -.0780395   -.0024076
         20  |  -.0136753   .0294367    -0.46   0.644     -.072385    .0450345
         33  |  -.0046466   .0129901    -0.36   0.722    -.0305546    .0212613
         34  |  -.0048882   .0164515    -0.30   0.767    -.0376995    .0279232
         35  |  -.0409026   .0200401    -2.04   0.045    -.0808714   -.0009338
         36  |  -.0062189   .0097712    -0.64   0.527     -.025707    .0132692
         40  |  -.0261566   .0219596    -1.19   0.238    -.0699537    .0176404
             |
       _cons |  -.0072947   .0166458    -0.44   0.663    -.0404938    .0259043
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
        mame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0400125   .0203218     1.97   0.053     -.000518     .080543
------------------------------------------------------------------------------

. reg mame group3     stats_brw topic_brw   t2 t3 i.mdegree   [aw=1/nmodel],  cluster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1155
                                                Root MSE          =     .06667

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
        mame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |   .0236824   .0103261     2.29   0.025     .0030877    .0442771
   stats_brw |   .0198188   .0128672     1.54   0.128    -.0058441    .0454816
   topic_brw |  -.0171352   .0105668    -1.62   0.109    -.0382101    .0039398
          t2 |   .0272285   .0107085     2.54   0.013      .005871    .0485859
          t3 |    .006578   .0155068     0.42   0.673    -.0243493    .0375053
             |
     mdegree |
          1  |   .0684436   .0428208     1.60   0.114    -.0169597     .153847
          2  |  -.0004916   .0126716    -0.04   0.969    -.0257644    .0247811
          3  |  -.0101492   .0166414    -0.61   0.544    -.0433395    .0230411
          4  |  -.0135156   .0114403    -1.18   0.241    -.0363325    .0093014
          5  |   .0363944   .0232299     1.57   0.122    -.0099361    .0827249
          6  |  -.0305858   .0191148    -1.60   0.114    -.0687091    .0075375
         20  |  -.0143843   .0329724    -0.44   0.664    -.0801457    .0513772
         33  |   .0015868   .0112115     0.14   0.888     -.020774    .0239475
         34  |  -.0060653   .0148935    -0.41   0.685    -.0357694    .0236388
         35  |  -.0357003   .0129468    -2.76   0.007    -.0615219   -.0098788
         36  |  -.0004176   .0087978    -0.05   0.962    -.0179643    .0171291
         40  |  -.0180305   .0221809    -0.81   0.419     -.062269     .026208
             |
       _cons |  -.0205562   .0145848    -1.41   0.163    -.0496446    .0085322
------------------------------------------------------------------------------

. reg mame group1 group3     stats_brw topic_brw   t2 t3 i.mdegree   [aw=1/nmodel],  cluster(teami
> d);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1402
                                                Root MSE          =     .06575

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
        mame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0443863   .0241664    -1.84   0.071    -.0925847    .0038121
      group3 |   .0137952   .0078983     1.75   0.085    -.0019574    .0295479
   stats_brw |   .0178412   .0123258     1.45   0.152    -.0067419    .0424243
   topic_brw |  -.0177872   .0105671    -1.68   0.097    -.0388627    .0032882
          t2 |   .0135705   .0113993     1.19   0.238    -.0091647    .0363058
          t3 |   .0009422   .0168748     0.06   0.956    -.0327136     .034598
             |
     mdegree |
          1  |   .0911085   .0465056     1.96   0.054     -.001644    .1838611
          2  |  -.0167362   .0168719    -0.99   0.325    -.0503861    .0169137
          3  |  -.0068092   .0146878    -0.46   0.644     -.036103    .0224846
          4  |  -.0134945   .0112613    -1.20   0.235    -.0359545    .0089654
          5  |   .0375269   .0257734     1.46   0.150    -.0138765    .0889302
          6  |  -.0364172   .0217967    -1.67   0.099    -.0798894    .0070549
         20  |  -.0128189    .030646    -0.42   0.677    -.0739405    .0483027
         33  |   .0035284   .0127101     0.28   0.782    -.0218211     .028878
         34  |  -.0106275    .012209    -0.87   0.387    -.0349776    .0137226
         35  |  -.0392768    .016587    -2.37   0.021    -.0723587    -.006195
         36  |   .0359964   .0242982     1.48   0.143     -.012465    .0844577
         40  |  -.0061325   .0144305    -0.42   0.672    -.0349132    .0226481
             |
       _cons |  -.0053938    .018068    -0.30   0.766    -.0414292    .0306416
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
        mame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0581816   .0253187     2.30   0.025      .007685    .1086782
------------------------------------------------------------------------------

.  reg mame proindex     stats_brw topic_brw   t2 t3 i.mdegree  [aw=meanpeer/nmodel],  cluster(tea
> mid);
(sum of wgt is 299.6499427551315)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1122
                                                Root MSE          =     .06585

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
        mame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0080163    .004456     1.80   0.076    -.0008709    .0169035
   stats_brw |   .0223993    .013902     1.61   0.112    -.0053273    .0501259
   topic_brw |  -.0181759   .0113851    -1.60   0.115    -.0408828    .0045311
          t2 |   .0172909   .0091925     1.88   0.064    -.0010429    .0356247
          t3 |   .0015729   .0177605     0.09   0.930    -.0338493    .0369951
             |
     mdegree |
          1  |   .0797535   .0419538     1.90   0.061    -.0039208    .1634277
          2  |  -.0049585   .0142794    -0.35   0.729    -.0334378    .0235207
          3  |  -.0099313   .0165058    -0.60   0.549    -.0428511    .0229884
          4  |  -.0129571   .0109136    -1.19   0.239    -.0347237    .0088094
          5  |   .0337173   .0245149     1.38   0.173    -.0151762    .0826107
          6  |  -.0409757   .0223865    -1.83   0.071    -.0856241    .0036728
         20  |  -.0158752   .0279321    -0.57   0.572     -.071584    .0398335
         33  |  -.0014594   .0128595    -0.11   0.910    -.0271069    .0241881
         34  |    .001589   .0170616     0.09   0.926    -.0324393    .0356173
         35  |  -.0344413   .0198614    -1.73   0.087    -.0740537    .0051711
         36  |  -.0063936   .0123733    -0.52   0.607    -.0310714    .0182841
         40  |  -.0200154   .0232917    -0.86   0.393    -.0664693    .0264385
             |
       _cons |  -.0403814   .0206376    -1.96   0.054    -.0815418    .0007789
------------------------------------------------------------------------------

. reg mame p12 p56     stats_brw topic_brw   t2 t3 i.mdegree  [aw=meanpeer/nmodel],  cluster(teami
> d);
(sum of wgt is 299.6499427551315)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1188
                                                Root MSE          =     .06563

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
        mame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         p12 |  -.0272206   .0202962    -1.34   0.184    -.0677001     .013259
         p56 |   .0166762   .0146578     1.14   0.259     -.012558    .0459103
   stats_brw |   .0218461   .0132705     1.65   0.104    -.0046211    .0483133
   topic_brw |  -.0186622   .0109828    -1.70   0.094    -.0405668    .0032424
          t2 |   .0133623   .0102586     1.30   0.197    -.0070979    .0338225
          t3 |    .000018   .0167526     0.00   0.999    -.0333939      .03343
             |
     mdegree |
          1  |   .0881052    .048552     1.81   0.074    -.0087288    .1849392
          2  |  -.0143723   .0168725    -0.85   0.397    -.0480235    .0192788
          3  |  -.0121275   .0164873    -0.74   0.464    -.0450104    .0207555
          4  |  -.0152229   .0109819    -1.39   0.170    -.0371256    .0066799
          5  |   .0319308   .0237121     1.35   0.182    -.0153614    .0792231
          6  |  -.0410561   .0206407    -1.99   0.051    -.0822226    .0001105
         20  |  -.0191337   .0280898    -0.68   0.498    -.0751571    .0368897
         33  |  -.0044721   .0120303    -0.37   0.711    -.0284658    .0195216
         34  |   -.001755   .0177294    -0.10   0.921    -.0371152    .0336051
         35  |  -.0390782   .0188793    -2.07   0.042    -.0767319   -.0014246
         36  |  -.0042927   .0095375    -0.45   0.654    -.0233146    .0147292
         40  |  -.0218583   .0231414    -0.94   0.348    -.0680124    .0242958
             |
       _cons |  -.0074822   .0170454    -0.44   0.662    -.0414781    .0265138
------------------------------------------------------------------------------

. lincom p56-p12;

 ( 1)  - p12 + p56 = 0

------------------------------------------------------------------------------
        mame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0438967   .0227346     1.93   0.058    -.0014461    .0892395
------------------------------------------------------------------------------

. reg mame group3     stats_brw topic_brw   t2 t3 i.mdegree  [aw=meanpeer/nmodel],  cluster(teamid
> );
(sum of wgt is 299.6499427551315)

Linear regression                               Number of obs     =      1,253
                                                F(13, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1237
                                                Root MSE          =     .06542

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
        mame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group3 |   .0251248   .0111216     2.26   0.027     .0029434    .0473062
   stats_brw |   .0214517   .0129708     1.65   0.103    -.0044179    .0473212
   topic_brw |  -.0175682   .0105909    -1.66   0.102    -.0386911    .0035547
          t2 |   .0267472   .0108325     2.47   0.016     .0051426    .0483519
          t3 |   .0032855   .0165563     0.20   0.843     -.029735     .036306
             |
     mdegree |
          1  |   .0721341   .0430085     1.68   0.098    -.0136437    .1579119
          2  |  -.0016548   .0129714    -0.13   0.899    -.0275254    .0242157
          3  |  -.0131122   .0182575    -0.72   0.475    -.0495256    .0233012
          4  |  -.0150728   .0121499    -1.24   0.219     -.039305    .0091595
          5  |    .034873   .0221119     1.58   0.119    -.0092277    .0789737
          6  |  -.0324103   .0208428    -1.55   0.124    -.0739799    .0091593
         20  |  -.0209255   .0314603    -0.67   0.508    -.0836711    .0418201
         33  |     .00125   .0107514     0.12   0.908     -.020193    .0226929
         34  |  -.0040417   .0153693    -0.26   0.793    -.0346949    .0266114
         35  |  -.0345629   .0118253    -2.92   0.005    -.0581477   -.0109781
         36  |   .0007047     .00863     0.08   0.935    -.0165072    .0179167
         40  |   -.014807   .0232984    -0.64   0.527    -.0612742    .0316601
             |
       _cons |  -.0193658   .0150883    -1.28   0.204    -.0494586    .0107269
------------------------------------------------------------------------------

. reg mame group1 group3     stats_brw topic_brw   t2 t3 i.mdegree  [aw=meanpeer/nmodel],  cluster
> (teamid);
(sum of wgt is 299.6499427551315)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1558
                                                Root MSE          =     .06424

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
        mame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0488941   .0267774    -1.83   0.072    -.1023001    .0045118
      group3 |   .0140583   .0077799     1.81   0.075    -.0014582    .0295748
   stats_brw |   .0192217   .0122353     1.57   0.121    -.0051809    .0436243
   topic_brw |  -.0182751   .0106214    -1.72   0.090    -.0394588    .0029086
          t2 |   .0113113   .0114827     0.99   0.328    -.0115903    .0342129
          t3 |  -.0029541   .0179597    -0.16   0.870    -.0387735    .0328653
             |
     mdegree |
          1  |   .0967506   .0478584     2.02   0.047        .0013    .1922012
          2  |  -.0197481   .0180391    -1.09   0.277    -.0557259    .0162298
          3  |  -.0093649   .0156021    -0.60   0.550    -.0404823    .0217526
          4  |  -.0149588   .0116586    -1.28   0.204     -.038211    .0082935
          5  |   .0368902     .02524     1.46   0.148    -.0134495    .0872298
          6  |  -.0386826   .0237289    -1.63   0.108    -.0860084    .0086433
         20  |  -.0184699   .0285496    -0.65   0.520    -.0754103    .0384705
         33  |   .0035714   .0129193     0.28   0.783    -.0221953    .0293382
         34  |   -.009088   .0122858    -0.74   0.462    -.0335912    .0154153
         35  |  -.0385767   .0158947    -2.43   0.018    -.0702776   -.0068757
         36  |   .0406841   .0264793     1.54   0.129    -.0121272    .0934955
         40  |  -.0027148   .0153129    -0.18   0.860    -.0332555    .0278259
             |
       _cons |  -.0024685   .0192477    -0.13   0.898    -.0408567    .0359198
------------------------------------------------------------------------------

. lincom group3-group1;

 ( 1)  - group1 + group3 = 0

------------------------------------------------------------------------------
        mame | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   .0629524   .0281812     2.23   0.029     .0067468    .1191581
------------------------------------------------------------------------------

. *THIS PRODUCES THE GRAPH SHOWING DISTRIBUTION DIFFERENCES IN PREDICTED AME ACROSS TEAMS;
. *twoway (kdensity mame if index==1 [fw=1], kernel(ep) lcolor(red) fcolor(red%2) lwidth(medium) b
> width(.03) )
>         (kdensity mame if index==2 [fw=1],kernel(ep) lcolor(green) fcolor(green%20) lwidth(mediu
> m) bwidth(.03) ) 
>         (kdensity mame if index==3 [fw=1], kernel(ep) lcolor(blue) fcolor(blue%2) lwidth(medium)
>  bwidth(.03)) ,
>         legend(pos(6) rows(1)) legend(order(1 "Anti-immigrant teams" 2 "Moderate teams" 3 "Pro-i
> mmigrant teams"))
>         saving(/volumes/ddisk/mi/researcher/hist_pred_ame.gph, replace);
. *THIS SAVES THE GRAPH;
. *twoway (kdensity mame if index==1 [fw=1], kernel(ep) lcolor(red) fcolor(red%2) lwidth(medium) b
> width(.03) )
>         (kdensity mame if index==2 [fw=1],kernel(ep) lcolor(green) fcolor(green%20) lwidth(mediu
> m) bwidth(.03) ) 
>         (kdensity mame if index==3 [fw=1], kernel(ep) lcolor(blue) fcolor(blue%2) lwidth(medium)
>  bwidth(.03)) ,
>         legend(pos(6) rows(1)) legend(order(1 "Anti-immigrant teams" 2 "Moderate teams" 3 "Pro-i
> mmigrant teams"))
>         saving(/volumes/ddisk/mi/researcher/hist_pred_ame.gph, replace);
. sort mame;

. generate newmame=int(mame*1000000);

. unique newmame;
Number of unique values of newmame is  58
Number of records is  1253

. egen newspec=group(newmame);

. list newmame spec newspec;

      +--------------------------+
      | newmame   spec   newspec |
      |--------------------------|
   1. | -379790     34         1 |
   2. | -130925      5         2 |
   3. | -130925      5         2 |
   4. | -130925      5         2 |
   5. | -130925      5         2 |
      |--------------------------|
   6. | -130925      5         2 |
   7. | -130925      5         2 |
   8. | -123281     15         3 |
   9. | -123281     15         3 |
  10. | -123281     15         3 |
      |--------------------------|
  11. | -123281     15         3 |
  12. | -123281     15         3 |
  13. | -123281     15         3 |
  14. | -123281     15         3 |
  15. | -123281     15         3 |
      |--------------------------|
  16. | -123281     15         3 |
  17. | -123281     15         3 |
  18. | -123281     15         3 |
  19. | -123281     15         3 |
  20. | -123281     15         3 |
      |--------------------------|
  21. | -123281     15         3 |
  22. | -123281     15         3 |
  23. | -123281     15         3 |
  24. | -123281     15         3 |
  25. | -123281     15         3 |
      |--------------------------|
  26. | -123281     15         3 |
  27. | -123281     15         3 |
  28. | -123281     15         3 |
  29. | -123281     15         3 |
  30. | -113830     35         4 |
      |--------------------------|
  31. |  -93096      6         5 |
  32. |  -93096      6         5 |
  33. |  -93096      6         5 |
  34. |  -93096      6         5 |
  35. |  -93096      6         5 |
      |--------------------------|
  36. |  -93096      6         5 |
  37. |  -93096      6         5 |
  38. |  -93096      6         5 |
  39. |  -93096      6         5 |
  40. |  -93096      6         5 |
      |--------------------------|
  41. |  -93096      6         5 |
  42. |  -93096      6         5 |
  43. |  -93096      6         5 |
  44. |  -93096      6         5 |
  45. |  -93096      6         5 |
      |--------------------------|
  46. |  -93096      6         5 |
  47. |  -73083     45         6 |
  48. |  -73083     45         6 |
  49. |  -73083     45         6 |
  50. |  -73083     45         6 |
      |--------------------------|
  51. |  -73083     45         6 |
  52. |  -73083     45         6 |
  53. |  -67415     48         7 |
  54. |  -67415     48         7 |
  55. |  -67415     48         7 |
      |--------------------------|
  56. |  -67415     48         7 |
  57. |  -67415     48         7 |
  58. |  -67415     48         7 |
  59. |  -67415     48         7 |
  60. |  -67415     48         7 |
      |--------------------------|
  61. |  -67415     48         7 |
  62. |  -67415     48         7 |
  63. |  -47608     41         8 |
  64. |  -47608     41         8 |
  65. |  -47608     41         8 |
      |--------------------------|
  66. |  -47608     41         8 |
  67. |  -47608     41         8 |
  68. |  -47608     41         8 |
  69. |  -47608     41         8 |
  70. |  -47608     41         8 |
      |--------------------------|
  71. |  -38657     40         9 |
  72. |  -38657     40         9 |
  73. |  -38657     40         9 |
  74. |  -38657     40         9 |
  75. |  -38657     40         9 |
      |--------------------------|
  76. |  -38657     40         9 |
  77. |  -38657     40         9 |
  78. |  -38657     40         9 |
  79. |  -38657     40         9 |
  80. |  -38657     40         9 |
      |--------------------------|
  81. |  -38657     40         9 |
  82. |  -38657     40         9 |
  83. |  -38657     40         9 |
  84. |  -38657     40         9 |
  85. |  -38657     40         9 |
      |--------------------------|
  86. |  -38657     40         9 |
  87. |  -38657     40         9 |
  88. |  -38657     40         9 |
  89. |  -38657     40         9 |
  90. |  -38657     40         9 |
      |--------------------------|
  91. |  -38657     40         9 |
  92. |  -38657     40         9 |
  93. |  -38657     40         9 |
  94. |  -38657     40         9 |
  95. |  -38657     40         9 |
      |--------------------------|
  96. |  -38657     40         9 |
  97. |  -36550     33        10 |
  98. |  -36550     33        10 |
  99. |  -36550     33        10 |
 100. |  -34655     38        11 |
      |--------------------------|
 101. |  -34655     38        11 |
 102. |  -34655     38        11 |
 103. |  -34655     38        11 |
 104. |  -29215     13        12 |
 105. |  -29215     13        12 |
      |--------------------------|
 106. |  -29215     13        12 |
 107. |  -29215     13        12 |
 108. |  -29215     13        12 |
 109. |  -29215     13        12 |
 110. |  -29215     13        12 |
      |--------------------------|
 111. |  -29215     13        12 |
 112. |  -29215     13        12 |
 113. |  -29215     13        12 |
 114. |  -29215     13        12 |
 115. |  -29215     13        12 |
      |--------------------------|
 116. |  -29215     13        12 |
 117. |  -29215     13        12 |
 118. |  -29215     13        12 |
 119. |  -29215     13        12 |
 120. |  -29215     13        12 |
      |--------------------------|
 121. |  -29215     13        12 |
 122. |  -29215     13        12 |
 123. |  -29215     13        12 |
 124. |  -29215     13        12 |
 125. |  -29215     13        12 |
      |--------------------------|
 126. |  -29215     13        12 |
 127. |  -29215     13        12 |
 128. |  -29215     13        12 |
 129. |  -29215     13        12 |
 130. |  -29215     13        12 |
      |--------------------------|
 131. |  -29215     13        12 |
 132. |  -29215     13        12 |
 133. |  -29215     13        12 |
 134. |  -29215     13        12 |
 135. |  -29215     13        12 |
      |--------------------------|
 136. |  -29215     13        12 |
 137. |  -29215     13        12 |
 138. |  -29215     13        12 |
 139. |  -29215     13        12 |
 140. |  -29215     13        12 |
      |--------------------------|
 141. |  -29215     13        12 |
 142. |  -29215     13        12 |
 143. |  -29215     13        12 |
 144. |  -25540     47        13 |
 145. |  -25540     47        13 |
      |--------------------------|
 146. |  -25540     47        13 |
 147. |  -25540     47        13 |
 148. |  -25540     47        13 |
 149. |  -25540     47        13 |
 150. |  -25540     47        13 |
      |--------------------------|
 151. |  -21131      8        14 |
 152. |  -21131      8        14 |
 153. |  -21131      8        14 |
 154. |  -21131      8        14 |
 155. |  -21131      8        14 |
      |--------------------------|
 156. |  -21131      8        14 |
 157. |  -21131      8        14 |
 158. |  -21131      8        14 |
 159. |  -21131      8        14 |
 160. |  -21131      8        14 |
      |--------------------------|
 161. |  -21131      8        14 |
 162. |  -21131      8        14 |
 163. |  -21131      8        14 |
 164. |  -21131      8        14 |
 165. |  -21131      8        14 |
      |--------------------------|
 166. |  -21131      8        14 |
 167. |  -21131      8        14 |
 168. |  -21131      8        14 |
 169. |  -21131      8        14 |
 170. |  -21131      8        14 |
      |--------------------------|
 171. |  -21131      8        14 |
 172. |  -21131      8        14 |
 173. |  -21131      8        14 |
 174. |  -21131      8        14 |
 175. |  -21131      8        14 |
      |--------------------------|
 176. |  -21131      8        14 |
 177. |  -21131      8        14 |
 178. |  -21131      8        14 |
 179. |  -21131      8        14 |
 180. |  -21131      8        14 |
      |--------------------------|
 181. |  -21131      8        14 |
 182. |  -21131      8        14 |
 183. |  -21131      8        14 |
 184. |  -21131      8        14 |
 185. |  -21131      8        14 |
      |--------------------------|
 186. |  -21131      8        14 |
 187. |  -21131      8        14 |
 188. |  -21131      8        14 |
 189. |  -21131      8        14 |
 190. |  -21131      8        14 |
      |--------------------------|
 191. |  -21131      8        14 |
 192. |  -21131      8        14 |
 193. |  -21131      8        14 |
 194. |  -21131      8        14 |
 195. |  -21131      8        14 |
      |--------------------------|
 196. |  -21131      8        14 |
 197. |  -21131      8        14 |
 198. |  -21131      8        14 |
 199. |  -21131      8        14 |
 200. |  -21131      8        14 |
      |--------------------------|
 201. |  -21131      8        14 |
 202. |  -21131      8        14 |
 203. |  -21131      8        14 |
 204. |  -21131      8        14 |
 205. |  -21131      8        14 |
      |--------------------------|
 206. |  -21131      8        14 |
 207. |  -21131      8        14 |
 208. |  -21131      8        14 |
 209. |  -21131      8        14 |
 210. |  -21131      8        14 |
      |--------------------------|
 211. |  -21131      8        14 |
 212. |  -21131      8        14 |
 213. |  -21131      8        14 |
 214. |  -21131      8        14 |
 215. |  -21131      8        14 |
      |--------------------------|
 216. |  -21131      8        14 |
 217. |  -21131      8        14 |
 218. |  -21131      8        14 |
 219. |  -21131      8        14 |
 220. |  -21131      8        14 |
      |--------------------------|
 221. |  -21131      8        14 |
 222. |  -21131      8        14 |
 223. |  -21131      8        14 |
 224. |  -21131      8        14 |
 225. |  -21131      8        14 |
      |--------------------------|
 226. |  -21131      8        14 |
 227. |  -21131      8        14 |
 228. |  -21131      8        14 |
 229. |  -21131      8        14 |
 230. |  -21131      8        14 |
      |--------------------------|
 231. |  -21131      8        14 |
 232. |  -21131      8        14 |
 233. |  -21131      8        14 |
 234. |  -21131      8        14 |
 235. |  -21131      8        14 |
      |--------------------------|
 236. |  -21131      8        14 |
 237. |  -21131      8        14 |
 238. |  -21131      8        14 |
 239. |  -21131      8        14 |
 240. |  -21131      8        14 |
      |--------------------------|
 241. |  -21131      8        14 |
 242. |  -21131      8        14 |
 243. |  -21131      8        14 |
 244. |  -21131      8        14 |
 245. |  -21131      8        14 |
      |--------------------------|
 246. |  -21131      8        14 |
 247. |  -21131      8        14 |
 248. |  -21131      8        14 |
 249. |  -21131      8        14 |
 250. |  -21131      8        14 |
      |--------------------------|
 251. |  -21131      8        14 |
 252. |  -21131      8        14 |
 253. |  -21131      8        14 |
 254. |  -21131      8        14 |
 255. |  -21131      8        14 |
      |--------------------------|
 256. |  -21131      8        14 |
 257. |  -18416     29        15 |
 258. |  -18416     29        15 |
 259. |  -18416     29        15 |
 260. |  -18416     29        15 |
      |--------------------------|
 261. |  -18416     29        15 |
 262. |  -18416     29        15 |
 263. |  -18416     29        15 |
 264. |  -18416     29        15 |
 265. |  -18416     29        15 |
      |--------------------------|
 266. |  -18416     29        15 |
 267. |  -18416     29        15 |
 268. |  -18416     29        15 |
 269. |  -18202     42        16 |
 270. |  -18202     42        16 |
      |--------------------------|
 271. |  -18202     42        16 |
 272. |  -18202     42        16 |
 273. |  -18063     11        17 |
 274. |  -18063     11        17 |
 275. |  -18063     11        17 |
      |--------------------------|
 276. |  -18063     11        17 |
 277. |  -18063     11        17 |
 278. |  -18063     11        17 |
 279. |  -18063     11        17 |
 280. |  -18063     11        17 |
      |--------------------------|
 281. |  -18063     11        17 |
 282. |  -18063     11        17 |
 283. |  -18063     11        17 |
 284. |  -18063     11        17 |
 285. |  -18063     11        17 |
      |--------------------------|
 286. |  -18063     11        17 |
 287. |  -18063     11        17 |
 288. |  -18063     11        17 |
 289. |  -18063     11        17 |
 290. |  -18063     11        17 |
      |--------------------------|
 291. |  -18063     11        17 |
 292. |  -18063     11        17 |
 293. |  -18063     11        17 |
 294. |  -18063     11        17 |
 295. |  -18063     11        17 |
      |--------------------------|
 296. |  -18063     11        17 |
 297. |  -18063     11        17 |
 298. |  -18063     11        17 |
 299. |  -18063     11        17 |
 300. |  -18063     11        17 |
      |--------------------------|
 301. |  -18063     11        17 |
 302. |  -18063     11        17 |
 303. |  -18063     11        17 |
 304. |  -18063     11        17 |
 305. |  -18063     11        17 |
      |--------------------------|
 306. |  -18063     11        17 |
 307. |  -18063     11        17 |
 308. |  -18063     11        17 |
 309. |  -18063     11        17 |
 310. |  -18063     11        17 |
      |--------------------------|
 311. |  -18063     11        17 |
 312. |  -18063     11        17 |
 313. |  -18063     11        17 |
 314. |  -18063     11        17 |
 315. |  -18063     11        17 |
      |--------------------------|
 316. |  -18063     11        17 |
 317. |  -18063     11        17 |
 318. |  -18063     11        17 |
 319. |  -18063     11        17 |
 320. |  -18063     11        17 |
      |--------------------------|
 321. |  -18063     11        17 |
 322. |  -18063     11        17 |
 323. |  -18063     11        17 |
 324. |  -18063     11        17 |
 325. |  -18063     11        17 |
      |--------------------------|
 326. |  -18063     11        17 |
 327. |  -18063     11        17 |
 328. |  -18063     11        17 |
 329. |  -18063     11        17 |
 330. |  -18063     11        17 |
      |--------------------------|
 331. |  -18063     11        17 |
 332. |  -18063     11        17 |
 333. |  -18063     11        17 |
 334. |  -18063     11        17 |
 335. |  -18063     11        17 |
      |--------------------------|
 336. |  -18063     11        17 |
 337. |  -18063     11        17 |
 338. |  -18063     11        17 |
 339. |  -18063     11        17 |
 340. |  -18063     11        17 |
      |--------------------------|
 341. |  -18063     11        17 |
 342. |  -18063     11        17 |
 343. |  -18063     11        17 |
 344. |  -18063     11        17 |
 345. |  -18063     11        17 |
      |--------------------------|
 346. |  -18063     11        17 |
 347. |  -18063     11        17 |
 348. |  -18063     11        17 |
 349. |  -18063     11        17 |
 350. |  -18063     11        17 |
      |--------------------------|
 351. |  -18063     11        17 |
 352. |  -18063     11        17 |
 353. |  -18063     11        17 |
 354. |  -18063     11        17 |
 355. |  -18063     11        17 |
      |--------------------------|
 356. |  -18063     11        17 |
 357. |  -13440     30        18 |
 358. |  -13440     30        18 |
 359. |  -13440     30        18 |
 360. |  -13440     30        18 |
      |--------------------------|
 361. |  -13440     30        18 |
 362. |  -13440     30        18 |
 363. |  -13440     30        18 |
 364. |  -13440     30        18 |
 365. |  -13440     30        18 |
      |--------------------------|
 366. |  -13440     30        18 |
 367. |  -13440     30        18 |
 368. |  -13440     30        18 |
 369. |  -13440     30        18 |
 370. |  -13440     30        18 |
      |--------------------------|
 371. |  -13440     30        18 |
 372. |  -13440     30        18 |
 373. |  -13440     30        18 |
 374. |  -13440     30        18 |
 375. |  -13440     30        18 |
      |--------------------------|
 376. |  -13440     30        18 |
 377. |  -13440     30        18 |
 378. |  -13440     30        18 |
 379. |  -13440     30        18 |
 380. |  -13440     30        18 |
      |--------------------------|
 381. |  -13440     30        18 |
 382. |  -13440     30        18 |
 383. |  -13440     30        18 |
 384. |  -13440     30        18 |
 385. |  -13440     30        18 |
      |--------------------------|
 386. |  -13440     30        18 |
 387. |  -13440     30        18 |
 388. |  -13440     30        18 |
 389. |  -13440     30        18 |
 390. |  -13440     30        18 |
      |--------------------------|
 391. |  -12715     56        19 |
 392. |  -12715     56        19 |
 393. |  -12666     55        20 |
 394. |  -12666     55        20 |
 395. |  -12666     55        20 |
      |--------------------------|
 396. |  -10692     22        21 |
 397. |  -10692     22        21 |
 398. |  -10692     22        21 |
 399. |  -10692     22        21 |
 400. |  -10692     22        21 |
      |--------------------------|
 401. |  -10692     22        21 |
 402. |  -10692     22        21 |
 403. |  -10692     22        21 |
 404. |  -10692     22        21 |
 405. |  -10692     22        21 |
      |--------------------------|
 406. |  -10692     22        21 |
 407. |  -10692     22        21 |
 408. |  -10692     22        21 |
 409. |  -10692     22        21 |
 410. |  -10692     22        21 |
      |--------------------------|
 411. |  -10692     22        21 |
 412. |  -10692     22        21 |
 413. |  -10692     22        21 |
 414. |  -10692     22        21 |
 415. |  -10692     22        21 |
      |--------------------------|
 416. |  -10692     22        21 |
 417. |  -10692     22        21 |
 418. |  -10692     22        21 |
 419. |  -10692     22        21 |
 420. |  -10692     22        21 |
      |--------------------------|
 421. |  -10692     22        21 |
 422. |  -10692     22        21 |
 423. |  -10692     22        21 |
 424. |  -10692     22        21 |
 425. |  -10692     22        21 |
      |--------------------------|
 426. |  -10692     22        21 |
 427. |  -10692     22        21 |
 428. |  -10692     22        21 |
 429. |  -10692     22        21 |
 430. |  -10692     22        21 |
      |--------------------------|
 431. |  -10692     22        21 |
 432. |  -10692     22        21 |
 433. |  -10692     22        21 |
 434. |  -10692     22        21 |
 435. |  -10692     22        21 |
      |--------------------------|
 436. |  -10692     22        21 |
 437. |  -10692     22        21 |
 438. |  -10692     22        21 |
 439. |  -10692     22        21 |
 440. |  -10692     22        21 |
      |--------------------------|
 441. |  -10692     22        21 |
 442. |  -10692     22        21 |
 443. |  -10692     22        21 |
 444. |  -10692     22        21 |
 445. |  -10692     22        21 |
      |--------------------------|
 446. |  -10692     22        21 |
 447. |  -10692     22        21 |
 448. |  -10692     22        21 |
 449. |  -10692     22        21 |
 450. |  -10692     22        21 |
      |--------------------------|
 451. |  -10692     22        21 |
 452. |  -10692     22        21 |
 453. |  -10692     22        21 |
 454. |  -10692     22        21 |
 455. |  -10692     22        21 |
      |--------------------------|
 456. |  -10692     22        21 |
 457. |  -10692     22        21 |
 458. |  -10692     22        21 |
 459. |  -10692     22        21 |
 460. |  -10692     22        21 |
      |--------------------------|
 461. |  -10692     22        21 |
 462. |  -10692     22        21 |
 463. |  -10692     22        21 |
 464. |  -10692     22        21 |
 465. |  -10692     22        21 |
      |--------------------------|
 466. |  -10692     22        21 |
 467. |  -10692     22        21 |
 468. |  -10692     22        21 |
 469. |  -10692     22        21 |
 470. |  -10692     22        21 |
      |--------------------------|
 471. |  -10692     22        21 |
 472. |  -10692     22        21 |
 473. |  -10692     22        21 |
 474. |  -10692     22        21 |
 475. |  -10692     22        21 |
      |--------------------------|
 476. |  -10692     22        21 |
 477. |  -10692     22        21 |
 478. |  -10692     22        21 |
 479. |  -10692     22        21 |
 480. |  -10692     22        21 |
      |--------------------------|
 481. |  -10692     22        21 |
 482. |  -10692     22        21 |
 483. |  -10692     22        21 |
 484. |  -10692     22        21 |
 485. |  -10692     22        21 |
      |--------------------------|
 486. |  -10692     22        21 |
 487. |  -10692     22        21 |
 488. |  -10692     22        21 |
 489. |  -10692     22        21 |
 490. |  -10692     22        21 |
      |--------------------------|
 491. |  -10692     22        21 |
 492. |  -10692     22        21 |
 493. |  -10692     22        21 |
 494. |  -10692     22        21 |
 495. |  -10692     22        21 |
      |--------------------------|
 496. |  -10692     22        21 |
 497. |  -10692     22        21 |
 498. |  -10692     22        21 |
 499. |  -10692     22        21 |
 500. |  -10692     22        21 |
      |--------------------------|
 501. |  -10692     22        21 |
 502. |  -10692     22        21 |
 503. |  -10692     22        21 |
 504. |  -10692     22        21 |
 505. |  -10692     22        21 |
      |--------------------------|
 506. |  -10692     22        21 |
 507. |  -10692     22        21 |
 508. |   -9905     25        22 |
 509. |   -9905     25        22 |
 510. |   -9905     25        22 |
      |--------------------------|
 511. |   -9905     25        22 |
 512. |   -9905     25        22 |
 513. |   -9905     25        22 |
 514. |   -9905     25        22 |
 515. |   -9905     25        22 |
      |--------------------------|
 516. |   -9356     19        23 |
 517. |   -9356     19        23 |
 518. |   -9356     19        23 |
 519. |   -9356     19        23 |
 520. |   -9356     19        23 |
      |--------------------------|
 521. |   -9356     19        23 |
 522. |   -9356     19        23 |
 523. |   -9356     19        23 |
 524. |   -9356     19        23 |
 525. |   -9356     19        23 |
      |--------------------------|
 526. |   -9356     19        23 |
 527. |   -9356     19        23 |
 528. |   -9356     19        23 |
 529. |   -9356     19        23 |
 530. |   -9356     19        23 |
      |--------------------------|
 531. |   -9356     19        23 |
 532. |   -8989     32        24 |
 533. |   -8989     32        24 |
 534. |   -8989     32        24 |
 535. |   -8989     32        24 |
      |--------------------------|
 536. |   -8989     32        24 |
 537. |   -8989     32        24 |
 538. |   -8989     32        24 |
 539. |   -8989     32        24 |
 540. |   -8989     32        24 |
      |--------------------------|
 541. |   -8989     32        24 |
 542. |   -8989     32        24 |
 543. |   -8989     32        24 |
 544. |   -8989     32        24 |
 545. |   -8989     32        24 |
      |--------------------------|
 546. |   -8989     32        24 |
 547. |   -8989     32        24 |
 548. |   -8989     32        24 |
 549. |   -8989     32        24 |
 550. |   -8989     32        24 |
      |--------------------------|
 551. |   -8989     32        24 |
 552. |   -8989     32        24 |
 553. |   -8989     32        24 |
 554. |   -7611     53        25 |
 555. |   -7611     53        25 |
      |--------------------------|
 556. |   -7611     53        25 |
 557. |   -7611     53        25 |
 558. |   -7611     53        25 |
 559. |   -7611     53        25 |
 560. |   -7611     53        25 |
      |--------------------------|
 561. |   -7611     53        25 |
 562. |   -6742     26        26 |
 563. |   -6742     26        26 |
 564. |   -6742     26        26 |
 565. |   -6742     26        26 |
      |--------------------------|
 566. |   -6742     26        26 |
 567. |   -6742     26        26 |
 568. |   -6742     26        26 |
 569. |   -6742     26        26 |
 570. |   -6742     26        26 |
      |--------------------------|
 571. |   -6742     26        26 |
 572. |   -6742     26        26 |
 573. |   -6742     26        26 |
 574. |   -6742     26        26 |
 575. |   -6742     26        26 |
      |--------------------------|
 576. |   -6742     26        26 |
 577. |   -6742     26        26 |
 578. |   -6742     26        26 |
 579. |   -6742     26        26 |
 580. |   -6742     26        26 |
      |--------------------------|
 581. |   -6742     26        26 |
 582. |   -6742     26        26 |
 583. |   -6742     26        26 |
 584. |   -6742     26        26 |
 585. |   -6742     26        26 |
      |--------------------------|
 586. |   -6742     26        26 |
 587. |   -6742     26        26 |
 588. |   -6742     26        26 |
 589. |   -6742     26        26 |
 590. |   -6742     26        26 |
      |--------------------------|
 591. |   -6742     26        26 |
 592. |   -6742     26        26 |
 593. |   -6742     26        26 |
 594. |   -6742     26        26 |
 595. |   -6742     26        26 |
      |--------------------------|
 596. |   -6742     26        26 |
 597. |   -6742     26        26 |
 598. |   -6742     26        26 |
 599. |   -6742     26        26 |
 600. |   -6742     26        26 |
      |--------------------------|
 601. |   -6742     26        26 |
 602. |   -6742     26        26 |
 603. |   -6742     26        26 |
 604. |   -6742     26        26 |
 605. |   -6742     26        26 |
      |--------------------------|
 606. |   -6742     26        26 |
 607. |   -6742     26        26 |
 608. |   -6742     26        26 |
 609. |   -6742     26        26 |
 610. |   -6742     26        26 |
      |--------------------------|
 611. |   -6742     26        26 |
 612. |   -6742     26        26 |
 613. |   -6742     26        26 |
 614. |   -6742     26        26 |
 615. |   -6742     26        26 |
      |--------------------------|
 616. |   -6742     26        26 |
 617. |   -6742     26        26 |
 618. |   -6742     26        26 |
 619. |   -6742     26        26 |
 620. |   -6742     26        26 |
      |--------------------------|
 621. |   -6742     26        26 |
 622. |   -6458     21        27 |
 623. |   -6458     21        27 |
 624. |   -6458     21        27 |
 625. |   -6458     21        27 |
      |--------------------------|
 626. |   -6458     21        27 |
 627. |   -6458     21        27 |
 628. |   -6458     21        27 |
 629. |   -6458     21        27 |
 630. |   -6458     21        27 |
      |--------------------------|
 631. |   -6458     21        27 |
 632. |   -6458     21        27 |
 633. |   -6458     21        27 |
 634. |   -6458     21        27 |
 635. |   -6458     21        27 |
      |--------------------------|
 636. |   -6458     21        27 |
 637. |   -6458     21        27 |
 638. |   -4352     54        28 |
 639. |   -4352     54        28 |
 640. |   -4352     54        28 |
      |--------------------------|
 641. |   -4352     54        28 |
 642. |   -4352     54        28 |
 643. |   -4352     54        28 |
 644. |   -4352     54        28 |
 645. |   -4352     54        28 |
      |--------------------------|
 646. |   -4248     58        29 |
 647. |   -4248     58        29 |
 648. |   -4248     58        29 |
 649. |   -4248     58        29 |
 650. |   -4248     58        29 |
      |--------------------------|
 651. |   -3399     20        30 |
 652. |   -3399     20        30 |
 653. |   -3399     20        30 |
 654. |   -3399     20        30 |
 655. |   -3399     20        30 |
      |--------------------------|
 656. |   -3399     20        30 |
 657. |   -3399     20        30 |
 658. |   -3399     20        30 |
 659. |   -3399     20        30 |
 660. |   -3399     20        30 |
      |--------------------------|
 661. |   -3399     20        30 |
 662. |   -3399     20        30 |
 663. |   -3399     20        30 |
 664. |   -3399     20        30 |
 665. |   -3333     36        31 |
      |--------------------------|
 666. |   -3333     36        31 |
 667. |   -3333     36        31 |
 668. |   -2055     23        32 |
 669. |   -2055     23        32 |
 670. |   -2055     23        32 |
      |--------------------------|
 671. |   -2055     23        32 |
 672. |   -2055     23        32 |
 673. |   -2055     23        32 |
 674. |   -2055     23        32 |
 675. |   -2055     23        32 |
      |--------------------------|
 676. |   -2055     23        32 |
 677. |   -2055     23        32 |
 678. |   -2055     23        32 |
 679. |   -2055     23        32 |
 680. |   -2055     23        32 |
      |--------------------------|
 681. |   -2055     23        32 |
 682. |   -2055     23        32 |
 683. |   -2055     23        32 |
 684. |   -2055     23        32 |
 685. |   -2055     23        32 |
      |--------------------------|
 686. |   -2055     23        32 |
 687. |   -2055     23        32 |
 688. |   -2055     23        32 |
 689. |   -2055     23        32 |
 690. |   -2055     23        32 |
      |--------------------------|
 691. |   -2055     23        32 |
 692. |   -2055     23        32 |
 693. |   -2055     23        32 |
 694. |   -2055     23        32 |
 695. |   -2055     23        32 |
      |--------------------------|
 696. |   -2055     23        32 |
 697. |   -2055     23        32 |
 698. |   -2055     23        32 |
 699. |   -2055     23        32 |
 700. |   -2055     23        32 |
      |--------------------------|
 701. |   -2055     23        32 |
 702. |   -2055     23        32 |
 703. |   -2055     23        32 |
 704. |   -2055     23        32 |
 705. |   -2055     23        32 |
      |--------------------------|
 706. |   -2055     23        32 |
 707. |   -2055     23        32 |
 708. |   -2055     23        32 |
 709. |   -2055     23        32 |
 710. |   -2055     23        32 |
      |--------------------------|
 711. |   -2055     23        32 |
 712. |   -2055     23        32 |
 713. |   -2055     23        32 |
 714. |   -2055     23        32 |
 715. |   -2055     23        32 |
      |--------------------------|
 716. |   -2055     23        32 |
 717. |   -2055     23        32 |
 718. |   -2055     23        32 |
 719. |   -2055     23        32 |
 720. |   -2055     23        32 |
      |--------------------------|
 721. |   -2055     23        32 |
 722. |   -2055     23        32 |
 723. |   -2055     23        32 |
 724. |   -2055     23        32 |
 725. |   -2055     23        32 |
      |--------------------------|
 726. |   -2055     23        32 |
 727. |   -2055     23        32 |
 728. |   -2055     23        32 |
 729. |   -2055     23        32 |
 730. |   -2055     23        32 |
      |--------------------------|
 731. |   -2055     23        32 |
 732. |   -2055     23        32 |
 733. |   -2055     23        32 |
 734. |   -2055     23        32 |
 735. |   -2055     23        32 |
      |--------------------------|
 736. |   -2055     23        32 |
 737. |   -2055     23        32 |
 738. |   -2055     23        32 |
 739. |   -2055     23        32 |
 740. |   -2055     23        32 |
      |--------------------------|
 741. |   -2055     23        32 |
 742. |   -2055     23        32 |
 743. |   -2055     23        32 |
 744. |   -2055     23        32 |
 745. |   -2055     23        32 |
      |--------------------------|
 746. |   -2055     23        32 |
 747. |   -2055     23        32 |
 748. |   -2055     23        32 |
 749. |   -2055     23        32 |
 750. |   -2055     23        32 |
      |--------------------------|
 751. |   -2055     23        32 |
 752. |   -2055     23        32 |
 753. |   -2055     23        32 |
 754. |   -2055     23        32 |
 755. |   -2055     23        32 |
      |--------------------------|
 756. |   -2055     23        32 |
 757. |   -2055     23        32 |
 758. |   -2055     23        32 |
 759. |   -2055     23        32 |
 760. |   -2055     23        32 |
      |--------------------------|
 761. |   -2055     23        32 |
 762. |   -2055     23        32 |
 763. |   -2055     23        32 |
 764. |   -2055     23        32 |
 765. |   -2055     23        32 |
      |--------------------------|
 766. |   -2055     23        32 |
 767. |   -2055     23        32 |
 768. |   -2055     23        32 |
 769. |   -2055     23        32 |
 770. |   -2055     23        32 |
      |--------------------------|
 771. |   -2055     23        32 |
 772. |   -2055     23        32 |
 773. |   -2055     23        32 |
 774. |   -2055     23        32 |
 775. |   -2055     23        32 |
      |--------------------------|
 776. |   -2055     23        32 |
 777. |   -2055     23        32 |
 778. |   -2055     23        32 |
 779. |   -2055     23        32 |
 780. |   -2055     23        32 |
      |--------------------------|
 781. |   -2055     23        32 |
 782. |   -2055     23        32 |
 783. |   -2055     23        32 |
 784. |   -2055     23        32 |
 785. |   -2055     23        32 |
      |--------------------------|
 786. |   -2055     23        32 |
 787. |   -2055     23        32 |
 788. |   -2055     23        32 |
 789. |   -2055     23        32 |
 790. |   -2055     23        32 |
      |--------------------------|
 791. |   -2055     23        32 |
 792. |   -2055     23        32 |
 793. |   -2055     23        32 |
 794. |   -2055     23        32 |
 795. |   -2055     23        32 |
      |--------------------------|
 796. |   -2055     23        32 |
 797. |   -2055     23        32 |
 798. |   -2055     23        32 |
 799. |   -2055     23        32 |
 800. |   -2055     23        32 |
      |--------------------------|
 801. |   -2055     23        32 |
 802. |   -2055     23        32 |
 803. |   -2055     23        32 |
 804. |   -2055     23        32 |
 805. |   -2055     23        32 |
      |--------------------------|
 806. |   -2055     23        32 |
 807. |   -2055     23        32 |
 808. |   -2055     23        32 |
 809. |   -2055     23        32 |
 810. |   -2055     23        32 |
      |--------------------------|
 811. |   -2055     23        32 |
 812. |   -2055     23        32 |
 813. |   -2055     23        32 |
 814. |   -2055     23        32 |
 815. |   -2055     23        32 |
      |--------------------------|
 816. |   -2055     23        32 |
 817. |   -2055     23        32 |
 818. |   -2055     23        32 |
 819. |   -2055     23        32 |
 820. |   -2055     23        32 |
      |--------------------------|
 821. |   -2055     23        32 |
 822. |   -2055     23        32 |
 823. |   -2055     23        32 |
 824. |   -2055     23        32 |
 825. |   -2055     23        32 |
      |--------------------------|
 826. |   -2055     23        32 |
 827. |   -2055     23        32 |
 828. |   -2055     23        32 |
 829. |   -2055     23        32 |
 830. |   -2055     23        32 |
      |--------------------------|
 831. |   -2055     23        32 |
 832. |   -2055     23        32 |
 833. |   -2055     23        32 |
 834. |   -2055     23        32 |
 835. |   -2055     23        32 |
      |--------------------------|
 836. |   -2055     23        32 |
 837. |   -2055     23        32 |
 838. |   -2055     23        32 |
 839. |   -2055     23        32 |
 840. |   -2055     23        32 |
      |--------------------------|
 841. |   -2055     23        32 |
 842. |   -2055     23        32 |
 843. |   -2055     23        32 |
 844. |   -2055     23        32 |
 845. |   -2055     23        32 |
      |--------------------------|
 846. |   -2055     23        32 |
 847. |   -2055     23        32 |
 848. |   -2055     23        32 |
 849. |   -2055     23        32 |
 850. |   -2055     23        32 |
      |--------------------------|
 851. |   -2055     23        32 |
 852. |   -2055     23        32 |
 853. |   -2055     23        32 |
 854. |   -2055     23        32 |
 855. |   -2055     23        32 |
      |--------------------------|
 856. |   -1454     27        33 |
 857. |   -1454     27        33 |
 858. |   -1454     27        33 |
 859. |   -1454     27        33 |
 860. |   -1454     27        33 |
      |--------------------------|
 861. |   -1454     27        33 |
 862. |   -1454     27        33 |
 863. |   -1454     27        33 |
 864. |   -1454     27        33 |
 865. |   -1454     27        33 |
      |--------------------------|
 866. |    -984     57        34 |
 867. |    -984     57        34 |
 868. |    -984     57        34 |
 869. |    -984     57        34 |
 870. |    -819     28        35 |
      |--------------------------|
 871. |    -819     28        35 |
 872. |    -819     28        35 |
 873. |    -819     28        35 |
 874. |    -819     28        35 |
 875. |    -819     28        35 |
      |--------------------------|
 876. |    -819     28        35 |
 877. |    -819     28        35 |
 878. |    -819     28        35 |
 879. |    -819     28        35 |
 880. |    -819     28        35 |
      |--------------------------|
 881. |    -819     28        35 |
 882. |    -819     28        35 |
 883. |    -819     28        35 |
 884. |    -819     28        35 |
 885. |    -819     28        35 |
      |--------------------------|
 886. |    -819     28        35 |
 887. |    -819     28        35 |
 888. |    -819     28        35 |
 889. |    -819     28        35 |
 890. |    -819     28        35 |
      |--------------------------|
 891. |    -819     28        35 |
 892. |    -819     28        35 |
 893. |    -819     28        35 |
 894. |    -819     28        35 |
 895. |    -819     28        35 |
      |--------------------------|
 896. |    -819     28        35 |
 897. |    -819     28        35 |
 898. |    -702      1        36 |
 899. |    -702      1        36 |
 900. |    -702      1        36 |
      |--------------------------|
 901. |    -702      1        36 |
 902. |    -702      1        36 |
 903. |    -702      1        36 |
 904. |    -702      1        36 |
 905. |    -702      1        36 |
      |--------------------------|
 906. |    -702      1        36 |
 907. |    -702      1        36 |
 908. |    -702      1        36 |
 909. |    -702      1        36 |
 910. |    -547     44        37 |
      |--------------------------|
 911. |    -547     44        37 |
 912. |    -547     44        37 |
 913. |    -547     44        37 |
 914. |    -547     44        37 |
 915. |    -547     44        37 |
      |--------------------------|
 916. |    -547     44        37 |
 917. |    -547     44        37 |
 918. |    -547     44        37 |
 919. |     221     18        38 |
 920. |     221     18        38 |
      |--------------------------|
 921. |     221     18        38 |
 922. |     221     18        38 |
 923. |     221     18        38 |
 924. |     221     18        38 |
 925. |     783      2        39 |
      |--------------------------|
 926. |     783      2        39 |
 927. |     783      2        39 |
 928. |     783      2        39 |
 929. |     783      2        39 |
 930. |     783      2        39 |
      |--------------------------|
 931. |     783      2        39 |
 932. |     783      2        39 |
 933. |     783      2        39 |
 934. |     783      2        39 |
 935. |     783      2        39 |
      |--------------------------|
 936. |     783      2        39 |
 937. |    1070      7        40 |
 938. |    1070      7        40 |
 939. |    1070      7        40 |
 940. |    1070      7        40 |
      |--------------------------|
 941. |    1070      7        40 |
 942. |    1070      7        40 |
 943. |    1070      7        40 |
 944. |    1070      7        40 |
 945. |    1070      7        40 |
      |--------------------------|
 946. |    1070      7        40 |
 947. |    1070      7        40 |
 948. |    1070      7        40 |
 949. |    1070      7        40 |
 950. |    1070      7        40 |
      |--------------------------|
 951. |    1070      7        40 |
 952. |    1070      7        40 |
 953. |    1070      7        40 |
 954. |    1070      7        40 |
 955. |    1070      7        40 |
      |--------------------------|
 956. |    1070      7        40 |
 957. |    1070      7        40 |
 958. |    1070      7        40 |
 959. |    1070      7        40 |
 960. |    1070      7        40 |
      |--------------------------|
 961. |    1070      7        40 |
 962. |    1070      7        40 |
 963. |    1070      7        40 |
 964. |    1070      7        40 |
 965. |    1070      7        40 |
      |--------------------------|
 966. |    1070      7        40 |
 967. |    1070      7        40 |
 968. |    1070      7        40 |
 969. |    1070      7        40 |
 970. |    1070      7        40 |
      |--------------------------|
 971. |    1070      7        40 |
 972. |    1070      7        40 |
 973. |    1070      7        40 |
 974. |    1070      7        40 |
 975. |    1070      7        40 |
      |--------------------------|
 976. |    1070      7        40 |
 977. |    1070      7        40 |
 978. |    1070      7        40 |
 979. |    1070      7        40 |
 980. |    1070      7        40 |
      |--------------------------|
 981. |    1070      7        40 |
 982. |    1070      7        40 |
 983. |    1070      7        40 |
 984. |    1070      7        40 |
 985. |    1070      7        40 |
      |--------------------------|
 986. |    1070      7        40 |
 987. |    1070      7        40 |
 988. |    1070      7        40 |
 989. |    1070      7        40 |
 990. |    1070      7        40 |
      |--------------------------|
 991. |    1070      7        40 |
 992. |    1070      7        40 |
 993. |    1070      7        40 |
 994. |    1070      7        40 |
 995. |    1070      7        40 |
      |--------------------------|
 996. |    1070      7        40 |
 997. |    1070      7        40 |
 998. |    1070      7        40 |
 999. |    1070      7        40 |
1000. |    1070      7        40 |
      |--------------------------|
1001. |    1070      7        40 |
1002. |    1070      7        40 |
1003. |    1070      7        40 |
1004. |    1070      7        40 |
1005. |    1070      7        40 |
      |--------------------------|
1006. |    1070      7        40 |
1007. |    1070      7        40 |
1008. |    1070      7        40 |
1009. |    1070      7        40 |
1010. |    1070      7        40 |
      |--------------------------|
1011. |    1070      7        40 |
1012. |    1070      7        40 |
1013. |    1070      7        40 |
1014. |    1070      7        40 |
1015. |    1070      7        40 |
      |--------------------------|
1016. |    1070      7        40 |
1017. |    1070      7        40 |
1018. |    1070      7        40 |
1019. |    1070      7        40 |
1020. |    1070      7        40 |
      |--------------------------|
1021. |    1070      7        40 |
1022. |    1070      7        40 |
1023. |    1070      7        40 |
1024. |    1070      7        40 |
1025. |    1070      7        40 |
      |--------------------------|
1026. |    1070      7        40 |
1027. |    1070      7        40 |
1028. |    1070      7        40 |
1029. |    1070      7        40 |
1030. |    1070      7        40 |
      |--------------------------|
1031. |    1070      7        40 |
1032. |    1070      7        40 |
1033. |    1070      7        40 |
1034. |    1070      7        40 |
1035. |    1070      7        40 |
      |--------------------------|
1036. |    1070      7        40 |
1037. |    1070      7        40 |
1038. |    1070      7        40 |
1039. |    1070      7        40 |
1040. |    1070      7        40 |
      |--------------------------|
1041. |    1070      7        40 |
1042. |    1070      7        40 |
1043. |    1070      7        40 |
1044. |    1070      7        40 |
1045. |    1070      7        40 |
      |--------------------------|
1046. |    1070      7        40 |
1047. |    1070      7        40 |
1048. |    1070      7        40 |
1049. |    1658     10        41 |
1050. |    1658     10        41 |
      |--------------------------|
1051. |    1658     10        41 |
1052. |    1658     10        41 |
1053. |    1658     10        41 |
1054. |    1658     10        41 |
1055. |    1658     10        41 |
      |--------------------------|
1056. |    1658     10        41 |
1057. |    2530     51        42 |
1058. |    2530     51        42 |
1059. |    2530     51        42 |
1060. |    2530     51        42 |
      |--------------------------|
1061. |    2530     51        42 |
1062. |    2530     51        42 |
1063. |    2802     50        43 |
1064. |    2802     50        43 |
1065. |    2802     50        43 |
      |--------------------------|
1066. |    2802     50        43 |
1067. |    2802     50        43 |
1068. |    2802     50        43 |
1069. |    2802     50        43 |
1070. |    2802     50        43 |
      |--------------------------|
1071. |    2802     50        43 |
1072. |    2802     50        43 |
1073. |    2802     50        43 |
1074. |    2802     50        43 |
1075. |    2802     50        43 |
      |--------------------------|
1076. |    2802     50        43 |
1077. |    2802     50        43 |
1078. |    2802     50        43 |
1079. |    2802     50        43 |
1080. |    2802     50        43 |
      |--------------------------|
1081. |    2802     50        43 |
1082. |    2802     50        43 |
1083. |    2802     50        43 |
1084. |    2802     50        43 |
1085. |    2802     50        43 |
      |--------------------------|
1086. |    4000     31        44 |
1087. |    4000     31        44 |
1088. |    4000     31        44 |
1089. |    4000     31        44 |
1090. |    4192     12        45 |
      |--------------------------|
1091. |    4192     12        45 |
1092. |    4192     12        45 |
1093. |    4192     12        45 |
1094. |    4192     12        45 |
1095. |    4192     12        45 |
      |--------------------------|
1096. |    4192     12        45 |
1097. |    4192     12        45 |
1098. |    4192     12        45 |
1099. |    4192     12        45 |
1100. |    4192     12        45 |
      |--------------------------|
1101. |    4192     12        45 |
1102. |    4192     12        45 |
1103. |    4192     12        45 |
1104. |    4192     12        45 |
1105. |    4192     12        45 |
      |--------------------------|
1106. |    4192     12        45 |
1107. |    4192     12        45 |
1108. |    4192     12        45 |
1109. |    4192     12        45 |
1110. |    4192     12        45 |
      |--------------------------|
1111. |    4192     12        45 |
1112. |    5792      9        46 |
1113. |    5792      9        46 |
1114. |    5792      9        46 |
1115. |    5792      9        46 |
      |--------------------------|
1116. |    5792      9        46 |
1117. |    5792      9        46 |
1118. |    5792      9        46 |
1119. |    5792      9        46 |
1120. |    6270     24        47 |
      |--------------------------|
1121. |    6270     24        47 |
1122. |    6270     24        47 |
1123. |    6270     24        47 |
1124. |    6270     24        47 |
1125. |    6270     24        47 |
      |--------------------------|
1126. |    6270     24        47 |
1127. |    6270     24        47 |
1128. |    8510     52        48 |
1129. |    8510     52        48 |
1130. |    8510     52        48 |
      |--------------------------|
1131. |    8510     52        48 |
1132. |    8515     17        49 |
1133. |    8515     17        49 |
1134. |    8515     17        49 |
1135. |    8515     17        49 |
      |--------------------------|
1136. |    8515     17        49 |
1137. |    8515     17        49 |
1138. |    8515     17        49 |
1139. |    8515     17        49 |
1140. |    8515     17        49 |
      |--------------------------|
1141. |    8515     17        49 |
1142. |    8515     17        49 |
1143. |    8515     17        49 |
1144. |    8515     17        49 |
1145. |    8515     17        49 |
      |--------------------------|
1146. |    8515     17        49 |
1147. |    8515     17        49 |
1148. |    8515     17        49 |
1149. |    8515     17        49 |
1150. |    8515     17        49 |
      |--------------------------|
1151. |    8515     17        49 |
1152. |    8515     17        49 |
1153. |    8515     17        49 |
1154. |   10000     37        50 |
1155. |   16374     16        51 |
      |--------------------------|
1156. |   16374     16        51 |
1157. |   16374     16        51 |
1158. |   16374     16        51 |
1159. |   16798     43        52 |
1160. |   16798     43        52 |
      |--------------------------|
1161. |   16798     43        52 |
1162. |   16798     43        52 |
1163. |   16798     43        52 |
1164. |   16798     43        52 |
1165. |   16798     43        52 |
      |--------------------------|
1166. |   16798     43        52 |
1167. |   20466     39        53 |
1168. |   20466     39        53 |
1169. |   20466     39        53 |
1170. |   20466     39        53 |
      |--------------------------|
1171. |   20466     39        53 |
1172. |   20466     39        53 |
1173. |   20466     39        53 |
1174. |   20466     39        53 |
1175. |   20466     39        53 |
      |--------------------------|
1176. |   20466     39        53 |
1177. |   20466     39        53 |
1178. |   20466     39        53 |
1179. |   20466     39        53 |
1180. |   20466     39        53 |
      |--------------------------|
1181. |   20466     39        53 |
1182. |   20466     39        53 |
1183. |   20466     39        53 |
1184. |   20466     39        53 |
1185. |   20466     39        53 |
      |--------------------------|
1186. |   20466     39        53 |
1187. |   60431     49        54 |
1188. |   60431     49        54 |
1189. |   60431     49        54 |
1190. |   60431     49        54 |
      |--------------------------|
1191. |   60431     49        54 |
1192. |   60431     49        54 |
1193. |   60431     49        54 |
1194. |   60431     49        54 |
1195. |   60431     49        54 |
      |--------------------------|
1196. |   60431     49        54 |
1197. |   60431     49        54 |
1198. |   60431     49        54 |
1199. |   60431     49        54 |
1200. |   60431     49        54 |
      |--------------------------|
1201. |   60431     49        54 |
1202. |   60431     49        54 |
1203. |   60431     49        54 |
1204. |   60431     49        54 |
1205. |   60431     49        54 |
      |--------------------------|
1206. |   60431     49        54 |
1207. |  104170     46        55 |
1208. |  264468     14        56 |
1209. |  264468     14        56 |
1210. |  264468     14        56 |
      |--------------------------|
1211. |  264468     14        56 |
1212. |  264468     14        56 |
1213. |  264468     14        56 |
1214. |  264468     14        56 |
1215. |  264468     14        56 |
      |--------------------------|
1216. |  264468     14        56 |
1217. |  264468     14        56 |
1218. |  264468     14        56 |
1219. |  264468     14        56 |
1220. |  264468     14        56 |
      |--------------------------|
1221. |  264468     14        56 |
1222. |  264468     14        56 |
1223. |  264468     14        56 |
1224. |  264468     14        56 |
1225. |  264468     14        56 |
      |--------------------------|
1226. |  264468     14        56 |
1227. |  264468     14        56 |
1228. |  264468     14        56 |
1229. |  264468     14        56 |
1230. |  264468     14        56 |
      |--------------------------|
1231. |  264468     14        56 |
1232. |  388709      4        57 |
1233. |  388709      4        57 |
1234. |  388709      4        57 |
1235. |  388709      4        57 |
      |--------------------------|
1236. |  388709      4        57 |
1237. |  388709      4        57 |
1238. |  388709      4        57 |
1239. |  388709      4        57 |
1240. |  388709      4        57 |
      |--------------------------|
1241. |  388709      4        57 |
1242. |  388709      4        57 |
1243. |  388709      4        57 |
1244. |  388709      4        57 |
1245. |  388709      4        57 |
      |--------------------------|
1246. |  388709      4        57 |
1247. |  388709      4        57 |
1248. |  453333      3        58 |
1249. |  453333      3        58 |
1250. |  453333      3        58 |
      |--------------------------|
1251. |  453333      3        58 |
1252. |  453333      3        58 |
1253. |  453333      3        58 |
      +--------------------------+

. twoway (kdensity newspec if index==1 [fw=1], kernel(ep) lcolor(red) fcolor(red%2) lwidth(medium)
>  bwidth(2.5) ) 
>         (kdensity newspec if index==2 [fw=1],kernel(ep) lcolor(green) fcolor(green%20) lwidth(me
> dium) bwidth(2.5) ) 
>         (kdensity newspec if index==3 [fw=1], kernel(ep) lcolor(blue) fcolor(blue%2) lwidth(medi
> um) bwidth(2.5)) , 
>         legend(pos(6) rows(1)) legend(order(1 "Anti-immigrant teams" 2 "Moderate teams" 3 "Pro-i
> mmigrant teams")) ;

. log close;
      name:  <unnamed>
       log:  C:/GitHub/ideology_specification/code/Log Files/05_Expected_AME.log
  log type:  text
 closed on:  12 Feb 2025, 15:36:21
--------------------------------------------------------------------------------------------------
