--------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /volumes/ddisk/mi/researcher/reg_reject.log
  log type:  text
 opened on:  10 Oct 2024, 13:13:13

. clear matrix;

. clear mata;

. *THE DATA IN CRI.CSV IS MODEL-LEVEL DATA;
. *THE DATA IN CRI_TEAM.CSV IS TEAM-LEVEL DATA;
. *TEAM LEVEL DATA CONTAINS MORE THAN ONE OBSERVATION PER TEAM FOR A FEW TEAMS, DUE TO
>  STOCK-FLOW DISTINCTION;
. **************************************************;
. *THIS PROGRAM USES DATA AT TEAM-CONCLUSION LEVEL;
. *THE VARIABLE HREJECT IS CONSTANT WITHIN A TEAM;
. *THE VARIABLE HREJ IS NOT CONSTANT WITHIN A TEAM, AND DIFFERS FOR THE 16 TEAMS WITH 
> DIFFERENT CONCLUSIONS;
. **************************************************;
. *GETTING VARIANCE OF THE AME WITHIN A TEAM;
. *TEAM-CONCLUSION LEVEL DATA;
. use /volumes/ddisk/mi/researcher/cri.dta, clear;

. generate teamid=u_teamid;

. destring teamid, force replace;
teamid already numeric; no replace

. *DROPS TEAMS WITH MISSING ID;
. drop if teamid==.;
(0 observations deleted)

. *DROPS THE BASELINE BRADY-FINNIGAN RESULTS;
. drop if teamid==0;
(48 observations deleted)

. rename AME ame;

. rename Hrej hrej;

. destring ame, force replace;
ame: contains nonnumeric characters; replaced as double
(8 missing values generated)

. destring z, force replace;
z: contains nonnumeric characters; replaced as double
(9 missing values generated)

. replace z=abs(z);
(686 real changes made)

. generate varame=(ame/z)^2;
(11 missing values generated)

. generate negsig=(ame<0 & z>1.645);

. generate possig=(ame>0 & z>1.645);

. *generate negsig=(ame<0 & z>1.96);
. *generate possig=(ame>0 & z>1.96);
. generate nmodel=1;

. *THE TEAM-CONCLUSION LEVEL DATA IS DEFINED BY TEAMID AND HREJ;
. collapse (sum) nmodel negsig possig (mean) meaname=ame varame meanz=z (sd) sdame=ame
> , by(teamid hrej);

. generate rpos=possig/nmodel;

. generate rneg=negsig/nmodel;

. summ;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hrej |         88    .6136364    .4897059          0          1
      teamid |         88    49.96591    29.68433          1        106
      nmodel |         88    14.32955    17.60533          1        112
      negsig |         88    3.511364    4.068365          0         19
      possig |         88    2.738636    4.366788          0         24
-------------+---------------------------------------------------------
     meaname |         87   -.0093777    .0871169   -.391782   .3595625
      varame |         87    .0269193    .1568105   6.30e-07   1.434496
       meanz |         87    2.643713    3.342285     .29101   29.72496
       sdame |         79    .1053908     .238631   .0011811   1.880978
        rpos |         88    .1988497    .2695284          0          1
-------------+---------------------------------------------------------
        rneg |         88    .3393601    .3334852          0          1

. save /volumes/ddisk/data/junkvar.dta, replace;
file /volumes/ddisk/data/junkvar.dta saved

. *GETTING AVERAGE REFEREE SCORE FOR EACH TEAM-CONCLUSION COMBINATION;
. use /volumes/ddisk/mi/researcher/model.dta, replace;

. collapse (mean) pscore, by(teamid hrej);

. save /volumes/ddisk/data/junkpscore.dta, replace;
file /volumes/ddisk/data/junkpscore.dta saved

. *GET TEAM-CONCLUSION LEVEL DATA;
. use /volumes/ddisk/mi/researcher/cri_team.dta, clear;

. generate teamid=u_teamid;

. destring teamid, force replace;
teamid already numeric; no replace

. *DROPS TEAMS WITH MISSING ID;
. drop if teamid==.;
(0 observations deleted)

. *DROPS THE BASELINE BRADY-FINNIGAN RESULTS;
. drop if teamid==0;
(1 observation deleted)

. rename BELIEF_HYPOTHESIS belief_hypothesis;

. rename TOPIC_KNOWLEDGE topic_knowledge;

. rename STATISTICS_SKILL statistics_skill;

. rename MODEL_SCORE model_score;

. rename AME ame;

. rename belief_H1_11 belief_h1_11;

. rename belief_H1_12 belief_h1_12;

. rename belief_H1_13 belief_h1_13;

. rename Hsupport hsupport;

. rename Hreject hreject;

. rename Hrej hrej;

. rename Hsup hsup;

. rename Hnotest hnotest;

. rename Hmixed hmixed;

. encode Hresult, gen(hresult);

. *SIMPLIFY DATA SET BY DROPPING IRRELEVANT VARIABLES;
. drop AU-VE;

. drop emigration_ivC-fbXleftright;

. *AVERAGE MARGINAL EFFECT VARIABLE;
. destring ame, replace force;
ame: contains nonnumeric characters; replaced as double
(1 missing value generated)

. summ ame;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |         87   -.0093777    .0871169   -.391782   .3595625

. *TEAM 1 DOES NOT REPORT AN AME, SO WILL BE DELETED;
. list teamid if ame==.;

     +--------+
     | teamid |
     |--------|
  1. |      1 |
     +--------+

. drop if ame==.;
(1 observation deleted)

. *TEAM SIZE;
. *TEAM 93 HAS TEAM SIZE MISCODED;
. replace team_size=3 if teamid==93;
(1 real change made)

. tabulate team_size;

  team_size |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         17       19.54       19.54
          2 |         33       37.93       57.47
          3 |         37       42.53      100.00
------------+-----------------------------------
      Total |         87      100.00

. generate t2=(team_size==2);

. generate t3=(team_size==3);

. unique teamid if team_size==1;
Number of unique values of teamid is  14
Number of records is  17

. unique teamid if team_size==2;
Number of unique values of teamid is  26
Number of records is  33

. unique teamid if team_size==3;
Number of unique values of teamid is  31
Number of records is  37

. *GENDER COMPOSITION OF TEAM;
. destring v_1101 v_1102 v_1103, force replace;
v_1101: contains nonnumeric characters; replaced as byte
(9 missing values generated)
v_1102: contains nonnumeric characters; replaced as byte
(52 missing values generated)
v_1103: contains nonnumeric characters; replaced as byte
(21 missing values generated)

. generate nmale=(v_1101==1) + (v_1102==1) + (v_1103==1);

. generate team=(v_1101~=.) + (v_1102~=.) + (v_1103~=.);

. generate pmale=nmale/team;
(1 missing value generated)

. replace pmale=.6666667 if teamid==27;
(1 real change made)

. tabulate pmale;

      pmale |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         11       12.64       12.64
   .3333333 |          8        9.20       21.84
         .5 |         11       12.64       34.48
   .6666667 |         11       12.64       47.13
          1 |         46       52.87      100.00
------------+-----------------------------------
      Total |         87      100.00

. *FIELD OF HIGHEST DEGREE OF TEAM;
. tabulate backgr_degree1;

backgr_degr |
        ee1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          1        1.15        1.15
          2 |          5        5.75        6.90
          3 |         45       51.72       58.62
          4 |         24       27.59       86.21
          5 |          6        6.90       93.10
          6 |          3        3.45       96.55
          7 |          2        2.30       98.85
         NA |          1        1.15      100.00
------------+-----------------------------------
      Total |         87      100.00

. destring backgr_degree1, force gen(degree1);
backgr_degree1: contains nonnumeric characters; degree1 generated as byte
(1 missing value generated)

. destring backgr_degree2, force gen(degree2);
backgr_degree2: contains nonnumeric characters; degree2 generated as byte
(51 missing values generated)

. destring backgr_degree3, force gen(degree3);
backgr_degree3: contains nonnumeric characters; degree3 generated as byte
(18 missing values generated)

. tabulate backgr_degree1 degree1;

backgr_deg |                     backgr_degree1
      ree1 |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
         1 |         1          0          0          0          0 |         1 
         2 |         0          5          0          0          0 |         5 
         3 |         0          0         45          0          0 |        45 
         4 |         0          0          0         24          0 |        24 
         5 |         0          0          0          0          6 |         6 
         6 |         0          0          0          0          0 |         3 
         7 |         0          0          0          0          0 |         2 
-----------+-------------------------------------------------------+----------
     Total |         1          5         45         24          6 |        86 


backgr_deg |    backgr_degree1
      ree1 |         6          7 |     Total
-----------+----------------------+----------
         1 |         0          0 |         1 
         2 |         0          0 |         5 
         3 |         0          0 |        45 
         4 |         0          0 |        24 
         5 |         0          0 |         6 
         6 |         3          0 |         3 
         7 |         0          2 |         2 
-----------+----------------------+----------
     Total |         3          2 |        86 

. summ degree1 degree2 degree3;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     degree1 |         86    3.534884    1.036938          1          7
     degree2 |         36        3.25    .8742344          1          5
     degree3 |         69    3.608696    .8781229          3          6

. generate d1=degree1;
(1 missing value generated)

. generate d2=degree2;
(51 missing values generated)

. generate d3=degree3;
(18 missing values generated)

. replace d1=0 if d1==.;
(1 real change made)

. replace d2=0 if d2==.;
(51 real changes made)

. replace d3=0 if d3==.;
(18 real changes made)

. generate counter=d1*100 + d2*10 + d3;

. generate counter2=team_size*1000 + counter;

. summ d1-d3 counter counter2;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
          d1 |         87    3.494253    1.098345          0          7
          d2 |         87    1.344828     1.70381          0          5
          d3 |         87    2.862069    1.664768          0          6
     counter |         87    365.7356    109.3123          5        703
    counter2 |         87    2595.621    760.9549       1100       3654

. tabulate counter2;

   counter2 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1100 |          1        1.15        1.15
       1200 |          1        1.15        2.30
       1300 |          6        6.90        9.20
       1400 |          5        5.75       14.94
       1500 |          3        3.45       18.39
       1600 |          1        1.15       19.54
       2204 |          2        2.30       21.84
       2303 |         13       14.94       36.78
       2306 |          2        2.30       39.08
       2400 |          1        1.15       40.23
       2404 |         10       11.49       51.72
       2504 |          1        1.15       52.87
       2505 |          1        1.15       54.02
       2606 |          1        1.15       55.17
       2703 |          2        2.30       57.47
       3005 |          1        1.15       58.62
       3244 |          2        2.30       60.92
       3323 |          2        2.30       63.22
       3333 |         14       16.09       79.31
       3336 |          2        2.30       81.61
       3343 |          5        5.75       87.36
       3344 |          1        1.15       88.51
       3414 |          2        2.30       90.80
       3433 |          3        3.45       94.25
       3443 |          1        1.15       95.40
       3444 |          2        2.30       97.70
       3555 |          1        1.15       98.85
       3654 |          1        1.15      100.00
------------+-----------------------------------
      Total |         87      100.00

. *SIZE OF TEAM THAT PROVIDES A DEGREE, NOT EQUAL TO TEAM_SIZE BECAUSE OF MISSING INFO
> ;
. replace team=(degree1~=.) + (degree2~=.) + (degree3~=.);
(13 real changes made)

. *THESE ARE THE EXCLUSIVE DISCIPLINES;
. generate mdegree=1 if counter2==1100;
(86 missing values generated)

. replace mdegree=2 if counter2==1200;
(1 real change made)

. replace mdegree=3 if counter2==1300 | counter2==2303 | counter2==3333;
(33 real changes made)

. replace mdegree=4 if counter2==1400 | counter2==2400 | counter2==2404 | counter2==34
> 44;
(18 real changes made)

. replace mdegree=5 if counter2==1500 | counter2==2505 | counter2==3555;
(5 real changes made)

. replace mdegree=6 if counter2==1600 | counter2==2606;
(2 real changes made)

. *ALL MIXED DEGREES FOR ACTUAL TEAM SIZE 2;
. replace mdegree=20 if (team==2 & mdegree==.) ;
(7 real changes made)

. tabulate counter2 if mdegree==20;

   counter2 |      Freq.     Percent        Cum.
------------+-----------------------------------
       2204 |          2       28.57       28.57
       2306 |          2       28.57       57.14
       2504 |          1       14.29       71.43
       2703 |          2       28.57      100.00
------------+-----------------------------------
      Total |          7      100.00

. *NOW BREAK UP TEAM SIZE 3 INTO 4 CATEGORIES;
. replace mdegree=31 if (counter2==3323 | counter2==3336
>         | counter2==3343);
(9 real changes made)

. replace mdegree=32 if (counter2==3244 
>         | counter2==3414 | counter2==3443);
(5 real changes made)

. *THE FOLLOWING 2 CATEGORIES USE DIFFERENT LEAD AUTHOR IN SOCIO OR POLI SCI TO CLASSI
> FY;
. *ALSO SEPARATES OUT STRANGE TEAM WITH 3 DISTINCT FIELDS;
. replace mdegree=33 if (counter2==3344 );
(1 real change made)

. replace mdegree=34 if (counter2==3433);
(3 real changes made)

. replace mdegree=35 if (counter2==3654);
(1 real change made)

. tabulate counter2 if team==3 & mdegree==.;
no observations

. tabulate counter2 if team_size==3 & mdegree==.;

   counter2 |      Freq.     Percent        Cum.
------------+-----------------------------------
       3005 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. replace mdegree=30 if team_size==3 & mdegree==.;
(1 real change made)

. tabulate counter2 if mdegree==30, missing;

   counter2 |      Freq.     Percent        Cum.
------------+-----------------------------------
       3005 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. tabulate counter2, sum(mdegree);

            |         Summary of mdegree
   counter2 |        Mean   Std. dev.       Freq.
------------+------------------------------------
       1100 |           1           0           1
       1200 |           2           0           1
       1300 |           3           0           6
       1400 |           4           0           5
       1500 |           5           0           3
       1600 |           6           0           1
       2204 |          20           0           2
       2303 |           3           0          13
       2306 |          20           0           2
       2400 |           4           0           1
       2404 |           4           0          10
       2504 |          20           0           1
       2505 |           5           0           1
       2606 |           6           0           1
       2703 |          20           0           2
       3005 |          30           0           1
       3244 |          32           0           2
       3323 |          31           0           2
       3333 |           3           0          14
       3336 |          31           0           2
       3343 |          31           0           5
       3344 |          33           0           1
       3414 |          32           0           2
       3433 |          34           0           3
       3443 |          32           0           1
       3444 |           4           0           2
       3555 |           5           0           1
       3654 |          35           0           1
------------+------------------------------------
      Total |    11.37931   12.186765          87

. *PRO-IMMIGRATION INDEX USES THE VARIABLE MEASURING THE GENERAL ATTITUDE TOWARDS IMMI
> GRATION, ATTITUDE_IMMIGRATION_11;
. *A VARIABLE COLLECTED IN THE FIRST WAVE QUESTIONNAIRE;
. *THE VARIABLE pro_immigrant in lower case IS THE MEAN OF THE INDEX WITHIN A TEAM;
. *THE PRO_IMMIGRANT VARIABLE IN UPPER CASE ONLY HAS 3 VALUES AS COMPARED TO MORE THAN
>  6 FOR THE pro_immigrant VARIABLE;
. *HIGHER VALUES OF PRO_IMMIGRANT INDICATE THAT IMMIGRATION LAWS SHOULD BE RELAXED, MO
> RE IMMIGRATION;
. *NOTE THAT ATTITUDE_IMMIGRATION_11 IS IN REVERSE ORDER;
. tabulate pro_immigrant attitude_immigration_11 if team_size==1;

                 |                attitude_immigration_11
   pro_immigrant |         1          2          3          4          5 |     Total
-----------------+-------------------------------------------------------+----------
               1 |         0          0          0          0          0 |         2 
               2 |         0          0          0          0          1 |         1 
               3 |         0          0          0          2          0 |         2 
               4 |         0          0          3          0          0 |         3 
               5 |         0          4          0          0          0 |         4 
               6 |         5          0          0          0          0 |         5 
-----------------+-------------------------------------------------------+----------
           Total |         5          4          3          2          1 |        17 


                 | attitude_i
                 | mmigration
                 |    _11
   pro_immigrant |         6 |     Total
-----------------+-----------+----------
               1 |         2 |         2 
               2 |         0 |         1 
               3 |         0 |         2 
               4 |         0 |         3 
               5 |         0 |         4 
               6 |         0 |         5 
-----------------+-----------+----------
           Total |         2 |        17 

. rename PRO_IMMIGRANT pro;

. generate proindex=pro_immigrant;

. destring proindex, force replace;
proindex: all characters numeric; replaced as double

. tabulate proindex pro, missing;

           |          PRO_IMMIGRANT
  proindex |      High        Low        Mid |     Total
-----------+---------------------------------+----------
         1 |         0          2          0 |         2 
         2 |         0          2          0 |         2 
  2.333333 |         0          1          0 |         1 
  2.666667 |         0          1          0 |         1 
         3 |         0          3          0 |         3 
  3.333333 |         0          0          3 |         3 
       3.5 |         0          0          7 |         7 
  3.666667 |         0          0          7 |         7 
         4 |         0          0         11 |        11 
  4.333333 |         0          0          3 |         3 
       4.5 |         0          0         10 |        10 
  4.666667 |         6          0          0 |         6 
         5 |        14          0          0 |        14 
  5.333333 |         3          0          0 |         3 
       5.5 |         5          0          0 |         5 
  5.666667 |         2          0          0 |         2 
         6 |         7          0          0 |         7 
-----------+---------------------------------+----------
     Total |        37          9         41 |        87 

. *CREATING PINDEX, PERCENT OF TEAM WITH PRO-IMMIGRATION IDEOLOGY;
. *SIMPLY COUNT NUMBER OF AUTHORS WITH CORRECT CODE IN ATTITUDE VARIABLE, AND DIVIDE B
> Y TEAM SIZE;
. destring attitude_immigration_11, force gen(att1);
attitude_immigration_11: contains nonnumeric characters; att1 generated as byte
(2 missing values generated)

. destring attitude_immigration_12, force gen(att2);
attitude_immigration_12: contains nonnumeric characters; att2 generated as byte
(52 missing values generated)

. destring attitude_immigration_13, force gen(att3);
attitude_immigration_13: contains nonnumeric characters; att3 generated as byte
(18 missing values generated)

. *REVERSE ORDER OF THE ATTITUDE IMMIGRATION VARIABLES TO MAKE THEM CONSISTENT WITH PR
> OINDEX;
. replace att1=7-att1;
(85 real changes made)

. replace att2=7-att2;
(35 real changes made)

. replace att3=7-att3;
(69 real changes made)

. *NOT ALL MEMBERS IN TEAM RESPONDED TO THE ATTITUDE_IMMIGRATION VARIABLES;
. *WILL USE ACTUAL NUMBER WHO RESPONDED TO DEFINE INDEX BELOW;
. replace team=(att1~=.) + (att2~=.) + (att3~=.);
(2 real changes made)

. generate npro=(att1>4 & att1~=.) + (att2>4 & att2~=.) + (att3>4 & att3~=.);

. tabulate npro;

       npro |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         26       29.89       29.89
          1 |         34       39.08       68.97
          2 |         21       24.14       93.10
          3 |          6        6.90      100.00
------------+-----------------------------------
      Total |         87      100.00

. generate pindex=(npro/team);

. *DINDEX IS THE VARIABLE THAT MEASURES IF AT LEAST HALF OF THE TEAM IS PRO-IMMIGRANT;
. generate dindex=(pindex>=.5);

. summ npro pindex dindex;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        npro |         87     1.08046    .9050041          0          3
      pindex |         87    .5095785    .3997385          0          1
      dindex |         87    .6091954    .4907593          0          1

. generate npro1=(att1==1) + (att2==1) + (att3==1);

. generate npro2=(att1==2) + (att2==2) + (att3==2);

. generate npro3=(att1==3) + (att2==3) + (att3==3);

. generate npro4=(att1==4) + (att2==4) + (att3==4);

. generate npro5=(att1==5) + (att2==5) + (att3==5);

. generate npro6=(att1==6) + (att2==6) + (att3==6);

. *THE Px VARIABLES GIVE % OF TEAM THAT IS IN EACH OF THE CODES;
. generate p1=npro1/team;

. generate p2=npro2/team;

. generate p3=npro3/team;

. generate p4=npro4/team;

. generate p5=npro5/team;

. generate p6=npro6/team;

. *P12 P34 P56 GIVE % OF TEAM THAT IS 1,2 OR 3,4, OR 5,6;
. generate p12=p1+p2;

. generate p34=p3+p4;

. generate p56=p5+p6;

. *NOW DEFINING THE THREE TYPES OF TEAMS USED IN PAPER;
. *GROUP 1, AT LEAST 1 PERSON IN TEAM IS ANTI-IMMIGRATION;
. *GROUP 3, MORE THAN HALF OF TEAM IS PRO-IMMIGRATION, SAME AS DINDEX VARIABLE;
. *GROUP 2, THE MODERATE MIDDLE;
. *BUT THERE IS AN OVERLAP OF 2 TEAMS BETWEEN GROUPS 1 AND 3, BOTH TEAMS HAVE 3 PERSON
> S;
. *IN THESE TEAMS, 1 PERSON IS A 2 BUT BOTH OF THE OTHER PEOPLE ARE 5 OR 6;
. *WILL CLASSIFY THEM AS PRO-IMMIGRATION GROUP SINCE MAJORITY IS PRO-IMMIGRATION;
. generate group1=(p12>0);

. generate group3=(pindex>=.5);

. tabulate group3 dindex;

           |        dindex
    group3 |         0          1 |     Total
-----------+----------------------+----------
         0 |        34          0 |        34 
         1 |         0         53 |        53 
-----------+----------------------+----------
     Total |        34         53 |        87 

. tabulate group1 group3;

           |        group3
    group1 |         0          1 |     Total
-----------+----------------------+----------
         0 |        24         51 |        75 
         1 |        10          2 |        12 
-----------+----------------------+----------
     Total |        34         53 |        87 

. list teamid att1 att2 att3 if group1==1 & group3==1;

     +-----------------------------+
     | teamid   att1   att2   att3 |
     |-----------------------------|
  7. |     64      5      2      5 |
 45. |     61      5      2      6 |
     +-----------------------------+

. unique teamid if group1==1 & group3==1;
Number of unique values of teamid is  2
Number of records is  2

. replace group3=1 if group1==1 & group3==1;
(0 real changes made)

. replace group1=0 if group1==1 & group3==1;
(2 real changes made)

. generate group2=(group1==0 & group3==0);

. generate index=1*group1 +2*group2 + 3*group3;

. tabulate index;

      index |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         10       11.49       11.49
          2 |         24       27.59       39.08
          3 |         53       60.92      100.00
------------+-----------------------------------
      Total |         87      100.00

. *TOPIC KNOWLEDGE;
. tabulate topic_knowledge, missing;

TOPIC_KNOWL |
       EDGE |      Freq.     Percent        Cum.
------------+-----------------------------------
       High |          9       10.34       10.34
        Low |         22       25.29       35.63
        Mid |         55       63.22       98.85
         NA |          1        1.15      100.00
------------+-----------------------------------
      Total |         87      100.00

. *MISSING DATA FOR THIS VARIABLE AND IT ALL BELONGS TO TEAM 27;
. *MOREOVER TOPIC_KNOWLEDGE FOR TEAM 27 IN TEAM LEVEL DATA IS ALSO MISSING;
. *WILL USE A HOT DECK PROCEDURE TO IMPUTE BASED ON MDEGREE, TEAM SIZE, AND PMALE;
. tabulate teamid if topic_knowledge=="NA";

     teamid |      Freq.     Percent        Cum.
------------+-----------------------------------
         27 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. summ mdegree  if teamid==27;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     mdegree |          1           4           .          4          4

. tabulate topic_knowledge if mdegree==40 & team_size==1 & pmale==0;
no observations

. tabulate topic_ipred if mdegree==40 & team_size==1 & pmale==0;
no observations

. replace topic_knowledge="Low" if teamid==27;
(1 real change made)

. replace topic_ipred="-0.253722245526001" if teamid==27;
(1 real change made)

. tabulate topic_knowledge, missing;

TOPIC_KNOWL |
       EDGE |      Freq.     Percent        Cum.
------------+-----------------------------------
       High |          9       10.34       10.34
        Low |         23       26.44       36.78
        Mid |         55       63.22      100.00
------------+-----------------------------------
      Total |         87      100.00

. *TOPIC_CAT CONVERTS TOPIC_KNOWLEDGE INTO NUMERIC, NOTE CODE 4 IS NA;
. drop topic_cat;

. generate topic_cat=1*(topic_knowledge=="Low") + 2*(topic_knowledge=="Mid") 
>         + 3*(topic_knowledge=="High");

. *TOPIC VARIABLE IN BRW COMES FROM A FACTOR ANALYSIS PREDICTION;
. destring topic_ipred, force gen(topic_brw);
topic_ipred: all characters numeric; topic_brw generated as double

. tabulate topic_brw topic_knowledge, missing;

topic_ipre |         TOPIC_KNOWLEDGE
         d |      High        Low        Mid |     Total
-----------+---------------------------------+----------
 -.3396846 |         0          1          0 |         1 
 -.3125983 |         0          2          0 |         2 
   -.30488 |         0          1          0 |         1 
 -.2948698 |         0          1          0 |         1 
 -.2924661 |         0          1          0 |         1 
 -.2844923 |         0          1          0 |         1 
 -.2842492 |         0          1          0 |         1 
 -.2567398 |         0          1          0 |         1 
 -.2537222 |         0          2          0 |         2 
 -.2501658 |         0          1          0 |         1 
 -.2323944 |         0          1          0 |         1 
 -.2252685 |         0          1          0 |         1 
 -.2088186 |         0          1          0 |         1 
 -.2032106 |         0          2          0 |         2 
 -.1750503 |         0          1          0 |         1 
 -.1700541 |         0          1          0 |         1 
 -.1684909 |         0          1          0 |         1 
 -.1681252 |         0          1          0 |         1 
  -.159743 |         0          1          0 |         1 
  -.152279 |         0          1          0 |         1 
 -.1431925 |         0          0          2 |         2 
 -.1379568 |         0          0          1 |         1 
 -.1322295 |         0          0          1 |         1 
 -.1180402 |         0          0          1 |         1 
 -.1180365 |         0          0          1 |         1 
 -.1160367 |         0          0          1 |         1 
 -.1126539 |         0          0          1 |         1 
 -.1081857 |         0          0          2 |         2 
 -.1060163 |         0          0          2 |         2 
 -.1056993 |         0          0          2 |         2 
 -.0988388 |         0          0          2 |         2 
 -.0964761 |         0          0          2 |         2 
 -.0910359 |         0          0          1 |         1 
 -.0861576 |         0          0          1 |         1 
 -.0766422 |         0          0          1 |         1 
 -.0724543 |         0          0          1 |         1 
 -.0630017 |         0          0          2 |         2 
 -.0605945 |         0          0          2 |         2 
 -.0572294 |         0          0          1 |         1 
 -.0528801 |         0          0          1 |         1 
 -.0390203 |         0          0          1 |         1 
 -.0355067 |         0          0          1 |         1 
 -.0346285 |         0          0          2 |         2 
 -.0198385 |         0          0          1 |         1 
 -.0190452 |         0          0          1 |         1 
 -.0120221 |         0          0          1 |         1 
 -.0084401 |         0          0          1 |         1 
  .0020823 |         0          0          1 |         1 
  .0121719 |         0          0          1 |         1 
  .0199861 |         0          0          1 |         1 
  .0227601 |         0          0          1 |         1 
  .0236555 |         0          0          1 |         1 
  .0544597 |         0          0          2 |         2 
  .0605255 |         0          0          1 |         1 
  .0693577 |         0          0          1 |         1 
  .0731461 |         0          0          1 |         1 
   .084274 |         0          0          2 |         2 
  .0897856 |         0          0          1 |         1 
  .1259155 |         0          0          1 |         1 
  .1959201 |         0          0          1 |         1 
  .2198415 |         0          0          2 |         2 
   .233174 |         0          0          1 |         1 
  .2384678 |         0          0          1 |         1 
  .2590647 |         2          0          0 |         2 
  .3775455 |         1          0          0 |         1 
  .6968864 |         1          0          0 |         1 
  .7740507 |         1          0          0 |         1 
  .8162819 |         2          0          0 |         2 
  .8381723 |         1          0          0 |         1 
  1.210172 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |         9         23         55 |        87 

. summ topic_brw;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   topic_brw |         87   -.0059047    .2821717  -.3396846   1.210172

. *STATS INFO IS MISSING FOR TEAM 27, BUT TEAM 27 DATA IS NOT AVAILABLE IN TEAM DATA;
. *WILL USE HOT DECK PROCEDURE;
. tabulate statistics_skill if mdegree==40 & team_size==1 & pmale==0;
no observations

. tabulate stats_ipred if mdegree==40 & team_size==1 & pmale==0;
no observations

. replace statistics_skill="Mid" if teamid==27;
(1 real change made)

. replace stats_ipred="0.102538885683808" if teamid==27;
(1 real change made)

. generate stats_cat=1*(statistics_skill=="Low") + 2*(statistics_skill=="Mid") 
>         + 3*(statistics_skill=="High");

. *STATISTICS VARIABLE IN BRW COMES FROM A FACTOR ANALYSIS PREDICTION;
. destring stats_ipred, force gen(stats_brw);
stats_ipred: all characters numeric; stats_brw generated as double

. tabulate teamid if stats_brw==.;
no observations

. replace stats_brw=0.649019158901927 if teamid==8;
(0 real changes made)

. tabulate statistics_skill, sum(stats_brw);

STATISTICS_ |       Summary of stats_ipred
      SKILL |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |   .52499355   .21042013          25
        Low |  -.48944831   .26780576          27
        Mid |   -.0068917   .10468045          35
------------+------------------------------------
      Total |  -.00381006    .4401228          87

. *BELIEF HYPOTHESIS HAS USUAL PROBLEM WITH MISSING DATA FOR TEAM 27;
. *WILL AGAIN USE HOT DECK PROCEDURE;
. *NOT CLEAR THAT BELIEF VARIABLE SHOULD BE IMPUTED IN THIS CONTEXT;
. *AS THE BELIEF VARIABLE IS A KEY INDEPENDENT VARIABLE;
. tabulate belief_hypothesis if teamid==27;

BELIEF_HYPO |
     THESIS |      Freq.     Percent        Cum.
------------+-----------------------------------
         NA |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. tabulate belief_ipred if teamid==27;

      belief_ipred |      Freq.     Percent        Cum.
-------------------+-----------------------------------
                NA |          1      100.00      100.00
-------------------+-----------------------------------
             Total |          1      100.00

. tabulate belief_hypothesis if mdegree==40 & team_size==1 & pmale==0;
no observations

. replace belief_hypothesis="Low" if teamid==27;
(1 real change made)

. replace belief_ipred="-1.13508799270782" if teamid==27;
(1 real change made)

. tabulate belief_hypothesis, missing;

BELIEF_HYPO |
     THESIS |      Freq.     Percent        Cum.
------------+-----------------------------------
       High |         31       35.63       35.63
        Low |         22       25.29       60.92
        Mid |         34       39.08      100.00
------------+-----------------------------------
      Total |         87      100.00

. *BELIEF_CAT REVERSES ORDER TO MAKE IT CONSISTENT WITH DATA;
. drop belief_cat;

. generate belief_cat=3*(belief_hypothesis=="Low") + 2*(belief_hypothesis=="Mid") 
>         + 1*(belief_hypothesis=="High");

. tabulate belief_hypothesis belief_cat, missing;

BELIEF_HYP |            belief_cat
   OTHESIS |         1          2          3 |     Total
-----------+---------------------------------+----------
      High |        31          0          0 |        31 
       Low |         0          0         22 |        22 
       Mid |         0         34          0 |        34 
-----------+---------------------------------+----------
     Total |        31         34         22 |        87 

. destring belief_ipred, force replace;
belief_ipred: all characters numeric; replaced as double

. *THERE IS PROBABLY A MISCODING OF WHAT "HIGH BELIEF" MEANS IN DATA SET, DIRECTION IS
>  REVERSED;
. *ALTERNATIVE MEASURE OF BELIEF HYPOTHESIS USING INDIVIDUAL TEAM MEMBER BELIEFS;
. *SEE 002_CRI_DATA_PREP.RMD, LINE 356;
. *SUGGESTS CODING CHANGED FROM QUESTIONNAIRE AND HIGHER VALUES OF BELIEF_H1_11 SHOULD
>  INDICATE MORE BELIEF IN HYPOTHESIS;
. *BUT DISTRIBUTION OF VARIABLE COMPARED TO APPENDIX SUGGESTS THAT 1 IS STRONGLY REDUC
> ES, AND 4 IS SOMEWHAT INCREASES;
. *NOTE HIGH VALUE OF BELIEF_1_AVG MEANS *WEAKER* BELIEF IN HYPOTHESIS IMMIGRATION RED
> UCES SOCIAL SUPPORT;
. *NOTE THAT BELIEF_1_AVG AND BELIEF_H1_11 ARE THE SAME FOR SINGLE PERSON TEAMS;
. tabulate belief_1_avg belief_hypothesis;

                 |        BELIEF_HYPOTHESIS
    belief_1_avg |      High        Low        Mid |     Total
-----------------+---------------------------------+----------
               1 |         0          1          0 |         1 
1.66666666666667 |         0          2          0 |         2 
               2 |         2         15          8 |        25 
2.33333333333333 |         0          2         12 |        14 
             2.5 |         3          0          6 |         9 
2.66666666666667 |         6          0          5 |        11 
               3 |        15          2          3 |        20 
3.33333333333333 |         1          0          0 |         1 
             3.5 |         4          0          0 |         4 
-----------------+---------------------------------+----------
           Total |        31         22         34 |        87 

. tabulate belief_1_avg;

    belief_1_avg |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               1 |          1        1.15        1.15
1.66666666666667 |          2        2.30        3.45
               2 |         25       28.74       32.18
2.33333333333333 |         14       16.09       48.28
             2.5 |          9       10.34       58.62
2.66666666666667 |         11       12.64       71.26
               3 |         20       22.99       94.25
3.33333333333333 |          1        1.15       95.40
             3.5 |          4        4.60      100.00
-----------------+-----------------------------------
           Total |         87      100.00

. tabulate belief_1_avg belief_h1_11 if team_size==1;

                 |           belief_H1_11
    belief_1_avg |         1          2          3 |     Total
-----------------+---------------------------------+----------
               1 |         1          0          0 |         1 
               2 |         0          8          0 |         8 
               3 |         0          0          8 |         8 
-----------------+---------------------------------+----------
           Total |         1          8          8 |        17 

. destring belief_1_avg, force replace;
belief_1_avg: all characters numeric; replaced as double

. destring belief_h1_11, force replace;
belief_h1_11: contains nonnumeric characters; replaced as byte
(1 missing value generated)

. destring belief_h1_12, force replace;
belief_h1_12: contains nonnumeric characters; replaced as byte
(51 missing values generated)

. destring belief_h1_13, force replace;
belief_h1_13: contains nonnumeric characters; replaced as byte
(18 missing values generated)

. tabulate belief_h1_11, missing;

belief_H1_1 |
          1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          3        3.45        3.45
          2 |         50       57.47       60.92
          3 |         28       32.18       93.10
          4 |          5        5.75       98.85
          . |          1        1.15      100.00
------------+-----------------------------------
      Total |         87      100.00

. tabulate belief_h1_12, missing;

belief_H1_1 |
          2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |         17       19.54       19.54
          3 |         19       21.84       41.38
          . |         51       58.62      100.00
------------+-----------------------------------
      Total |         87      100.00

. tabulate belief_h1_13, missing;

belief_H1_1 |
          3 |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |         38       43.68       43.68
          3 |         26       29.89       73.56
          4 |          5        5.75       79.31
          . |         18       20.69      100.00
------------+-----------------------------------
      Total |         87      100.00

. *NBELIEF IS NUMBER IN TEAM THAT BELIEVES HYPOTHESIS IMMIGRATION REDUCES SUPPORT;
. *DBELIEF EQUALS 1 IF MORE THAN HALF THE TEAM BELIEVES IMMIGRATION REDUCES SUPPORT;
. *IF IMMIGRATION REDUCES SUPPORT IT WOULD MEAN THAT THE AME IS NEGATIVE;
. *USE CORRECT MEASURE OF TEAM SIZE TO DEFINE PBELIEF;
. *THE ORIGINAL BELIEF INDICES ONLY HAVE 4 POTENTIAL VALUES SO CANNOT DIFFERENTIATE LO
> WER AND UPPER ENDS;
. generate nbelief=(belief_h1_11<=2 & belief_h1_11~=.) 
>         + (belief_h1_12<=2 & belief_h1_12~=.) + (belief_h1_13<=2 & belief_h1_13~=.);

. replace team=(belief_h1_11~=.) + (belief_h1_12~=.) + (belief_h1_13~=.);
(2 real changes made)

. *generate nbelief=(belief_h1_11<2) + (belief_h1_12<2) + (belief_h1_13<2);
. generate pbelief=nbelief/team;

. tabulate pbelief;

    pbelief |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         21       24.14       24.14
   .3333333 |         10       11.49       35.63
         .5 |         13       14.94       50.57
   .6666667 |         15       17.24       67.82
          1 |         28       32.18      100.00
------------+-----------------------------------
      Total |         87      100.00

. tabulate belief_hypothesis, sum(pbelief);

BELIEF_HYPO |         Summary of pbelief
     THESIS |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |   .20430108   .30033832          31
        Low |   .92424243   .16846076          22
        Mid |   .62254903   .27311898          34
------------+------------------------------------
      Total |   .54980843   .38471687          87

. tabulate belief_hypothesis, sum(belief_ipred);

BELIEF_HYPO |       Summary of belief_ipred
     THESIS |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |   .35405259   .15502166          31
        Low |  -.43933601   .25193769          22
        Mid |  -.01930631   .11867689          34
------------+------------------------------------
      Total |   .00751521   .35204914          87

. tabulate pbelief, sum(belief_ipred);

            |       Summary of belief_ipred
    pbelief |        Mean   Std. dev.       Freq.
------------+------------------------------------
          0 |   .41087404   .16004751          21
   .3333333 |   .15795696   .07255801          10
         .5 |   .04399382   .24131874          13
   .6666667 |  -.12038985   .12135739          15
          1 |  -.29714904   .31560491          28
------------+------------------------------------
      Total |   .00751521   .35204914          87

. *NOTE SIGN IS REVERSED BECAUSE THE ORDERING OF THE BELIEF VARIABLE IN FINAL DATA SET
>  IS INCORRECT;
. generate belief_brw=-belief_ipred;

. tabulate belief_hypothesis, sum(belief_brw);

BELIEF_HYPO |        Summary of belief_brw
     THESIS |        Mean   Std. dev.       Freq.
------------+------------------------------------
       High |  -.35405259   .15502166          31
        Low |   .43933601   .25193769          22
        Mid |   .01930631   .11867689          34
------------+------------------------------------
      Total |  -.00751521   .35204914          87

. tabulate pbelief, sum(belief_brw);

            |        Summary of belief_brw
    pbelief |        Mean   Std. dev.       Freq.
------------+------------------------------------
          0 |  -.41087404   .16004751          21
   .3333333 |  -.15795696   .07255801          10
         .5 |  -.04399382   .24131874          13
   .6666667 |   .12038985   .12135739          15
          1 |   .29714904   .31560491          28
------------+------------------------------------
      Total |  -.00751521   .35204914          87

. tabulate belief_cat, sum(belief_brw);

            |        Summary of belief_brw
 belief_cat |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |  -.35405259   .15502166          31
          2 |   .01930631   .11867689          34
          3 |   .43933601   .25193769          22
------------+------------------------------------
      Total |  -.00751521   .35204914          87

. tabulate Hresult hresult;

           |             Hresult
   Hresult |   No test     Reject    Support |     Total
-----------+---------------------------------+----------
   No test |        10          0          0 |        10 
    Reject |         0         54          0 |        54 
   Support |         0          0         23 |        23 
-----------+---------------------------------+----------
     Total |        10         54         23 |        87 

. summ belief_brw stats_brw topic_brw ame;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  belief_brw |         87   -.0075152    .3520491  -.7355577   1.135088
   stats_brw |         87   -.0038101    .4401228  -1.352966   1.099596
   topic_brw |         87   -.0059047    .2821717  -.3396846   1.210172
         ame |         87   -.0093777    .0871169   -.391782   .3595625

.         *MERGING IN ALTERNATIVE MEASURES OF MEAN AND VARIANCE OF AME FROM MODEL LEVE
> L DATA;
. sort teamid hrej;

. merge teamid hrej using /volumes/ddisk/data/junkvar.dta;
(you are using old merge syntax; see [D] merge for new syntax)

. drop _merge;

. *MERGING IN REFEREE SCORE;
. sort teamid hrej;

. merge teamid hrej using /volumes/ddisk/data/junkpscore.dta;
(you are using old merge syntax; see [D] merge for new syntax)

. drop _merge;

. drop if ame==.;
(1 observation deleted)

. summ ame meaname;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         ame |         87   -.0093777    .0871169   -.391782   .3595625
     meaname |         87   -.0093777    .0871169   -.391782   .3595625

. *NOTE THAT AT TEAM-CONCLUSION LEVEL HREJ IS THE CORRECT VARIABLE TO USE;
. list teamid hrej hreject ame meaname;

     +---------------------------------------------------+
     | teamid   hrej   hreject          ame      meaname |
     |---------------------------------------------------|
  1. |      2      0         0    -.0537875    -.0537875 |
  2. |      3      0         0    .00008333    .00008333 |
  3. |      5      0         0    .00095406    .00095406 |
  4. |      6      0         0   -.17298625   -.17298625 |
  5. |      7      0         0     -.391782     -.391782 |
     |---------------------------------------------------|
  6. |      7      1         0       .03423       .03423 |
  7. |      8      1         1      -.00668      -.00668 |
  8. |     10      0         0   -.05544333   -.05544333 |
  9. |     12      1         1    .13116667    .13116667 |
 10. |     13      1         1     .3595625     .3595625 |
     |---------------------------------------------------|
 11. |     16      0         0      -.02708      -.02708 |
 12. |     16      1         0       .17292       .17292 |
 13. |     17      0         0      -.01659      -.01659 |
 14. |     17      1         0     -.027015     -.027015 |
 15. |     18      0         0    .01008333    .01008333 |
     |---------------------------------------------------|
 16. |     19      0         0     -.010016     -.010016 |
 17. |     20      1         1    .04233333    .04233333 |
 18. |     21      0         0      -.04234      -.04234 |
 19. |     22      1         1    .00022167    .00022167 |
 20. |     23      1         1    .01926146    .01926146 |
     |---------------------------------------------------|
 21. |     26      0         0     -.077935     -.077935 |
 22. |     27      1         1    .01252917    .01252917 |
 23. |     28      1         1   -.00085042   -.00085042 |
 24. |     29      0         0   -.00866208   -.00866208 |
 25. |     29      1         0    .02390625    .02390625 |
     |---------------------------------------------------|
 26. |     30      1         1     .0101875     .0101875 |
 27. |     31      1         1   -.00022125   -.00022125 |
 28. |     32      0         0       .00808       .00808 |
 29. |     33      1         1     -.267857     -.267857 |
 30. |     34      1         1   -.04771188   -.04771188 |
     |---------------------------------------------------|
 31. |     35      1         1         .044         .044 |
 32. |     36      1         1    .00162167    .00162167 |
 33. |     37      0         0      -.01141      -.01141 |
 34. |     37      1         0       .01689       .01689 |
 35. |     38      1         1      -.09859      -.09859 |
     |---------------------------------------------------|
 36. |     39      1         1   -.07193417   -.07193417 |
 37. |     40      1         1         .148         .148 |
 38. |     41      1         1   -.04054167   -.04054167 |
 39. |     42      0         0     -.257955     -.257955 |
 40. |     43      1         1      -.02203      -.02203 |
     |---------------------------------------------------|
 41. |     45      1         1      -.00367      -.00367 |
 42. |     46      1         1    .00282375    .00282375 |
 43. |     47      1         1     .0435525     .0435525 |
 44. |     48      1         1    .03660143    .03660143 |
 45. |     49      1         1    .00913833    .00913833 |
     |---------------------------------------------------|
 46. |     52      0         0   -.00858222   -.00858222 |
 47. |     52      1         0   -.07567611   -.07567611 |
 48. |     54      0         0    .02961167    .02961167 |
 49. |     56      0         0        -.007        -.007 |
 50. |     56      1         0         .074         .074 |
     |---------------------------------------------------|
 51. |     58      0         0    -.1037975    -.1037975 |
 52. |     58      1         0   -.00221667   -.00221667 |
 53. |     59      1         1   -.00379167   -.00379167 |
 54. |     60      1         1      .005365      .005365 |
 55. |     61      1         1   -.00302333   -.00302333 |
     |---------------------------------------------------|
 56. |     62      0         0      .140185      .140185 |
 57. |     62      1         0    .04484375    .04484375 |
 58. |     64      0         0    .00278375    .00278375 |
 59. |     65      0         0   -.05246208   -.05246208 |
 60. |     65      1         0     -.000105     -.000105 |
     |---------------------------------------------------|
 61. |     68      1         1    .00574741    .00574741 |
 62. |     69      1         1   -.00196417   -.00196417 |
 63. |     70      0         0       -.0235       -.0235 |
 64. |     70      1         0      -.01175      -.01175 |
 65. |     72      1         1    .01285917    .01285917 |
     |---------------------------------------------------|
 66. |     73      0         0     .0047425     .0047425 |
 67. |     75      0         0      -.08128      -.08128 |
 68. |     75      1         0   -.05379417   -.05379417 |
 69. |     77      1         1   -.07483333   -.07483333 |
 70. |     82      0         0     .0037575     .0037575 |
     |---------------------------------------------------|
 71. |     83      1         1   -.00174167   -.00174167 |
 72. |     84      0         0        -.096        -.096 |
 73. |     84      1         0    .02783333    .02783333 |
 74. |     86      0         0   -.00335759   -.00335759 |
 75. |     87      0         0   -.02366667   -.02366667 |
     |---------------------------------------------------|
 76. |     87      1         0    .07666667    .07666667 |
 77. |     93      1         1     -.000504     -.000504 |
 78. |     94      1         1   -.06016667   -.06016667 |
 79. |     95      1         1    .01115125    .01115125 |
 80. |     96      1         1     .0027875     .0027875 |
     |---------------------------------------------------|
 81. |     97      1         1    .00137333    .00137333 |
 82. |     98      0         0     -.003485     -.003485 |
 83. |     98      1         0   -.01704063   -.01704063 |
 84. |    101      0         0    .09914104    .09914104 |
 85. |    104      0         0      -.02348      -.02348 |
     |---------------------------------------------------|
 86. |    104      1         0     -.023713     -.023713 |
 87. |    106      1         1      -.01684      -.01684 |
     +---------------------------------------------------+

. tabulate hrej hreject;

           |        Hreject
      Hrej |         0          1 |     Total
-----------+----------------------+----------
         0 |        33          0 |        33 
         1 |        16         38 |        54 
-----------+----------------------+----------
     Total |        49         38 |        87 

. *DO BELIEFS DRIVE NORMATIVE CONCLUSIONS?
> *WEIGHTED BY # OF MODELS SO THAT TEAMS THAT STUDIED THE ISSUE "MORE" COUNT MORE IN T
> HE NORMATIVE REGRESSION;
. *ALTERNATIVE MEASURES OF BELIEF;
. *BELIEF_BRW IS THE FACTOR INDEX IN THE ORIGINAL PAPER TIMES MINUS 1;
. *PBELIEF GIVES THE FRACTION OF THE TEAM THAT STRONGLY BELIEVES IN HYPOTHESIS;
. *HBELIEF IS A DUMMY = 1 IF BELIEF_HYPOTHESIS IS "LOW", WHICH MEANS TEAM REALLY BELIE
> VES THE HYPOTHESIS BASED ON FACTOR INDEX;
. *PB1 = 1 IF MORE THAN HALF TEH TEAM STRONGLY BELIEVES IN HYPOTHESIS;
. generate hbelief=(belief_hypothesis=="Low");

. corr pbelief hbelief;
(obs=87)

             |  pbelief  hbelief
-------------+------------------
     pbelief |   1.0000
     hbelief |   0.5695   1.0000


. *PB1 INDICATES IF MORE THAN HALF THE TEAM STRONGLY BELIEVES IN HYPOTHESIS;
. generate pb1=(pbelief>.5);

. *MAIN REGRESSIONS AND PREDICTIONS FOR GRAPH;
. quietly logit hrej pb1  meaname rneg  nmodel  stats_brw topic_brw i.team_size i.mdeg
> ree [iw=1]   , 
>         cluster(teamid);

. display e(r2_p);
.33465874

.  margins, dydx(pb1-topic);

Average marginal effects                                    Number of obs = 82
Model VCE: Robust

Expression: Pr(hrej), predict()
dy/dx wrt:  pb1 meaname rneg nmodel stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         pb1 |  -.1573981   .0867305    -1.81   0.070    -.3273868    .0125906
     meaname |  -.7378941   .5747108    -1.28   0.199    -1.864307    .3885183
        rneg |  -.7977043   .1179647    -6.76   0.000    -1.028911   -.5664977
      nmodel |  -.0018808   .0024244    -0.78   0.438    -.0066325    .0028709
   stats_brw |   .0440307   .1195112     0.37   0.713    -.1902069    .2782683
   topic_brw |  -.3322539   .1875395    -1.77   0.076    -.6998245    .0353167
------------------------------------------------------------------------------

. quietly logit hrej pb1  meaname rneg group1 group3 nmodel  stats_brw topic_brw i.tea
> m_size i.mdegree [iw=1]   , 
>         cluster(teamid);

. display e(r2_p);
.37044541

.  margins, dydx(pb1-topic);

Average marginal effects                                    Number of obs = 82
Model VCE: Robust

Expression: Pr(hrej), predict()
dy/dx wrt:  pb1 meaname rneg group1 group3 nmodel stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         pb1 |  -.0971245   .0973371    -1.00   0.318    -.2879017    .0936528
     meaname |   -.114253   .7908565    -0.14   0.885    -1.664303    1.435797
        rneg |  -.7761079   .0939118    -8.26   0.000    -.9601717   -.5920442
      group1 |   .2326021   .1221349     1.90   0.057    -.0067779     .471982
      group3 |  -.1176165   .1030665    -1.14   0.254    -.3196231    .0843901
      nmodel |  -.0019783   .0023874    -0.83   0.407    -.0066576     .002701
   stats_brw |   .0691184   .1075724     0.64   0.521    -.1417195    .2799564
   topic_brw |  -.3282424   .1861928    -1.76   0.078    -.6931736    .0366888
------------------------------------------------------------------------------

. quietly logit hrej pb1  meaname rneg  nmodel  stats_brw topic_brw i.team_size i.mdeg
> ree [iw=nmodel]   , 
>         cluster(teamid);

. display e(r2_p);
.44272492

.  margins, dydx(pb1-topic);

Average marginal effects                                    Number of obs = 82
Model VCE: Robust

Expression: Pr(hrej), predict()
dy/dx wrt:  pb1 meaname rneg nmodel stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         pb1 |   -.332184   .0644631    -5.15   0.000    -.4585293   -.2058386
     meaname |  -1.658687   .4624942    -3.59   0.000    -2.565159   -.7522146
        rneg |  -1.003222   .1261911    -7.95   0.000    -1.250552   -.7558922
      nmodel |  -.0017385   .0028164    -0.62   0.537    -.0072585    .0037816
   stats_brw |   .1309903   .1090186     1.20   0.230    -.0826822    .3446627
   topic_brw |  -.4734843   .2716587    -1.74   0.081    -1.005926    .0589569
------------------------------------------------------------------------------

. quietly logit hrej pb1  meaname rneg group1 group3 nmodel  stats_brw topic_brw i.tea
> m_size i.mdegree [iw=nmodel]   , 
>         cluster(teamid);

. display e(r2_p);
.47905207

.  margins, dydx(pb1-topic);

Average marginal effects                                    Number of obs = 82
Model VCE: Robust

Expression: Pr(hrej), predict()
dy/dx wrt:  pb1 meaname rneg group1 group3 nmodel stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         pb1 |   -.271224   .0989847    -2.74   0.006    -.4652304   -.0772176
     meaname |  -1.228721   .5066204    -2.43   0.015    -2.221678    -.235763
        rneg |  -.8895715   .1233778    -7.21   0.000    -1.131387   -.6477555
      group1 |   .3201102   .1410064     2.27   0.023     .0437427    .5964777
      group3 |  -.0441994   .1490014    -0.30   0.767    -.3362367    .2478379
      nmodel |  -.0011866   .0026872    -0.44   0.659    -.0064534    .0040802
   stats_brw |   .1190606   .0917538     1.30   0.194    -.0607736    .2988947
   topic_brw |  -.3959935   .2151896    -1.84   0.066    -.8177573    .0257703
------------------------------------------------------------------------------

. generate code=1*(rneg<=.15) + 2*(rneg>.15 & rneg<.5) + 3*(rneg==.5) + 4*(rneg>.5);

. generate v10=(code==1 & pb1==0);

. generate v11=(code==1 & pb1==1);

. generate v20=(code==2 & pb1==0);

. generate v21=(code==2 & pb1==1);

. generate v30=(code==3 & pb1==0);

. generate v31=(code==3 & pb1==1);

. generate v40=(code==4 & pb1==0);

. generate v41=(code==4 & pb1==1);

. generate gp=1*v10 + 2*v11 + 3*v20 + 4*v21 + 5*v30 + 6*v31 + 7*v40 + 8*v41;

. tabulate code pb1, sum(hrej) me nofreq;

                               Means of Hrej

           |         pb1
      code |         0          1 |     Total
-----------+----------------------+----------
         1 | .86666667        .75 |        .8
         2 |        .9  .69230769 |  .7826087
         3 | .66666667  .33333333 | .55555556
         4 | .15384615  .14285714 |       .15
-----------+----------------------+----------
     Total | .63636364  .60465116 | .62068966

. logit hrej i.gp  , nocons cluster(teamid);

Iteration 0:  Log pseudolikelihood = -60.303805  
Iteration 1:  Log pseudolikelihood = -47.221245  
Iteration 2:  Log pseudolikelihood = -47.099875  
Iteration 3:  Log pseudolikelihood = -47.099524  
Iteration 4:  Log pseudolikelihood = -47.099524  

Logistic regression                                     Number of obs =     87
                                                        Wald chi2(7)  =  18.94
Log pseudolikelihood = -47.099524                       Prob > chi2   = 0.0084

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
        hrej | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          gp |
          2  |   1.098612   .5200733     2.11   0.035     .0792874    2.117937
          3  |   2.197225   1.061595     2.07   0.038     .1165364    4.277913
          4  |   .8109302   .5567052     1.46   0.145    -.2801918    1.902052
          5  |   .6931472   .7121396     0.97   0.330    -.7026209    2.088915
          6  |  -.6931472   1.233462    -0.56   0.574    -3.110688    1.724394
          7  |  -1.704748   .7741774    -2.20   0.028    -3.222108   -.1873883
          8  |  -1.791759   1.087811    -1.65   0.100     -3.92383    .3403114
------------------------------------------------------------------------------

. margins gp, atmeans;

Adjusted predictions                                        Number of obs = 87
Model VCE: Robust

Expression: Pr(hrej), predict()
At: 1.gp = .1724138 (mean)
    2.gp = .2298851 (mean)
    3.gp = .1149425 (mean)
    4.gp = .1494253 (mean)
    5.gp = .0689655 (mean)
    6.gp = .0344828 (mean)
    7.gp = .1494253 (mean)
    8.gp = .0804598 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          gp |
          1  |          .  (not estimable)
          2  |        .75   .0975137     7.69   0.000     .5588766    .9411234
          3  |         .9   .0955436     9.42   0.000     .7127381    1.087262
          4  |   .6923077   .1185881     5.84   0.000     .4598793    .9247361
          5  |   .6666667   .1582533     4.21   0.000      .356496    .9768373
          6  |   .3333333   .2741027     1.22   0.224     -.203898    .8705647
          7  |   .1538462   .1007805     1.53   0.127      -.04368    .3513723
          8  |   .1428571   .1332014     1.07   0.284    -.1182128     .403927
------------------------------------------------------------------------------

. logit hrej i.gp nmodel stats_brw topic_brw i.team_size i.mdegree ,  cluster(teamid);

note: 1.mdegree != 0 predicts success perfectly;
      1.mdegree omitted and 1 obs not used.

note: 2.mdegree != 0 predicts success perfectly;
      2.mdegree omitted and 1 obs not used.

note: 30.mdegree != 0 predicts success perfectly;
      30.mdegree omitted and 1 obs not used.

note: 33.mdegree != 0 predicts success perfectly;
      33.mdegree omitted and 1 obs not used.

note: 35.mdegree != 0 predicts success perfectly;
      35.mdegree omitted and 1 obs not used.

note: 34.mdegree omitted because of collinearity.
Iteration 0:  Log pseudolikelihood = -55.267034  
Iteration 1:  Log pseudolikelihood = -34.789149  
Iteration 2:  Log pseudolikelihood = -34.276812  
Iteration 3:  Log pseudolikelihood = -34.266495  
Iteration 4:  Log pseudolikelihood = -34.266487  
Iteration 5:  Log pseudolikelihood = -34.266487  

Logistic regression                                     Number of obs =     82
                                                        Wald chi2(19) =  42.99
                                                        Prob > chi2   = 0.0013
Log pseudolikelihood = -34.266487                       Pseudo R2     = 0.3800

                                (Std. err. adjusted for 66 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
        hrej | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          gp |
          2  |  -1.011706   1.053724    -0.96   0.337    -3.076967    1.053555
          3  |  -.4952897   1.856678    -0.27   0.790    -4.134312    3.143732
          4  |  -1.701581   1.211008    -1.41   0.160    -4.075113    .6719507
          5  |  -.7422249   1.180858    -0.63   0.530    -3.056663    1.572214
          6  |  -3.770974   1.882312    -2.00   0.045    -7.460238   -.0817111
          7  |  -5.523926   1.292919    -4.27   0.000       -8.058   -2.989852
          8  |  -5.209219   1.713983    -3.04   0.002    -8.568564   -1.849875
             |
      nmodel |  -.0135515   .0189959    -0.71   0.476    -.0507827    .0236797
   stats_brw |  -.2913095    .868501    -0.34   0.737     -1.99354    1.410921
   topic_brw |  -1.449113   1.284771    -1.13   0.259    -3.967218    1.068993
             |
   team_size |
          2  |  -.3291763   1.085644    -0.30   0.762    -2.456999    1.798646
          3  |  -.4897387    1.18802    -0.41   0.680    -2.818216    1.838739
             |
     mdegree |
          1  |          0  (empty)
          2  |          0  (empty)
          3  |   2.598454   1.299578     2.00   0.046     .0513289     5.14558
          4  |   .4430337   1.592748     0.28   0.781    -2.678694    3.564762
          5  |   2.977418   1.664088     1.79   0.074     -.284135    6.238971
          6  |   5.157089   1.819231     2.83   0.005     1.591461    8.722716
         20  |   3.548819   1.860521     1.91   0.056    -.0977351    7.195373
         30  |          0  (empty)
         31  |   1.457653   1.609416     0.91   0.365    -1.696744    4.612049
         32  |   .4391876   1.816515     0.24   0.809    -3.121116    3.999492
         33  |          0  (empty)
         34  |          0  (omitted)
         35  |          0  (empty)
             |
       _cons |   1.130385   1.653223     0.68   0.494    -2.109873    4.370643
------------------------------------------------------------------------------

. margins gp, atmeans;

Adjusted predictions                                        Number of obs = 82
Model VCE: Robust

Expression: Pr(hrej), predict()
At: 1.gp        = .1829268 (mean)
    2.gp        = .2439024 (mean)
    3.gp        =  .097561 (mean)
    4.gp        = .1219512 (mean)
    5.gp        = .0731707 (mean)
    6.gp        = .0365854 (mean)
    7.gp        = .1585366 (mean)
    8.gp        = .0853659 (mean)
    nmodel      = 14.06098 (mean)
    stats_brw   = .0175465 (mean)
    topic_brw   = .0007157 (mean)
    1.team_size = .1829268 (mean)
    2.team_size =  .402439 (mean)
    3.team_size = .4146341 (mean)
    3.mdegree   =  .402439 (mean)
    4.mdegree   = .2195122 (mean)
    5.mdegree   = .0609756 (mean)
    6.mdegree   = .0243902 (mean)
    20.mdegree  = .0853659 (mean)
    31.mdegree  = .1097561 (mean)
    32.mdegree  = .0609756 (mean)
    34.mdegree  = .0365854 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          gp |
          1  |   .9267747   .0616457    15.03   0.000     .8059513    1.047598
          2  |   .8214884   .0861511     9.54   0.000     .6526353    .9903414
          3  |   .8852262   .1636453     5.41   0.000     .5644873    1.205965
          4  |   .6977463   .1617548     4.31   0.000     .3807126     1.01478
          5  |   .8576546   .1062603     8.07   0.000     .6493882    1.065921
          6  |    .225691   .2943292     0.77   0.443    -.3511837    .8025656
          7  |   .0480736   .0423852     1.13   0.257    -.0349999     .131147
          8  |   .0647034   .0810427     0.80   0.425    -.0941373    .2235442
------------------------------------------------------------------------------

. lincom 1.gp-2.gp;

 ( 1)  [hrej]1b.gp - [hrej]2.gp = 0

------------------------------------------------------------------------------
        hrej | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   1.011706   1.053724     0.96   0.337    -1.053555    3.076967
------------------------------------------------------------------------------

. lincom 3.gp-4.gp;

 ( 1)  [hrej]3.gp - [hrej]4.gp = 0

------------------------------------------------------------------------------
        hrej | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   1.206292   1.653778     0.73   0.466    -2.035053    4.447636
------------------------------------------------------------------------------

. lincom 5.gp-6.gp;

 ( 1)  [hrej]5.gp - [hrej]6.gp = 0

------------------------------------------------------------------------------
        hrej | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   3.028749   1.886168     1.61   0.108    -.6680719    6.725571
------------------------------------------------------------------------------

. lincom 7.gp-8.gp;

 ( 1)  [hrej]7.gp - [hrej]8.gp = 0

------------------------------------------------------------------------------
        hrej | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |  -.3147062   1.607487    -0.20   0.845    -3.465324    2.835911
------------------------------------------------------------------------------

. logit hrej i.gp nmodel stats_brw topic_brw i.team_size i.mdegree [iw=nmodel],  clust
> er(teamid);

note: 1.mdegree != 0 predicts success perfectly;
      1.mdegree omitted and 1 obs not used.

note: 2.mdegree != 0 predicts success perfectly;
      2.mdegree omitted and 1 obs not used.

note: 30.mdegree != 0 predicts success perfectly;
      30.mdegree omitted and 1 obs not used.

note: 33.mdegree != 0 predicts success perfectly;
      33.mdegree omitted and 1 obs not used.

note: 35.mdegree != 0 predicts success perfectly;
      35.mdegree omitted and 1 obs not used.

note: 34.mdegree omitted because of collinearity.
Iteration 0:  Log pseudolikelihood = -744.91502  
Iteration 1:  Log pseudolikelihood = -414.26668  
Iteration 2:  Log pseudolikelihood = -395.13878  
Iteration 3:  Log pseudolikelihood = -393.78408  
Iteration 4:  Log pseudolikelihood =  -393.7719  
Iteration 5:  Log pseudolikelihood = -393.77188  

Logistic regression                                     Number of obs =     82
                                                        Wald chi2(19) =  47.84
                                                        Prob > chi2   = 0.0003
Log pseudolikelihood = -393.77188                       Pseudo R2     = 0.4714

                                (Std. err. adjusted for 66 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
        hrej | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          gp |
          2  |  -3.452811   1.534716    -2.25   0.024    -6.460799    -.444823
          3  |  -3.140568   2.314326    -1.36   0.175    -7.676564    1.395427
          4  |  -5.032409   1.888625    -2.66   0.008    -8.734046   -1.330772
          5  |  -1.705218   1.985456    -0.86   0.390     -5.59664    2.186204
          6  |  -5.771862   2.556785    -2.26   0.024    -10.78307   -.7606558
          7  |  -7.800319   2.112618    -3.69   0.000    -11.94097   -3.659664
          8  |  -9.244364   2.675843    -3.45   0.001    -14.48892   -3.999809
             |
      nmodel |  -.0192361   .0207843    -0.93   0.355    -.0599726    .0215005
   stats_brw |  -.1087103   1.352025    -0.08   0.936    -2.758631     2.54121
   topic_brw |  -2.648228   2.170408    -1.22   0.222     -6.90215    1.605694
             |
   team_size |
          2  |   -3.48042   2.505065    -1.39   0.165    -8.390257    1.429417
          3  |  -1.956863   2.570275    -0.76   0.446     -6.99451    3.080784
             |
     mdegree |
          1  |          0  (empty)
          2  |          0  (empty)
          3  |   3.873289   1.544898     2.51   0.012     .8453452    6.901233
          4  |   3.076295   2.372662     1.30   0.195    -1.574038    7.726627
          5  |   6.983498   2.072524     3.37   0.001     2.921425    11.04557
          6  |   5.716751    2.98527     1.91   0.055    -.1342715    11.56777
         20  |   5.916185   2.114513     2.80   0.005     1.771815    10.06055
         30  |          0  (empty)
         31  |   4.763158   1.526897     3.12   0.002     1.770494    7.755822
         32  |   1.517497   1.942662     0.78   0.435    -2.290051    5.325044
         33  |          0  (empty)
         34  |          0  (omitted)
         35  |          0  (empty)
             |
       _cons |   3.342499   2.944406     1.14   0.256     -2.42843    9.113428
------------------------------------------------------------------------------

. margins gp, atmeans;

Adjusted predictions                                        Number of obs = 82
Model VCE: Robust

Expression: Pr(hrej), predict()
At: 1.gp        =  .2610581 (mean)
    2.gp        =  .3235039 (mean)
    3.gp        =  .0667823 (mean)
    4.gp        =  .1474415 (mean)
    5.gp        =  .0381613 (mean)
    6.gp        =  .0381613 (mean)
    7.gp        =  .0884649 (mean)
    8.gp        =  .0364267 (mean)
    nmodel      =   37.1856 (mean)
    stats_brw   = -.0127851 (mean)
    topic_brw   = -.0303503 (mean)
    1.team_size =  .2090199 (mean)
    2.team_size =  .3287077 (mean)
    3.team_size =  .4622723 (mean)
    3.mdegree   =  .4657415 (mean)
    4.mdegree   =  .2150911 (mean)
    5.mdegree   =  .0450997 (mean)
    6.mdegree   =  .0138768 (mean)
    20.mdegree  =  .0685169 (mean)
    31.mdegree  =  .1049436 (mean)
    32.mdegree  =  .0676496 (mean)
    34.mdegree  =  .0190807 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          gp |
          1  |   .9893144   .0141655    69.84   0.000     .9615506    1.017078
          2  |    .745604   .1167491     6.39   0.000       .51678    .9744281
          3  |   .8002001   .2956451     2.71   0.007     .2207463    1.379654
          4  |   .3765319    .248459     1.52   0.130    -.1104389    .8635026
          5  |   .9439006   .0642861    14.68   0.000     .8179022    1.069899
          6  |   .2237841   .3563414     0.63   0.530    -.4746322    .9222005
          7  |   .0365371    .047713     0.77   0.444    -.0569786    .1300528
          8  |   .0088693   .0187214     0.47   0.636    -.0278239    .0455625
------------------------------------------------------------------------------

. lincom 1.gp-2.gp;

 ( 1)  [hrej]1b.gp - [hrej]2.gp = 0

------------------------------------------------------------------------------
        hrej | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   3.452811   1.534716     2.25   0.024      .444823    6.460799
------------------------------------------------------------------------------

. lincom 3.gp-4.gp;

 ( 1)  [hrej]3.gp - [hrej]4.gp = 0

------------------------------------------------------------------------------
        hrej | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |    1.89184   2.180904     0.87   0.386    -2.382654    6.166334
------------------------------------------------------------------------------

. lincom 5.gp-6.gp;

 ( 1)  [hrej]5.gp - [hrej]6.gp = 0

------------------------------------------------------------------------------
        hrej | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   4.066644   2.412991     1.69   0.092    -.6627318     8.79602
------------------------------------------------------------------------------

. lincom 7.gp-8.gp;

 ( 1)  [hrej]7.gp - [hrej]8.gp = 0

------------------------------------------------------------------------------
        hrej | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         (1) |   1.444044   2.158425     0.67   0.503    -2.786391     5.67448
------------------------------------------------------------------------------

. save /volumes/ddisk/data/junkrej.dta, replace;
file /volumes/ddisk/data/junkrej.dta saved

. *GRAPHICAL ANALYSIS OF BELIEFS AND HYPOTHESIS REJECTION;
. *DONE AT THE TEAM-CONCLUSION LEVEL, AND USING THE PB1 MEASURE OF BELIEFS;
. *collapse (mean) rneg hrej pb1, by(teamid);
. replace code=0.075 if code==1;
(35 real changes made)

. replace code=0.325 if code==2;
(23 real changes made)

. replace code=0.5 if code==3;
(9 real changes made)

. replace code=0.75 if code==4;
(20 real changes made)

. tabulate code;

       code |      Freq.     Percent        Cum.
------------+-----------------------------------
       .075 |         35       40.23       40.23
       .325 |         23       26.44       66.67
         .5 |          9       10.34       77.01
        .75 |         20       22.99      100.00
------------+-----------------------------------
      Total |         87      100.00

. collapse (mean) hrej, by(code pb1);

. reshape wide hrej, i(code) j(pb1);
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations                8   ->   4           
Number of variables                   3   ->   3           
j variable (2 values)               pb1   ->   (dropped)
xij variables:
                                   hrej   ->   hrej0 hrej1
-----------------------------------------------------------------------------

. list;

     +------------------------------+
     | code       hrej0       hrej1 |
     |------------------------------|
  1. | .075   .86666667         .75 |
  2. | .325   .89999998   .69230771 |
  3. |   .5   .66666669   .33333334 |
  4. |  .75   .15384616   .14285715 |
     +------------------------------+

. scatter hrej* code, connect(l l)
>         legend(pos(6) rows(1)) legend(order(1 "No belief in hypothesis" 2 "Strong be
> lief in hypothesis"))       
>         saving(/volumes/ddisk/mi/researcher/rejection.gph, replace);
file /volumes/ddisk/mi/researcher/rejection.gph saved

. use /volumes/ddisk/data/junkrej.dta, clear;

. log close;
      name:  <unnamed>
       log:  /volumes/ddisk/mi/researcher/reg_reject.log
  log type:  text
 closed on:  10 Oct 2024, 13:13:17
--------------------------------------------------------------------------------------
