-------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /volumes/ddisk/mi/researcher/reg_logit.log
  log type:  text
 opened on:   7 Nov 2024, 11:40:54

. clear matrix;

. clear mata;

. *LOGIT REGRESSIONS;
. use /volumes/ddisk/mi/researcher/model.dta, clear;

. *MAIN OLS SPECIFICATION FOR CHECK;
. reg ame  group1 group3    stats_brw topic_brw t2 t3 i.mdegree   [aw=1/nmodel] ,  cl
> uster(teamid);
(sum of wgt is 71)

Linear regression                               Number of obs     =      1,253
                                                F(14, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0706
                                                Root MSE          =     .19792

                                (Std. err. adjusted for 71 clusters in teamid)
------------------------------------------------------------------------------
             |               Robust
         ame | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.0571549   .0311836    -1.83   0.071    -.1193487    .0050389
      group3 |   .0258119   .0140092     1.84   0.070    -.0021287    .0537525
   stats_brw |   .0342449   .0157071     2.18   0.033     .0029181    .0655717
   topic_brw |   -.040575   .0159729    -2.54   0.013    -.0724321    -.008718
          t2 |  -.0075102   .0160952    -0.47   0.642     -.039611    .0245906
          t3 |   .0071531   .0230537     0.31   0.757    -.0388261    .0531322
             |
     mdegree |
          1  |   .4762511   .0591875     8.05   0.000     .3582053     .594297
          2  |   .2609921   .0268059     9.74   0.000     .2075294    .3144548
          3  |   .2757381   .0201218    13.70   0.000     .2356065    .3158697
          4  |   .2728927   .0193656    14.09   0.000     .2342692    .3115161
          5  |   .3257124   .0290007    11.23   0.000     .2678723    .3835525
          6  |   .2517677   .0230525    10.92   0.000      .205791    .2977444
         20  |   .2765865   .0325436     8.50   0.000     .2116803    .3414927
         33  |   .2823312     .02501    11.29   0.000     .2324503     .332212
         34  |   .2759335   .0142331    19.39   0.000     .2475464    .3043206
         35  |   .1831558    .068006     2.69   0.009      .047522    .3187895
         36  |   .3339769   .0298844    11.18   0.000     .2743744    .3935795
         40  |   .2809944   .0243576    11.54   0.000     .2324147    .3295741
             |
       _cons |  -.2905251   .0266369   -10.91   0.000    -.3436507   -.2373994
------------------------------------------------------------------------------

. *LOGIT REGRESSIONS ON OUTLYING NEGATIVE & SIGNIFICANT COEFFICIENTS;
. quietly logit neg10s   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  clust
> er(teamid);

. margins, dydx(stats_brw-topic_brw);

Average marginal effects                                 Number of obs = 1,153
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   stats_brw |  -.1179114   .0452808    -2.60   0.009    -.2066601   -.0291627
   topic_brw |   .1043523   .0289606     3.60   0.000     .0475906    .1611141
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-20.36202     .10757384

. quietly logit neg10s dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,
>   cluster(teamid);

. margins, dydx(dindex-topic_brw);

Average marginal effects                                 Number of obs = 1,153
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  dindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.1322415   .0379903    -3.48   0.000    -.2067012   -.0577818
   stats_brw |   -.090122    .031393    -2.87   0.004    -.1516511    -.028593
   topic_brw |   .0841109   .0212331     3.96   0.000     .0424948     .125727
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-18.934453     .17014118

. quietly logit neg10s dindex   pbelief stats_brw topic_brw t2 t3 i.mdegree  [iw=1/nm
> odel] ,  cluster(teamid);

. margins, dydx(dindex-topic_brw);

Average marginal effects                                 Number of obs = 1,153
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  dindex pbelief stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.1188963   .0410626    -2.90   0.004    -.1993774   -.0384151
     pbelief |  -.0554436   .0585316    -0.95   0.344    -.1701634    .0592762
   stats_brw |  -.0925119   .0316909    -2.92   0.004     -.154625   -.0303988
   topic_brw |   .0834399   .0231015     3.61   0.000     .0381619     .128718
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-18.841335     .17422238

. quietly logit neg10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nm
> odel] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,153
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  group1 group3 stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .0804682   .0603244     1.33   0.182    -.0377655    .1987019
      group3 |  -.1092026   .0374526    -2.92   0.004    -.1826083   -.0357969
   stats_brw |   -.078746   .0279755    -2.81   0.005     -.133577    -.023915
   topic_brw |   .0803528   .0185775     4.33   0.000     .0439416    .1167641
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-18.681873     .18121126

. quietly logit neg10s group1 group3   pbelief stats_brw topic_brw t2 t3 i.mdegree  [
> iw=1/nmodel] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,153
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  group1 group3 pbelief stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .0977193   .0575597     1.70   0.090    -.0150957    .2105343
      group3 |  -.0865905   .0410263    -2.11   0.035    -.1670005   -.0061804
     pbelief |  -.0788616   .0549865    -1.43   0.152    -.1866332    .0289099
   stats_brw |  -.0784474   .0269388    -2.91   0.004    -.1312466   -.0256483
   topic_brw |   .0774677   .0194602     3.98   0.000     .0393264     .115609
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-18.492957     .18949106

. quietly logit neg10s proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel]
>  ,  cluster(teamid);

. margins, dydx(proindex-topic_brw);

Average marginal effects                                 Number of obs = 1,153
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  proindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0535262   .0208104    -2.57   0.010    -.0943139   -.0127385
   stats_brw |  -.0902435   .0345315    -2.61   0.009    -.1579241   -.0225629
   topic_brw |   .0838368   .0212833     3.94   0.000     .0421224    .1255512
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-19.447136     .14767132

. quietly logit neg10s proindex   pbelief stats_brw topic_brw t2 t3 i.mdegree  [iw=1/
> nmodel] ,  cluster(teamid);

. margins, dydx(proindex-topic_brw);

Average marginal effects                                 Number of obs = 1,153
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  proindex pbelief stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0515126   .0198534    -2.59   0.009    -.0904245   -.0126006
     pbelief |  -.0962275   .0483512    -1.99   0.047     -.190994   -.0014609
   stats_brw |  -.0929662   .0333352    -2.79   0.005     -.158302   -.0276304
   topic_brw |   .0826829   .0211108     3.92   0.000     .0413064    .1240593
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-19.125365     .1617739

. *LOGIT REGRESSIONS ON OUTLYING POSITIVE & SIGNIFICANT COEFFICIENTS;
. quietly logit pos10s   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,  clust
> er(teamid);

. margins, dydx(stats_brw-topic_brw);

Average marginal effects                                 Number of obs = 1,109
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   stats_brw |   .0337127    .021507     1.57   0.117    -.0084402    .0758656
   topic_brw |  -.0594323   .0387322    -1.53   0.125    -.1353459    .0164814
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-15.199635     .12236277

. quietly logit pos10s group1   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel] ,
>   cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,109
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  group1 stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.1609874   .0687166    -2.34   0.019    -.2956695   -.0263054
   stats_brw |    .023293   .0215612     1.08   0.280    -.0189663    .0655522
   topic_brw |  -.0496061   .0370874    -1.34   0.181    -.1222961    .0230839
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-14.911399     .13900573

. quietly logit pos10s group1   pbelief stats_brw topic_brw t2 t3 i.mdegree  [iw=1/nm
> odel] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,109
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  group1 pbelief stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.1622634    .067739    -2.40   0.017    -.2950295   -.0294974
     pbelief |  -.0151907   .0417743    -0.36   0.716    -.0970668    .0666854
   stats_brw |   .0220473   .0205659     1.07   0.284    -.0182611    .0623556
   topic_brw |  -.0478537   .0364745    -1.31   0.190    -.1193424     .023635
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-14.900609     .13962873

. quietly logit pos10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nm
> odel] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,109
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  group1 group3 stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.1645012   .0684761    -2.40   0.016    -.2987118   -.0302905
      group3 |  -.0138078   .0396733    -0.35   0.728    -.0915661    .0639504
   stats_brw |   .0249551   .0213784     1.17   0.243    -.0169458    .0668561
   topic_brw |  -.0520334   .0382942    -1.36   0.174    -.1270887    .0230219
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-14.898339     .13975983

. quietly logit pos10s group1 group3   pbelief stats_brw topic_brw t2 t3 i.mdegree  [
> iw=1/nmodel] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,109
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  group1 group3 pbelief stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.1648265    .068045    -2.42   0.015    -.2981924   -.0314607
      group3 |  -.0114238   .0383255    -0.30   0.766    -.0865404    .0636928
     pbelief |  -.0119528   .0400762    -0.30   0.766    -.0905007     .066595
   stats_brw |    .023677   .0203777     1.16   0.245    -.0162626    .0636166
   topic_brw |  -.0502664   .0378406    -1.33   0.184    -.1244326    .0238998
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-14.892087     .1401208

. quietly logit pos10s proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=1/nmodel]
>  ,  cluster(teamid);

. margins, dydx(proindex-topic_brw);

Average marginal effects                                 Number of obs = 1,109
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  proindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0218163   .0196603     1.11   0.267    -.0167171    .0603497
   stats_brw |   .0250395   .0244173     1.03   0.305    -.0228176    .0728965
   topic_brw |   -.046393   .0382148    -1.21   0.225    -.1212926    .0285065
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-15.068274     .12994764

. quietly logit pos10s proindex   pbelief stats_brw topic_brw t2 t3 i.mdegree  [iw=1/
> nmodel] ,  cluster(teamid);

. margins, dydx(proindex-topic_brw);

Average marginal effects                                 Number of obs = 1,109
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  proindex pbelief stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0265465   .0194828     1.36   0.173     -.011639     .064732
     pbelief |  -.0331861   .0347641    -0.95   0.340    -.1013224    .0349503
   stats_brw |   .0206391   .0235127     0.88   0.380    -.0254449    .0667231
   topic_brw |  -.0396188   .0370973    -1.07   0.286    -.1123281    .0330905
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-15.022069     .13261558

. *LOGIT WEIGHTED REGRESSIONS ON OUTLYING NEGATIVE & SIGNIFICANT COEFFICIENTS;
. quietly logit neg10s   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,  
> cluster(teamid);

. margins, dydx(stats_brw-topic_brw);

Average marginal effects                                 Number of obs = 1,153
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   stats_brw |  -.1174658   .0493177    -2.38   0.017    -.2141267   -.0208048
   topic_brw |   .1070115   .0313965     3.41   0.001     .0454755    .1685474
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-90.426271     .10449783

. quietly logit neg10s dindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmod
> el] ,  cluster(teamid);

. margins, dydx(dindex-topic_brw);

Average marginal effects                                 Number of obs = 1,153
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  dindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.1461498   .0407073    -3.59   0.000    -.2259346    -.066365
   stats_brw |  -.0928616   .0329606    -2.82   0.005    -.1574632   -.0282599
   topic_brw |    .088081   .0229314     3.84   0.000     .0431363    .1330257
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-83.437778     .17370571

. quietly logit neg10s dindex   pbelief stats_brw topic_brw t2 t3 i.mdegree  [iw=psco
> re/nmodel] ,  cluster(teamid);

. margins, dydx(dindex-topic_brw);

Average marginal effects                                 Number of obs = 1,153
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  dindex pbelief stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      dindex |  -.1314326   .0440917    -2.98   0.003    -.2178507   -.0450145
     pbelief |  -.0594099    .064445    -0.92   0.357    -.1857197    .0668999
   stats_brw |  -.0952679   .0335361    -2.84   0.005    -.1609974   -.0295383
   topic_brw |   .0872766   .0251926     3.46   0.001     .0379001    .1366531
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-83.029499     .17774894

. quietly logit neg10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=psco
> re/nmodel] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,153
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  group1 group3 stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .0893997   .0661675     1.35   0.177    -.0402862    .2190856
      group3 |  -.1206775   .0382432    -3.16   0.002    -.1956328   -.0457222
   stats_brw |  -.0776129   .0271837    -2.86   0.004     -.130892   -.0243338
   topic_brw |   .0824189   .0192018     4.29   0.000     .0447841    .1200537
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-82.203583     .18592809

. quietly logit neg10s group1 group3   pbelief stats_brw topic_brw t2 t3 i.mdegree  [
> iw=pscore/nmodel] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,153
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  group1 group3 pbelief stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |   .1077484   .0624831     1.72   0.085    -.0147163    .2302131
      group3 |  -.0953714   .0415647    -2.29   0.022    -.1768367    -.013906
     pbelief |  -.0855382   .0592071    -1.44   0.149    -.2015819    .0305056
   stats_brw |  -.0767819   .0264538    -2.90   0.004    -.1286304   -.0249334
   topic_brw |   .0790615   .0203189     3.89   0.000     .0392372    .1188858
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-81.346788     .19441303

. quietly logit neg10s proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nm
> odel] ,  cluster(teamid);

. margins, dydx(proindex-topic_brw);

Average marginal effects                                 Number of obs = 1,153
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  proindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0611989   .0238397    -2.57   0.010    -.1079239   -.0144738
   stats_brw |  -.0896635   .0358096    -2.50   0.012     -.159849   -.0194781
   topic_brw |   .0864145   .0224728     3.85   0.000     .0423687    .1304604
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-85.846039     .14985641

. quietly logit neg10s proindex   pbelief stats_brw topic_brw t2 t3 i.mdegree  [iw=ps
> core/nmodel] ,  cluster(teamid);

. margins, dydx(proindex-topic_brw);

Average marginal effects                                 Number of obs = 1,153
Model VCE: Robust

Expression: Pr(neg10s), predict()
dy/dx wrt:  proindex pbelief stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |  -.0583128   .0228494    -2.55   0.011    -.1030968   -.0135289
     pbelief |  -.1044701   .0529748    -1.97   0.049    -.2082988   -.0006413
   stats_brw |  -.0930198   .0351104    -2.65   0.008    -.1618349   -.0242047
   topic_brw |   .0854135   .0226712     3.77   0.000     .0409787    .1298483
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-84.372164     .16445237

. *LOGIT WEIGHTED REGRESSIONS ON OUTLYING POSITIVE & SIGNIFICANT COEFFICIENTS;
. quietly logit pos10s   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmodel] ,  
> cluster(teamid);

. margins, dydx(stats_brw-topic_brw);

Average marginal effects                                 Number of obs = 1,109
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   stats_brw |    .034929   .0216081     1.62   0.106     -.007422      .07728
   topic_brw |  -.0597477    .036151    -1.65   0.098    -.1306024    .0111069
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-62.39427     .1241705

. quietly logit pos10s group1   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nmod
> el] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,109
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  group1 stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.1578031   .0686056    -2.30   0.021    -.2922676   -.0233386
   stats_brw |   .0245416   .0218422     1.12   0.261    -.0182683    .0673515
   topic_brw |  -.0497412   .0347202    -1.43   0.152    -.1177916    .0183092
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-61.223935     .14059852

. quietly logit pos10s group1   pbelief stats_brw topic_brw t2 t3 i.mdegree  [iw=psco
> re/nmodel] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,109
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  group1 pbelief stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.1602674   .0674016    -2.38   0.017    -.2923721   -.0281627
     pbelief |  -.0283287   .0385549    -0.73   0.462    -.1038949    .0472375
   stats_brw |   .0222592   .0203305     1.09   0.274    -.0175879    .0621062
   topic_brw |  -.0463389   .0329645    -1.41   0.160    -.1109481    .0182704
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-61.06408     .1428424

. quietly logit pos10s group1 group3   stats_brw topic_brw  t2 t3 i.mdegree  [iw=psco
> re/nmodel] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,109
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  group1 group3 stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.1620179   .0682969    -2.37   0.018    -.2958774   -.0281584
      group3 |  -.0172895   .0388533    -0.44   0.656    -.0934405    .0588615
   stats_brw |   .0265833   .0209306     1.27   0.204    -.0144399    .0676065
   topic_brw |  -.0532119   .0359774    -1.48   0.139    -.1237262    .0173024
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-61.129784     .14192011

. quietly logit pos10s group1 group3   pbelief stats_brw topic_brw t2 t3 i.mdegree  [
> iw=pscore/nmodel] ,  cluster(teamid);

. margins, dydx(group1-topic_brw);

Average marginal effects                                 Number of obs = 1,109
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  group1 group3 pbelief stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      group1 |  -.1627836   .0677277    -2.40   0.016    -.2955274   -.0300397
      group3 |  -.0121827   .0374346    -0.33   0.745    -.0855532    .0611879
     pbelief |  -.0244739   .0364667    -0.67   0.502    -.0959472    .0469995
   stats_brw |   .0239652   .0196198     1.22   0.222    -.0144889    .0624193
   topic_brw |  -.0492851   .0345015    -1.43   0.153    -.1169067    .0183366
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-61.019517     .14346794

. quietly logit pos10s proindex   stats_brw topic_brw  t2 t3 i.mdegree  [iw=pscore/nm
> odel] ,  cluster(teamid);

. margins, dydx(proindex-topic_brw);

Average marginal effects                                 Number of obs = 1,109
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  proindex stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0171497   .0184887     0.93   0.354    -.0190875    .0533869
   stats_brw |   .0280943   .0242972     1.16   0.248    -.0195273     .075716
   topic_brw |  -.0492649   .0360473    -1.37   0.172    -.1199164    .0213865
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-62.033673     .12923222

. quietly logit pos10s proindex   pbelief stats_brw topic_brw t2 t3 i.mdegree  [iw=ps
> core/nmodel] ,  cluster(teamid);

. margins, dydx(proindex-topic_brw);

Average marginal effects                                 Number of obs = 1,109
Model VCE: Robust

Expression: Pr(pos10s), predict()
dy/dx wrt:  proindex pbelief stats_brw topic_brw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    proindex |   .0226624   .0181289     1.25   0.211    -.0128697    .0581944
     pbelief |  -.0424507   .0324922    -1.31   0.191    -.1061341    .0212328
   stats_brw |   .0226062   .0231495     0.98   0.329    -.0227659    .0679783
   topic_brw |  -.0404159   .0341867    -1.18   0.237    -.1074206    .0265887
------------------------------------------------------------------------------

. display e(ll) _skip(5) e(r2_p);
-61.708026     .13380332

. log close;
      name:  <unnamed>
       log:  /volumes/ddisk/mi/researcher/reg_logit.log
  log type:  text
 closed on:   7 Nov 2024, 11:41:04
-------------------------------------------------------------------------------------
